{"data": {"product_id": "1623170913.846896w0F1T2BZX6NGYEpQB3yS6k6Wh503", "company_id": "w0F1T2BZX6NGYEpQB3yS6k6Wh503", "product_name": "UnbuckleMe Car Seat Buckle Release Tool - As Seen on Shark Tank - Makes it Easy to Unbuckle a Child's Car Seat - Easy Tool for Parents, Grandparents & Older Children (2 Pack, Blue & Red)", "1": {"title": "Sentiment Per Category", "description": "sentiment_par_category_description", "sentiment_per_category": [{"category": "carseat", "score": 0.097}, {"category": "durable", "score": -0.106}, {"category": "easy", "score": 0.385}, {"category": "grandchild", "score": 0.236}, {"category": "granddaughter", "score": -0.298}, {"category": "grandkids", "score": 0.243}, {"category": "price", "score": 0.202}, {"category": "quality", "score": 0.328}]}, "2": {"title": "Sentiment Per Variant", "description": "sentiment_variant_description", "sentiment_per_variant": [{"variant": "Size: 2 Pack Color: Blue & Pink", "score": 0.234}, {"variant": "Size: 2 Pack Color: Blue & Red", "score": 0.336}]}, "3": {"title": "Distributions of Star Rating", "description": "star_variant_description", "distributions_of_sentiment": [{"rating": 1.0, "sentence": 7}, {"rating": 3.0, "sentence": 5}, {"rating": 4.0, "sentence": 12}, {"rating": 5.0, "sentence": 126}]}, "4": {"title": "Distributions of Sentiment", "description": "This is the plot of distributions of the sentiment rating of this product ", "distributions_of_star": [{"star_scale_sentiments": 2, "sentence": 14}, {"star_scale_sentiments": 3, "sentence": 53}, {"star_scale_sentiments": 4, "sentence": 73}, {"star_scale_sentiments": 5, "sentence": 10}]}, "5": {"title": " line graphs", "description1": "this is the trendline plot for this product's sentiment for all time", "product_trend_all": {"regression_line": [{"x": "2020-11-23", "y": 0.3}, {"x": "2021-06-06", "y": 0.286}], "points": [{"x": "2020-11-23", "y": 0.34}, {"x": "2020-11-28", "y": 0.343}, {"x": "2020-11-30", "y": -0.211}, {"x": "2020-12-15", "y": -0.022}, {"x": "2020-12-17", "y": 0.243}, {"x": "2020-12-18", "y": 0.366}, {"x": "2020-12-20", "y": 0.22}, {"x": "2020-12-30", "y": 0.223}, {"x": "2021-01-17", "y": 0.44}, {"x": "2021-01-22", "y": 0.166}, {"x": "2021-01-24", "y": 0.407}, {"x": "2021-02-09", "y": -0.011}, {"x": "2021-02-21", "y": 0.625}, {"x": "2021-02-23", "y": 0.586}, {"x": "2021-02-26", "y": 0.414}, {"x": "2021-02-28", "y": 0.496}, {"x": "2021-03-07", "y": 0.395}, {"x": "2021-03-08", "y": 0.309}, {"x": "2021-03-19", "y": 0.233}, {"x": "2021-03-21", "y": 0.659}, {"x": "2021-03-23", "y": 0.219}, {"x": "2021-03-24", "y": 0.296}, {"x": "2021-03-28", "y": 0.694}, {"x": "2021-03-31", "y": 0.477}, {"x": "2021-04-05", "y": 0.128}, {"x": "2021-04-06", "y": 0.318}, {"x": "2021-04-15", "y": 0.518}, {"x": "2021-04-22", "y": 0.149}, {"x": "2021-04-24", "y": 0.379}, {"x": "2021-04-25", "y": 0.48}, {"x": "2021-04-27", "y": 0.144}, {"x": "2021-05-04", "y": 0.511}, {"x": "2021-05-19", "y": -0.078}, {"x": "2021-05-21", "y": 0.75}, {"x": "2021-05-29", "y": 0.233}, {"x": "2021-06-02", "y": 0.068}, {"x": "2021-06-03", "y": 0.292}, {"x": "2021-06-04", "y": -0.106}, {"x": "2021-06-06", "y": -0.298}]}, "description2": "this is the trendline plot for this product's sentiment for one year", "product_trend_1year": {"regression_line": [{"x": "2020-11-23", "y": 0.3}, {"x": "2021-06-06", "y": 0.286}], "points": [{"x": "2020-11-23", "y": 0.34}, {"x": "2020-11-28", "y": 0.343}, {"x": "2020-11-30", "y": -0.211}, {"x": "2020-12-15", "y": -0.022}, {"x": "2020-12-17", "y": 0.243}, {"x": "2020-12-18", "y": 0.366}, {"x": "2020-12-20", "y": 0.22}, {"x": "2020-12-30", "y": 0.223}, {"x": "2021-01-17", "y": 0.44}, {"x": "2021-01-22", "y": 0.166}, {"x": "2021-01-24", "y": 0.407}, {"x": "2021-02-09", "y": -0.011}, {"x": "2021-02-21", "y": 0.625}, {"x": "2021-02-23", "y": 0.586}, {"x": "2021-02-26", "y": 0.414}, {"x": "2021-02-28", "y": 0.496}, {"x": "2021-03-07", "y": 0.395}, {"x": "2021-03-08", "y": 0.309}, {"x": "2021-03-19", "y": 0.233}, {"x": "2021-03-21", "y": 0.659}, {"x": "2021-03-23", "y": 0.219}, {"x": "2021-03-24", "y": 0.296}, {"x": "2021-03-28", "y": 0.694}, {"x": "2021-03-31", "y": 0.477}, {"x": "2021-04-05", "y": 0.128}, {"x": "2021-04-06", "y": 0.318}, {"x": "2021-04-15", "y": 0.518}, {"x": "2021-04-22", "y": 0.149}, {"x": "2021-04-24", "y": 0.379}, {"x": "2021-04-25", "y": 0.48}, {"x": "2021-04-27", "y": 0.144}, {"x": "2021-05-04", "y": 0.511}, {"x": "2021-05-19", "y": -0.078}, {"x": "2021-05-21", "y": 0.75}, {"x": "2021-05-29", "y": 0.233}, {"x": "2021-06-02", "y": 0.068}, {"x": "2021-06-03", "y": 0.292}, {"x": "2021-06-04", "y": -0.106}, {"x": "2021-06-06", "y": -0.298}]}, "description3": "this is the trendline plot for this product's star rating for all time", "product_trend_all_star": {"regression_line": [{"x": "2020-11-23", "y": 4.847}, {"x": "2021-06-06", "y": 4.337}], "points": [{"x": "2020-11-23", "y": 5.0}, {"x": "2020-11-28", "y": 5.0}, {"x": "2020-11-30", "y": 1.0}, {"x": "2020-12-15", "y": 4.778}, {"x": "2020-12-17", "y": 5.0}, {"x": "2020-12-18", "y": 5.0}, {"x": "2020-12-20", "y": 5.0}, {"x": "2020-12-30", "y": 5.0}, {"x": "2021-01-17", "y": 5.0}, {"x": "2021-01-22", "y": 5.0}, {"x": "2021-01-24", "y": 5.0}, {"x": "2021-02-09", "y": 5.0}, {"x": "2021-02-21", "y": 5.0}, {"x": "2021-02-23", "y": 5.0}, {"x": "2021-02-26", "y": 5.0}, {"x": "2021-02-28", "y": 5.0}, {"x": "2021-03-07", "y": 5.0}, {"x": "2021-03-08", "y": 5.0}, {"x": "2021-03-19", "y": 5.0}, {"x": "2021-03-21", "y": 5.0}, {"x": "2021-03-23", "y": 5.0}, {"x": "2021-03-24", "y": 5.0}, {"x": "2021-03-28", "y": 5.0}, {"x": "2021-03-31", "y": 1.0}, {"x": "2021-04-05", "y": 5.0}, {"x": "2021-04-06", "y": 5.0}, {"x": "2021-04-15", "y": 5.0}, {"x": "2021-04-22", "y": 5.0}, {"x": "2021-04-24", "y": 5.0}, {"x": "2021-04-25", "y": 5.0}, {"x": "2021-04-27", "y": 4.25}, {"x": "2021-05-04", "y": 5.0}, {"x": "2021-05-19", "y": 3.0}, {"x": "2021-05-21", "y": 5.0}, {"x": "2021-05-29", "y": 5.0}, {"x": "2021-06-02", "y": 5.0}, {"x": "2021-06-03", "y": 5.0}, {"x": "2021-06-04", "y": 3.0}, {"x": "2021-06-06", "y": 1.0}]}}, "summary": {"nps": -0.4, "num_of_reviews": "44", "topics": "carseat, grandkids, harness, grandchild, granddaughter, unbuckle, seat, grandma, easier, help, used, parent, kid, arthritis, chair, genius, using, use, great, worked, car, grandson, baby, good, hand, thank, it, plastic, able, unbuckleme, child, very, buckle, old, easily, button, gadget, motor, oldest, make, cup, mom, fantastic, gave, recommend, thumb, and ordered", "date": "2021-06-08", "category_data": {"price": [{"date": "2021-04-15", "score": -0.421, "review": "Granddaughter can now get out on her own ."}, {"date": "2021-04-24", "score": 0.874, "review": "I LOVE this product! I saw it on Good Morning America. It is a Life saver for unbuckling car seats & strollers for grandparents, parents, baby sitters. We ordered them for all the grandkids parents cars & grandparent friends. I also like how it has a place to attach cord, ribbon etc so it is always near by!!! You will find this incrediblly helpful!!"}], "durable": [{"date": "2021-05-04", "score": -0.106, "review": "Perfect for those car seat buttons that are hard to push."}], "easy": [{"date": "2020-11-23", "score": 0.34, "review": "Able to undo the seat belt buckle easily"}, {"date": "2020-11-30", "score": 0.44, "review": "Received this on November 13, today is the 30th and it already broke. Plastic in the curve snapped."}, {"date": "2021-06-02", "score": 0.963, "review": "I could never get the darn thing undone for my 4 year old grandson. His teacher told me about it. I watched the Shark tank episode on YouTube and sent away for it. Even my grandson is able to do it now. I dont have to worry anymore that it will take me forever to get him out of his car seat."}], "quality": [{"date": "2020-12-05", "score": 0.976, "review": ""}, {"date": "2020-12-20", "score": 0.659, "review": "Helps when I need to pick up grands - could have used it with my kids!!"}, {"date": "2020-12-30", "score": 0.658, "review": "Sooo grateful that I found this! I was having difficulty getting our infant grandson unbuckled from his car seat, his swing, and from his new stroller. This inexpensive little gadget has saved me from having to avoid the swing and buy a new carseat & strolller with better buckles."}, {"date": "2021-01-17", "score": 0.625, "review": "It's easy to use"}, {"date": "2021-01-24", "score": 0.904, "review": "I Love this!! Makes taking my grandson out with me so much easier!!"}, {"date": "2021-02-21", "score": 0.637, "review": "Was a great product luved it"}, {"date": "2021-02-23", "score": -0.518, "review": "This was really easy to use , I would recommend this to anyone that has a hard time using the fingers. I use this getting my Granddaughter out of her carseat  so much easier on my finger.  Love this"}, {"date": "2021-03-08", "score": 0.955, "review": "Unbuckle me is fantastic not only for my kids but for me and my wife especially during these times of the pandemic. During drop off to school we cant get out of the car to unbuckle my 5 and 7 year old because of the rules. Its super easy my kids have no problem using it. Very simple to use. I would recommend this to anyone that has kids in car seats its simple and easy."}, {"date": "2021-03-21", "score": 0.978, "review": "Great!"}, {"date": "2021-03-28", "score": 0.79, "review": "As a 60 year old, first time Grandmother, with reduced hand strength and thumb arthritis, as well, this gadget is a game changer.  I love it!  Thank you and best of luck with your new family business.  I highly recommend this product."}, {"date": "2021-04-15", "score": 0.809, "review": "Honestly it was a greatest thing I've bought. when it comes to any mothers with kids in carseats this is a must-have, perfect baby shower gifts!"}, {"date": "2021-04-27", "score": 0.856, "review": "Works great! This is the second time I've purchased these. First round was the black and white.  They worked great, the only issue was keeping up with them.  I bought them so my 4yr old preschoolers could unbuckle themselves in the drop-off line.  For a while we managed to keep them in the cup holders of the car seats, however,  over time they would get dropped or taken out or lost,  then eventually stepped on. This lead me to try a competitor that attached to the buckle strap. The problem was,  there was no back (part that goes behind the buckle) to the product,  and they constantly fell off.  So, I'm back to the UnbuckleMe, this time in fun new colors! They really do work great.  Only reason for 4 starts instead of 5 is because I had to purchase a separate tether to keep these attached to the car seats so my 4 yr olds can use them and not lose them.  But, a pro is, there is a loop for keyring on every UnbuckleMe! "}, {"date": "2021-04-27", "score": 0.897, "review": "Bought it for grandma but my 4 year old can now use it to unbuckle the bottom buckle which is good for the car drop off line. Saves time. Fun for kids. The only bad thing is it is costly, so don't lose it!"}, {"date": "2021-06-04", "score": 0.915, "review": "Almost as hard to use this as my thumb!"}], "carseat": [{"date": "2021-03-07", "score": 0.511, "review": "I bought this for parents to use who have arthritis in their hands. It works great and helps for smoother in and out of the car seat experience for them and the grandkids !"}, {"date": "2021-04-25", "score": 0.806, "review": "I love the Unbuckle Me!  It is easy for my children to use.  We have a van full of car seats and I can't always reach our kids in the back to unbuckle, so the Unbuckle Me has saved us a great deal of difficulty.  We tried some of the cheaper options, but our kids were not able to even get them on the buckle.  The Unbuckle Me is the real deal - the only one my kids can use independently and successfully."}, {"date": "2021-04-25", "score": 0.321, "review": "So glad I came across this gadget. Mom has hand arthritis, too.  This is perfect for her to use when unbuckling her granddaughter from high chair."}, {"date": "2021-05-19", "score": -0.515, "review": "At first these took some getting used to for the kids. But after a couple months they snapped easily. Broken and useless."}], "grandkids": [{"date": "2020-12-18", "score": 0.801, "review": "This unbuckle me is a great product. With 2 young school age grandkids getting them out of the car seats is so much easier. Especially since they can unbuckle themselves with this."}, {"date": "2021-01-22", "score": 0.699, "review": "I have little ones who want to be independent, but who struggle with the crotch buckle on the car seat. This is a great learning tool to help them learn how to unbuckle themselves."}, {"date": "2021-02-26", "score": 0.841, "review": "Awsome, I can hand it to my granddaughter to unbuckle the latch Best gadget ever!when I have to park and dont have access to the door on her side of the car.  ex: next to snow bank."}, {"date": "2021-03-19", "score": 0.917, "review": "This order of 2 of these godsends is my second order.  I ordered the first because my dil saw them while browsing.  When it got here it was so cool and worked so well that I gave it to her to use on vacation and ordered these two to have one for me and one for the extra car!!  This is a genius idea and my fingernails and grandchildren thank you!!"}, {"date": "2021-03-31", "score": -0.696, "review": "Bought this to help due to poor hand strength.  These do not reach around the buckle and the part that is supposed to help is not in the right spot. Do not waste your money."}, {"date": "2021-05-21", "score": 0.491, "review": "Easy to use and will save my nails!"}], "harness": [], "grandchild": [{"date": "2020-11-28", "score": 0.341, "review": "My 4 year old loves his unbuckle me. We have had it for almost a week and he loves the independence it gives him when I stop the car and he can get himself out of his car seat. We have not been able to find a good place to keep it when Im driving, so we decided to hang it on the side of his cup holder and that seems to work for him. So far it has been exactly what I expected!"}, {"date": "2020-12-15", "score": 0.857, "review": "I did not care for how far in the peg was it made it difficult to get it on top of my sons car seat buckle button."}, {"date": "2020-12-15", "score": 0.852, "review": "I used to keep an unsharpened pencil in the car and used the eraser end to push the button to unbuckle my granddaughter. I've only used this product for a short time but it has become a must-have tool. It cuts down on the time I spend out in the weather as well as reduces the time I'm exposing my granddaughter to the outdoor elements. To date, I am extremely happy w/the tool. I only gave 3 stars on the thickness because I really don't understand the category? Thickness? Is it supposed to be thinner? Thicker?"}, {"date": "2020-12-17", "score": 0.728, "review": "My five year old grandson could unbuckle his and his 3 year old sisters buckle on their car seats.  I have arthritis and he was so excited to be able to help me! Grandma Sula"}, {"date": "2021-02-09", "score": 0.855, "review": "Overall a great product! It can be a little tricky to get into place with an older child in a 5 point harness, but it's doable and eliminates pain in my hands."}, {"date": "2021-03-23", "score": 0.686, "review": "I have struggled getting my grandchildren out of their car seats because of the buckles and the arthritis in my hands.  This little invention helps in a big way.  I can't believe how simple it is now. My 5 year old wanted to try it.  She mastered it on the first try. This will be especially wonderful to have on rainy days, when she can unbuckle and be ready to get out of the car, and I won't get soaking wet trying to unbuckle her. Thanks so much for this UnbuckleMe Tool.  It is fantastic!"}, {"date": "2021-03-24", "score": 0.911, "review": "Pregnant with baby #3 and my oldest child (almost five) has a physical disability that makes fine motor and gross motor skills more challenging. We realized with the baby coming that it makes the most sense to move my oldest to the back seat in the van, but that would mean he would need to become more independent with his car seat. Enter the UnbuckleMe! Just spent 5 mins practicing and hes already got it down. We attached ours to a retractable keychain on the chair. He can grab, place the unbuckle me on the bottom buckle, squeeze, and hes free! The UnbuckleMe is very easy to squeeze (unlike the Car Seat Key which is hard plastic) and big to hold in your hand (cant accidentally drop it!). Sometimes it will only release one side of the harness, but my son realized quickly that it just meant he had to press it again. I got the two pack so he could take one to occupational therapy with him, but Im pretty sure Ill be getting one for every car seat we have  its just easier and Im sure it will save me from broken nails too! I hesitated this purchase but wish I hadnt have. Its amazing!"}, {"date": "2021-04-05", "score": 0.0, "review": "My little one has strength issues and struggles to unclip her carseat without assistance and now she can with unbuckle me!!!"}, {"date": "2021-04-15", "score": 0.88, "review": "The days when my old hands hurt....this product is such a help!  I have 3 grandchildren in car seats and I am so happy to have this handy tool to use!"}, {"date": "2021-04-22", "score": 0.599, "review": "As described. Works well for people with arthritis or long nails. I have given one to my mother who has difficulty squeezing hard enough to disengage the car seat buckle and to my teenage daughter who has long nails. This could literally be a lifesaver in an emergency. Makes me WAY more comfortable when they drive my LO!"}, {"date": "2021-05-29", "score": 0.628, "review": "This is our 2nd set of these.  Grandpa's arthritis made it impossible for him to unbuckle 4 year old grandson when delivering him to school.  With this tool, he can do it with ease.  However, the 4 year old quickly found out he could use the tool and now is given the tool at destination and he can quickly get out of car seat.  He loved it so much that he requested this 2nd set so he could have one in each of his parent's cars.  Easy to use."}, {"date": "2021-06-03", "score": 0.827, "review": "The grandma that invented this item is a genius. So much easier getting the grandkids out of their car seats now. Not in a panic anymore wondering if I can undo the straps."}], "granddaughter": [{"date": "2021-02-28", "score": -0.54, "review": "This is so helpful if you have long nails or your babys buckle is hard to press without hurting yourself! I love it so much and it makes life easier. I got one for me and one for my mom."}]}}, "gpt3_form_id": "file-JrCX9eMyciWyKAQ2qkL0pIWA", "review_types": {"best_review": "Great!", "worst_review": "Bought this to help due to poor hand strength.  These do not reach around the buckle and the part that is supposed to help is not in the right spot. Do not waste your money.", "neutral": "My little one has strength issues and struggles to unclip her carseat without assistance and now she can with unbuckle me!!!"}, "word_cloud": "null"}}