{"text": "In full disclosure, I got them for free, but was not asked to do a review, so this is fully voluntary due to how much my wife loved them (she was the one wearing the shoes). Below is what she had to say: I am the kind of person that makes decisions about clothing and footwear based on how they feel and how they make me feel and I cannot handle uncomfortable clothes or shoes. Therefore, when I say I loved them and never wanted to take them off you know that means a lot. I also tested them at my rocky and shell filled beach and they did a good job protecting my feet.  I just genuinely loved them and think they are worth their listed price.\n"}
{"text": "I LOVE these water shoes!! I wade creeks often and fish and these shoes are holding up through EVERYTHING. They have some pretty descent slip resistance and the little pebbles and sand bottoms of the creek stay out of these shoes! They dry quickly and I can easy go from creek to dry ground and back into creek without worrying about these shoes getting snagged or ripped on anything. The soles are durable yet extremely flexible. Its almost like going barefoot! I will buy them again when I ever need to.\n"}
{"text": "Looks: 5/5 Durability: 5/5 (so far) Comfort: 4/5 irritable at achilles Function: 4/5 slow to dry I got these so that I could wear them boating/swimming in a sandy river. For that purpose, I loved these! I don't know how they would feel on rougher/rocky terrain but they seem like they would be good and sturdy for most water wading situations. They're super cute and pretty sturdy plus I like that my foot didn't really slide around inside the slipper like some other brands that I've tried. I usually wear 8.5 because my feet are wide and they fit comfortably in terms of size. There was a small amount of extra room at the base of the heel but nothing problematic. These didn't hold a ton of water but they also we're not very quick to dry. That doesn't bother me much personally since most fabric shoes are that way but I could see it being a deterrent for some. My biggest problem with these shoes was that the stitching around the ankle is sewn with some pretty rough and uncomfortable thread that was especially irritating on the achilles area. It wasn't unbearable at the beginning but definitely noticable even within the first few seconds of trying on. After about 2 hours of wearing them in the water I started to feel bothered by them so I took them off. Nothing's worse than blisters in the water.  I wish I could get longer use out of these I'd probably buy more in defferent colors if it wasn't for that stitching discomfort because other than that I really liked these! For now I'm going to see in some softer fabric over that stitching. Maybe they'll improve them over time.\n"}
{"text": "Finally got to take these for a spin other than around the house. Started off using them around my home shooting my bow in the yard and doing some trimming. Yesterday I did a four mile hike around the public lake. Got in the water on the slippery rocks. Took them through the mud and trails all day. They definitely get my recommendation. Theyre stylish and performs extremely well. They held their grip on the slippery rocks under the trees in the water and dried super fast on the way home. Highly recommended.\n"}
{"text": "The shoes are good quality. The fit was a little big honestly. I wear a women's 8.5 and ordered an 8 and 9. The 8 I still had plenty of room, so I decided to keep the 8. My only issue with this shoe is that it kept rubbing the back of my heels. Luckily I was able to get bandages to protect them. Having blisters is not something I wanted walking around an amusement park all day.\n"}
{"text": "I had bought a cheaper brand from Walmart . They would come off and actually fell apart.  I decided to give these water shoes a try. First impression, they look really nice. Support on my foot is aw some.  They work perfect for my swimming class. They support you feet and you don't have to worry that your water shoes will come off while working out in the pool. I love these water shoes. Loved them so much that i bought my husband some. They don't come in 1/2 so even though i use a 9 1 /2 I ordered a 9 and it was perfect. For my husband he uses a 11 1/2 got him a 12. It was perfect. So maybe for men its better to go higher.\n"}
{"text": "I was looking for a hiking water shoe for Gully hiking that felt like bare feet hiking!  I found one that fits like a glove around my foot and gives enough protection for the bottom of my foot.  Super thin sole but exactly as expected by everyone's reviews.  That is what I wanted in order to have better grip in slippery situations but enough protection from sharp objects in the streams. I love how tight the neoprene is around my ankle which keeps debris out.  They also dry quick which is great for weekend multiply day hikes.  For this price I would buy a \"new pair\" for next season and not think twice about throwing these out afterwards!\n"}
{"text": "Not the Rolls Royce of water shoes but for the price, 5 stars easy. I even bought an extra pair because I love my other pair so much!  I have gone a couple of miles on them in rigid rivers and on rocky lake shores and they hold up surprisingly well. I've spent more on shoes that don't compare to these at all. However, the only critique (given the price range) I have is... Both pairs were purchased a 1/2 size bigger than my normal tennis shoe (10 1/2, bought size 11)... The first pair (black/grey) fits like a size 10. The second pair (black/orange) fits like an 11.\n"}
{"text": "I have been using the Vibram V-TREK for a long time. I was suggested this shoes by a friend of mine, with the catchphrase it's 1/3 the price of a vibram. This particular shoe can be akin to the Tesla Model 3 if the vibram's are Tesla model S. The shoe fits great, light, sturdy, and most importantly comfortable. I use them all the time and have completely replaced my sandals to these bad boys. There isn't a sole to speak of so sharp rocks might be hard on your feet. There's hardly any arch support to speak off and no sturdiness to the shoes. But I love this shoe for it and I will be buying at least a few more pairs to keep me stocked up through summer.\n"}
{"text": "Pros: Cheap Cons: Cheap These are okay for extremely light use, but won't hold up over time. They are comfortable enough for a water shoe. Unfortunately mine only lasted half way through the second day long canoe trip. The insoles come loose almost immediately, the bungee laces snapped at the buckle, and the \"drainholes\" on the bottom of the sole were not finished but instead are still plugged with rubber. I suggest boring them out somehow so your feet don't stay soggy if you'll be on/in the water all day.\n"}
{"text": "I am very happy with these shoes and the size fits well and snug.  There are no holes at the sole or sides to let sand and gravel in.  I am an 4E Width in a 13 and these are snug but comfortable.  I wanted them snug so that's great.  The soles have enough thickness that walking on rocks are no issue.  I have been using them on the shores of the Great Lakes where there are rocks on the beaches and they are perfect!!\n"}
{"text": "Comfortable outside of the water, once I got in the river where we had to walk on rocks it was like walking on glass. My sister fell and hurt her back in hers. I would NOT wear these in water with rocks.\n"}
{"text": "Love these cute, sporty water shoes! Ordered my regular size and it stretches to fit my wide feet well. Adjustable laces help keep them on your feet. Very comfortable. The rubber sole feels durable, grips surfaces well, and will protect feet. Have not yet worn them in water so unable to speak to that performance yet.  Looking forward to doing so soon though!\n"}
{"text": "I bought these for kayaking trips, and am very happy I did. I had an expensive brand of water shoe that I would wear, but rocks and sand would get under my feet when I would get out, and it was difficult to get rid of them. These shoes are very comfortable, and I have no problem with rocks or sand getting in them. I can walk in them without feeling I am going to get a blister. I liked these so well, I bought a pair for my daughter.\n"}
{"text": "Awesome protective sole with a lot of grip for rocks. Decent cushion for a water shoe. Style is great.  Bought pairs for the whole family.  High quality zip bag with a hole for drainage to keep the car clean after use. Would guess they run about a half size big but close enough to say true to size. If youre in between whole numbers would probably get the size below (aka if you are size 11.5 men sneaker get the 11 water shoe etc)\n"}
{"text": "I did a lot of shopping and decided on these or my trip to Jamacia. What a great purchase. These are comfy, perect sizing, great traction, almost no sand got in them when I was in the sand. A major plus as I cannot stand the feeling of sand in my footwear. I wore these for a lot of hours over the course of 6 days including a jungle atv ride in which I had to walk 200 yards in a really muddy field. They were fantastic! What little bit of sand got in them I washed out at the rinse station and shook them out when they dried...which these dry really quickly. The insoles are easily removed to shake out.\n"}
{"text": "These shoes are such a great buy! Better then expected from the other comments. The fir was perfect, but I sized up since I have a wide foot. It left a little room in the heel/toe so they werent tight. I like that I could adjust the tightness as well at the top of the foot. I used them for waterfall chasing, and even going into the water walking across skippering rocks they gripped very well, kept the rocks out, dried fast and cleaned very well. Great buy.\n"}
{"text": "These water shoes look awesome. They have a weird chemical smell to them though upon arrival. I live in Pennsylvania and one of our favorite past times are river/creek floats. It's really hard to do this in flip flops so these shoes provided much needed protection to my feet with no worry of losing them. I also received a lot of compliments on how cool they looked compared to other water shoes. However, after one float the material in the toe rubbed away and created a hole in both shoes.\n"}
{"text": "I like the look of these, they are comfortable too. They run a bit big, I wear a 9 1/2 shoe so I bought a size 10, but they seem more like an 11,  also I only wore them 3 times at the end of summer, but there is already a small separation at the one glued seam at the inside of one shoe at the ball of my foot, I will probably just superglue it before it gets bigger-other that that I like them.\n"}
{"text": "I ordered my dress shoe size rather than my athletic shoe size. I wore the shoes to go tubing on the river. The shoes were comfortable on both dry and wet land. I would have worn my sandles but these were a terrific replacement. Just a side note. My ankles are small and my feet are narrow. I was concerned about the fit. The fit was perfect. I would definitely recommend.\n"}
{"text": "I wear a size 8.5 in mens amd a 9 in womens but I prefer mens shoes but it was about an inch to big for me and its fits my bf but he actailly wears a size 12 in mens too. And we measured both our feet and its werid that both our feet ade the same sizes -.- anyways its very nice, stylish, and durable. No pebbles of sand getting into it which was a definte plus. Will be a shoe that will fit me i just hipe i get the right size this time.\n"}
{"text": "i thought they wouldn't last a day in Volcano Bay....i was very wrong..these shoes can stand lots of wearing..they are true to detail in the aspect of it being water shoes and possibly more...went swimming in these and thought it would slip under water...not one bit of slip have i felt in these shoes, I still have them months later in same shape and color...WILL DEFINITELY BUY AGAIN\n"}
{"text": "Nice shoe so far but sizes run bigger. Missed return window and now can't return them. Mine say size 44 but are more like 45 which can cause me to trip while walking.  :(\n"}
{"text": "I bought two pairs of these for myself and my husband.  We spent a week in Sanibel beach and they were great!  Sanibel has LOTS of shells on the beaches.  The soles were thick enough that we didnt notice the broken shells under foot.  The shoes slipped on easily and fit all.  Our only issue was that we both had a spot that rubbed and created a blister.  But we could easily put thin socks/footies on, slip the shoes over the sock and head out without further problems.  We had almost no sand or shells get into the shoes and they rinsed and dried easily.\n"}
{"text": "Wife and I both bought a pair for our trip to Hawaii and were so glad to have them! We tried one day to swim around without them on and found ourselves quickly slipping them back on to avoid the coral cuts. They are very comfortable, fit as expected, and dried out super fast! No complaints at all from either of us.\n"}
{"text": "The shoes look nice, stretchy and light weight. Not sure how they will hold up but since I'm only going to use them for water sports should be OK. I ordered a size 12 (I always take a US 11.5 shoe) and the packaging they sent read: XXXL Euro 45 which translates to a US 10.5. They come from China so perhaps the sizes get lost in translation. I should have ordered a Men's US 13.\n"}
{"text": "These fit well but they turn your feet black every time.  I thought maybe it was just because they were new but I've worn them several times and each time turn my feet black and its impossible to get off.  I live in Florida and live in flip flops so you can imagine this is a problem not being able to get the color off.  If I scrub my feet with alcohol and dawn dish soap it comes off a little but still takes several days to go away.  I would not recommend these if you don't want your feet to turn colors.\n"}
{"text": "I have not used these in water yet, but I don't expect any issues. They fit well, they are designed well with regard to staying on your feet when wet. They do not have individual toes, which I like, yet they do have toe protection on the front of the shoe, a must when it comes to river walking.\n"}
{"text": "I was expecting a lesser quality shoe for this price point. I bought these knowing that I would only be wearing them when I take my boat out, which is only a handful of times each year. They take a little longer to dry than I'd like, but that is because of the durability of the sole (a trade-off I am happy with).\n"}
{"text": "Just recieved these puppies today. This makes 3 out of 3 pairs from Amazon, they're PREFECT!  These pink/black water shoes are fun, trendy and extremely comfortable. Plenty of cushioned support and protection from hard surfaces. I'm sure they are \"skid\" resistant or at least they appear to be. Could use a little extra elastic support at the bridge of the shoe, but it won't make me write a negative review. I purchased these for snorkling. Can't wait to put them to the test in Cozumel. Will post another review in 3 weeks.\n"}
{"text": "Got the shoes for my husband for a kayak trip that involved some hiking as well. As water shoes they are good, but for hiking they are a bit thin. We went about a mile on a rocky trail. Would not want to do much more with these shoes. I myself had Merrell Trail Gloves (https://www.amazon.com/gp/product/B07D5PX881/ref=ppx_yo_dt_b_search_asin_title?ie=UTF8&psc=1 ) which were more up to the combination of water and hike. Still happy with purchase and will use only for kayaking now.\n"}
{"text": "I travel and live in an RV so I needed a shoe I could wear to beach, do little hiking and use in the gym. Basically a al, rounder shoe. Read reviews and ordered this UBFEN water shoe. Order was delivered promptly. Came well packaged. First impression: -Shoe looks well made, nothing out of place. -Nice design and color. I have been using it over a month now, pretty much daily for gym. ( I dont run in thread mill so this shoe works just fine in the gym for me) The no tie lace is simply works. The soles are thick enough, provided me comfort in walking around in the city, gym and beach. It packs small, made it easy for me to take on travel. The only con I see is: wished the shoe had higher coverage at the ankle so sand wont get in. Overall priced right, comfortable for long wear,\n"}
{"text": "I ordered these shoes by accident because they were in my cart. BUT I really like them!  They are comfortable, they fit really well and they look nice.  We do a lot of surface rock hunting and river floating.  I wore them this weekend and was pretty happy with them.  I bought another pair with more tread I think I will use for hiking and rock combing the River sides but these are going to be my summer side kick for sure.  I have narrow feet and these dont make my feet look wide.  I was concerned about that due to there shape.  I only have one complaint and that of the insole fabric is slightly rough so I did put a liner insole in them.  Very nice product!!\n"}
{"text": "I bought this because it looked like a shoe and appeared to be more durable than others that looked like socks. (My wife bought the sock one) I was correct in thinking it has more durability and a better fit than other cheaper products but I will be shocked if it will last more than a few months. Overall I say its worth it but only if at a discounted price. If you want something that feel more like a regular shoe, then this might not be the right fit for you. By the way, if you go to a beach, expect it to fill up with a lot of sand. FYI - Used in lake only. Fairly rocky lake bed and shore with some sandy or dirt areas.\n"}
{"text": "These fit really well. I have a narrow (A or B width) foot and need to lace them all the way up. I have trouble finding shoes that stay on my heel, these stay on and the heel doesnt slip at all. The box has plenty of space so theres no restrictions. I wear an 8.5 womans and the length is purrfect. These would be a good fit a fairly narrow or average width foot. These are well made and look good. Sole is flexible but thick enough to protect against pebbles, small rocks and other similar objects. They wouldnt be comfortable for taking a hike or walking a long distance.\n"}
{"text": "I received these today.  I got the blue and they are very attractive. I usually wear a women's size 6.5 so I ordered these in a 7.  They fit perfectly. I have never worn water shoes before so wasn't sure what to expect. I got them for an upcoming trip. The sole seems pretty sturdy but I'm not sure I could do all day walking in them.  I have high arches and the support isn't really there but I think they will work for my purposes.. i.e. walking on pebbly beach, swimming in rocky water, minor rock hiking, snorkeling. They are very affordable to I'm pleased with the purchase.\n"}
{"text": "I bought these shoes to use when I'm out fishing or cruising around on the boat. They fit right and having the elastic laces are great to keep them tight on your feet. The design was nice as well. But as I found out the hard way they leave black marks on the deck of my boat and the gunwales and seats supports. I was so upset as I just washed the deck and it was nice and white.... Also there is no sole support so if you stand a lot you will feel it\n"}
{"text": "As I said, these are really not for people with wide feet or large fingers for that matter.  The finger tab loop on the back is so small that it is rather useless for me. The shoes are generally comfortable after you get them on but they could use a lesson in footbed comfort from Crocs. All in all rather disappointed and don't think I would recommend or purchase again.\n"}
{"text": "Just came back from a trip to FL.  Fort Myers Beach and Sanibel Island.  If anyone is familiar with Sanibel Island, then you know that the first 15-20 feet from the shore in the water is nothing but broken shells.  These water shoes allowed navigating that  underwater shell bed a snap!  Not only were they great in the water, they pretty much replaced a pair of sandals that I used to use just trekking around when not in the water.  Kept them on all day.  Land to sea without blinking an eye.  Worth the money!  Great purchase!\n"}
{"text": "I ordered a size larger and they fit perfectly. There was a little rubbing on the right rear foot but it eventually stopped after a couple of wears. The quality is good. I wore them on a beach that had rocks and I didnt have any discomfort walking on the smooth rocks. The sole of the shoe is Not made for ( thick enough) large rocks or gravel. The sole is also not made for slippery algae covered surfaces. This is also not a walking or hiking shoe. It does well on the beaches and around  pools. The shoe kept out the sand. I also walked on the jetty with them on and felt safe. This is a great water shoe for the price.\n"}
{"text": "These shoes fit me exactly as expected.  They are actually much more comfortable than I expected especially for the price.  I used them on our fishing boat, good shoes for launching your boat or walking on the beach, they fit snug so sand didn't get in very much.\n"}
{"text": "I just took these water shoes out kayaking on one trip, so I cannot speak to durability.  But I can speak on the comfort of these shoes.  They are great for moving your kayak into the water on the boat ramp and provide extra grip when standing in your kayak.  They fit well and don't feel like your feet are trapped in a shoe but are very breathable and dry quickly.\n"}
{"text": "Very comfortable to wear to and from the pool. I also used them during my visit to the water park, however they did not seem to have that much support in the sole of the shoe. I expected it to be thicker. My shoes did not dry as fast as I expected them to. Overall, they are very comfortable, almost feel bare footed when walking. You must adjust the tightness of the elastic shoe laces to accommodate your comfort. Not bad for the price. They served their purpose!\n"}
{"text": "I love my shoes!!! They fit perfect and snug, they have the strap adjustment to tighten. They dry pretty quick in the summer heat. They have let me slip yet lol even with the duct sides that can be slippery. I use them to swim, trail, and fish. A total package shoe! Now my fam wants some for Christmas hahah.\n"}
{"text": "The size was wrong. I ordered  shoes that should fit me, they can and they were way to small. Thank fully my child fit in them. So it wasnt a waste of money.\n"}
{"text": "Pretty comfortable to just walk around in  (lots of walking on a cruise) but the best part is;  when you get to the beach you can keep these water shoes on in the sand, in the rocky or murky water.  They seem to dry out quickly as well.\n"}
{"text": "I got these for work because I love the minimal shoes and I work around water so I wanted something to dry quickly. They are super comfy. Although I did habe to use bandaids on my heels for a couple days while I broke them in. The only complaint I have is that the mesh over the toes is starting to tear. Although, like I said, these are my work shoes and I wear them 50 hrs a week. All in all, I recommend. My feet are a half size different from each other and the still fit great. Like wearing socks.\n"}
{"text": "Made a hug mistake and have gone on too many excursions involving water and just destroyed my feet... walking around in constant pain... cutting the bottom of my feet... too hot in the Texas sun.... these were perfect!\n"}
{"text": "These water shoes fit perfect.  They are light but tough.  I bought them for my cruise but it was canceled because of the Corona virus.  So I took them to the beach, several hot tubs, a lake,.... and so on.  I love them\n"}
{"text": "I dont like these at all. They dont dry, even after 4 days, and they leave a gray stain on the back of my foot. I was super excited and ordered 2 pairs, one for my hubby and one for myself. I researched and read reviews, and still made an error by ordering these.\n"}
{"text": "I did not wear them very much, but when I did we hiked in and out of water, and they only lasted a few weeks, with the sole peeling away as if the shoe was held together by cheap glue. I will look for a different brand next time. A shame, because they were very comfortable.\n"}
{"text": "Looks really stylish, was nice to hike through river. Had a sensible fabric connection right on the hill. So i had to sew a piece of soft fabric, so it doesn't hurt and wouldn't make blister. Actually got a lot of compliments.\n"}
{"text": "Nice fitting  but doesn't hold up well. Very few uses since I received these shoes Jun 26, 2019 yet it developed a hole in the left toe area. There's no warranty or return window so I can get replacements. Be warned before you buy these!\n"}
{"text": "So far I really like these. They are really comfortable. They are easy to wear Im the water. Ive used them at the pool and at the lake. Ive used them on my paddle board . Ive Fast walked up to 4 miles Im them and wore them to the grocery store. I would recommend it them\n"}
{"text": "The fit is correct going by my size 11 in regular non aquatic shoes. The outsole seems to be rugged enough for good normal wear. I bought these to use for kayaking. The overall quality comes at a good price point.\n"}
{"text": "I wear a 10.5 to 11 in boots, for these puppies I went to a 10 and it fits perfectly. Like a dive booty with tread. Ill update the review when I test em in the water. I think they'll be great for the creeks I'm looking at.\n"}
{"text": "I wore these riding inter tubes down the river of course had to get out and walk some on the river bed these shoes stay on your feet, had traction to walk up the river bank, and they dry quickly....great purchase\n"}
{"text": "I bought these water shoes for my husband for our vacation in Hawaii.  He loved how comfortable they are. He wore them for snorkeling, hiking in muddy rain forests, swimming, and walking on the beach.  Would recommend.\n"}
{"text": "Just used this shoe for activities during a two week Caribbean cruise.  I used this for snorkeling, for boat rides, for walking on the beach, for walking through trails.  It is a comfortable \"shoe\".  Loved it.\n"}
{"text": "I bought a pair of these for summer minimal type of foot wear. I've owned several minimal shoes and these are by far the most comfortable. The feature that sets these apart is the stretchable material that gives just enough to fit snug but without compromising on a sure footed feel. Souls on these are solid feeling and grippy, just perfect for light weight summer wear. I'm buying at least 1 more pair. I wear a size 10 mens, bought the 10 mens size and they fit perfect with light ankle socks.\n"}
{"text": "- the pull strings secure the shoe to your foot The foot bed is soft but stable I returned this for a smaller size - i plan to use them snorkeling/ surfing/swimming and wanted green to be a bit more snug But if I were using them for light water activities I would have kept them I usually wear a 7, and order a 7- I returned those and ordered the sport model in a size 5 and theyre perfect and super snug fit !\n"}
{"text": "I loved the grip on these, I wore them to hike a very rocky hill and with lots of water and they did great. While my husband had a different pair that made him slip because there was no tread on his shoes. My only wish is I would have gone a size up. They were a bit tight and would have preferred a little closer as the back rubbed against my skin a bit too much, but I will purchase another pair since they were a life saver on our trip.\n"}
{"text": "I absolutely LOVE these shoes!  I wore them for my entire camping trip for walking on trails, relaxing, kayaking, and just as an everyday shoe.  They have a rugged sole that worked well in the boat and in the water as well as on gravel, grass, sand, and pavement.  They dry fast and have great traction.  I highly recommend  these!  They also look super cute and sporty.  Will buy in more colors.\n"}
{"text": "The appearance is very nice, and they seem to be well made, however they do not drain water like a good water shoe should. They hold water in the sole causing discomfort and stay wet for hours\n"}
{"text": "Looks nice. Comfy and fits well. I dont buy shoes online, because I worry about the fit, but these are perfect. I will agree with one of the reviewers who stated that you might get some rubbing on the back of the foot. The right foot feels that way. I will update this as needed, but they just arrived and Im walking around the house and theyre comfy.\n"}
{"text": "Ultimately liked the fact that they fit well. With a tightening of the draw string laces, they fit well and kept (most) of the sand out. The soft insert was removeable and the shoes dried quickly for use the next day. I used them as protective footwear while metal detecting a few of the beaches at the Outer Banks of North Carolina.\n"}
{"text": "Our family is huge into water activities and some beaches are beautiful but not super great on your feet. My husband has been threw a slew of water shoes since we got married and he loves these. They are comfortable, protective, and the insides dont come out when you pull your wet feet out. One of my favorite thing about them is that they come in a variety of color opals look cute/cool. Only complaint my husband had is he wishes they came in a wide or 1/2 size option.\n"}
{"text": "it is a great product,  very light and confortable. they keep you feet fresh and you have the feeling that you are not wearing a shoe. I used bear foot. they are very very light and easy to use. the fit is perfect size as any shoes. but be careful after of 15 days of constant use the fabric get a hole. I solved  sweing it.\n"}
{"text": "Your browser does not support HTML5 video. Fits good, works like gloves for the feet, feels nice to use them in the water and they are not bad for walking around either. Only thing, it may take a little while to get dry once you go on the water, other than that they are very good. Ive only used them two times as a write this review, cant talk about durability yet. Depends on yours needs, but, for water shoes Id recommend this pair.\n"}
{"text": "These quickly became a literal pain.  Both had rough stitching at the back, inside, that rubbed holes above my heels.  Also, the sand at the beach accumulated on the tops of my feet, making them uncomfortable.  Maybe these would be good with swim socks to overcome the shortcomings.  But, with bare feet, this was not a fun experience.\n"}
{"text": "These have held up extremely well. We go To the creek a lot and have to do some walking to get in to the water areas. They are just as nice as when we receive them several months ago.\n"}
{"text": "These water shoes are pretty great for the price. Enough sole to do some light hiking, very soft and grippy. Drains well, I do wish the mesh was a little finer, sand gets in. I have super high arches, these didn't bother me as much as I thought they would. Great for walking to the beach\n"}
{"text": "The material is lycra with polyester which is comfortable although a little weak, the sole is rubber which makes a good grip on stones and non-smooth surfaces\n"}
{"text": "These water shoes are everything! Theyre so comfortable, easy to put on and take off, they look great, feel great. Bought them to go kayaking and tubing in Florida. Always get compliments on them. Definitely recommend!\n"}
{"text": "I never had water shoes before and bought them for a specific trip.  They are so comfortable, I can wear them to walk for miles on the way to the beach/rocks.  I ended up wearing them way more than I anticipated because of this.  We even  wore them in place of booties with our fins when we didn't want to carry extra gear.  Traction on wet rocks was better than bare feet but not like hiking boots, of course.\n"}
{"text": "I used these to hike 5 miles of the narrows at Zion they worked great if you have sensitive feet something with a little thinker sole might be better but for the price you cant beat these\n"}
{"text": "My bf's first pair of water shoes and once he tried them on-he does not take them off and finds any excuse to wear them. Great find. Good look and fit\n"}
{"text": "These were perfect for our backpacking trip through a river and canyon. The grip made me feel supported on all the rocks we had to climb and they dried pretty fast. Fit perfectly. The only very tiiiiny complaint I have was it kind of rubs on the back of your heel sometimes! I only felt it a couple times and nothing major, no red marks or blisters. All in all it was a perfect water shoe for me, highly recommend.\n"}
{"text": "This pair of water shoes are the best pair ever. The quality is great super comfortable!! Estos zapatos de agua son excelentes. Buena calidad y super comodos!\n"}
{"text": "I haven't been in the kayak or beach yet with these shoes, so cannot speak to how they do in that environment. They do fit and feel good on my feet.\n"}
{"text": "I have not yet had a chance to try these on in the water, but I did wear them around my house to ensure they felt comfortable. I cannot believe the quality of these water shoes! I am a size 8 (my feet are on the wider side) and they fit me like a glove.\n"}
{"text": "The grip on these shoes is insane once I strapped them on I felt like spiderman I started crawling all over the house up and down the walls everywhere they're also pretty comfortable too Ive slept in them for 2 nights now I actually haven't even taken them off seeing how they're waterproof I just shower with them. Can't wait to try them out on our kayaking trip next weekend.\n"}
{"text": "Shoes are cute, uni sex and comfy. I love that you have the option to pick many colors. These are perfect for floating the river and trying to get in and out with different terrain. Dries quickly keeps rocks out of your feet Great product.\n"}
{"text": "These are good water shoes, but could use a little refinement. The sole could be a little wider for a bit more stability and the strings are too long. I ended up having to tuck them in to the laces or they are in the way. They do work well and feel lightweight.\n"}
{"text": "Fit well, dry fast! We use them for irrigating our lawn. Protect feet from rocks, thistles, etc. WalK in the creek without slipping on rocks or go boating and don't worry about sloshing in the water! Fun, durable, multi-use, good price!\n"}
{"text": "I went with the smaller size and as soon as it gets wet it stretches, So it needs to Fit Snug at First. Bottom was thick enough to use on the Kayak foot Brace for a 6 hr Paddle. they dont dry as fast as Sandals, and keep your Toes Moist I don't like That! But  all in all its a good water shoe for the Money.\n"}
{"text": "The fit was pretty close to my size 10 US, but slightly on the snug side, which is preferable to a shoe that fits too loosely. Construction is excellent, although I have only worn them 1 full day to a major water park. The reason for 4 stars instead of 5, is that my left shoe caused a blister on the outside of my small toe. I would still recommend the product though.\n"}
{"text": "i bought this one for our cancun trip coz we're doing the Xplor, the entire park is all water related activities and A LOT of walking i honestly wouldn't get disappointed if it will break at the end BUT im glad that this is A Great buy for the price i paid. i definitely recommend buying here if you're looking for a affordable water shoes.\n"}
{"text": "The sole is more plastic than rubber.  I put them on and immediately slipped and almost fell on wet cement.  Then again on wet rocks.  Had to wear them for the short river floating tour because I had to have shoes, but never again.\n"}
{"text": "Used them with both my Kayak and Pelican sailboat the do a good job for what they were designed to do.  I jump into the water and drag  them to shore with no problem.  They have good traction even on rocks.  A big plus its comfortable\n"}
{"text": "One shoe fits perfect, and the other seemed a little on the small side. They initially hurt my heels but after wearing them for awhile, I didnt notice anything. I climbed rocks and jumped in a natural Aruba, and they were life savers! Everyone was jealous of how well our shoes did compared to theirs. My boyfriend wore his almost every day and didnt seem to complain about them once!\n"}
{"text": "I purchased these for creek crossing while hiking, and to wear around camp after they dry. Sizing fit as expected.\n"}
{"text": "I can't wait to travel again and use them. I use them for walking on beach and in travel fin for snorkeling. great fit and great protection.\n"}
{"text": "The grip on the shoes is very good. But the soul is not overly rigid it flexes Very easily side to side and that is not something that I am comfortable with.\n"}
{"text": "Attractive and easy on and off as I am disabled. They wear and fit nicely, sizing accurate for a China made shoe. I have a wider woman's foot from years of working on hard concrete flooring surfaces, so fit was important to me.  Fast shipping .\n"}
{"text": "These shoes seem to have plenty of traction and would likely be rather comfortable if not for them being undersized. Size 13 was more like a 12. Very tight too and I have a long narrowish foot.\n"}
{"text": "Hubs loved the secure feeling and insole in these water shoes. Felt he could safely walk in places other than the beach. Worth their weight in gold! Used for trip to Hawai'i and they kept feet safe and secure while walking on rocky beaches. Love them!\n"}
{"text": "Love this shoe! Great for beach, hiking, kayaking, sailing.  Great all around shoe. Used it for 2 weeks on Kauai.\n"}
{"text": "Perfect fit.. comfortable.even tho these are water shoes ive been wearing these to work on concrete floors for months now.feels like your barefoot and eases foot pain for me because they are flexible.\n"}
{"text": "These shoes are very comfortable and easy to put on. I only gave 4 stars because I haven't been able to use them and test out their durability. I usually wear between a 9.5 Mens to a 10 Mens in regular shoes so I sized up and ordered the 10..they fit absolutely perfect.\n"}
{"text": "The insoles are itchy, I did get used to it after wearing them a while.  Other than that I love them, but it's a big minus on comfort\n"}
{"text": "I bought these to wear for inshore wade fishing in the summer, particularly in areas near underwater oyster beds and rocks.  No issues whatsoever.\n"}
{"text": "I enjoy being in and around water aloft and need something that drains and drys quickly. These foot the bill.\n"}
{"text": "I purchased these for a beach vacation last week, they fit well, flexible, great cushion sole, dries quickly, i recommend these shoes, also fast delivery!\n"}
{"text": "These shoes are awesome! Used them on the river and at the beach. They worked flawless and will recommend to everyone!\n"}
{"text": "I've worn these shoes a few times already, when I've visited my local swimming hole.  They are very comfortable and perfect for what I want them for.  I do wish that the soles were a bit firmer so I don't feel every rock that I step on but as they currently are.  I'm very happy with this purchase.\n"}
{"text": "I used these shoes on vacation in the ocean and while snorkeling. Theyre comfortable just walking around on land as well.\n"}
{"text": "This shoes were ok for what they were when we needed some shoes quickly. Probably will only wear once. It is a waste.\n"}
{"text": "I wear a UK 8.5 and bought US size 9, they are snug but fit perfect. Sole has excellent grip, highly recommended\n"}
{"text": "My husband says these fit him well but it's a bit tight on the top of his foot. We only need them for a cruise in a few weeks walking around port and the boat so he says he can manage.\n"}
{"text": "As stated, these water shoes were not only functional but comfortable to walk around with all day.  They look very stylish and they work perfectly to keep balance around the pool area at my timeshare.  Shoes are easy to clean and I'm glad I made the investment.  Thank you.\n"}
{"text": "They are ok. Pretty comfortable but I wouldn't hike in them. They did help a lot with walking across river rocks but you definitely still need to be careful with slipping.  Honestly, you could probably buy a similar product for less however they looked super cute!!\n"}
{"text": "The fit is perfect based upon my size for athletic shoes. Very comfortable. Dries quickly. I like the tension string closure.\n"}
{"text": "These keep me from sliding on pool surface during aqua aerobics. Thats all I needed them to do. Requires a bit of work to get them on.\n"}
{"text": "I got these as fishing shoes for my husband. They look great and he said they are comfortable.  They fit as expected.\n"}
{"text": "Keep the hot concrete off your feet. Not too slippery on mossy rocks, and there's almost no way of not slipping on them. One down side is the black vinyl gets hot in the sun.\n"}
{"text": "comfortable and fit to size as expected\n"}
{"text": "I Love these water shoes. They are so comfortable and are true to size. I like that they come in half sizes also. Makes for a better fit. Would definitely buy again\n"}
{"text": "I replaced my old water shoes with these and couldn't be more pleased. They fit very well and are comfortable. They stay on securely and do not slip around when wet.\n"}
{"text": "Only used them once so far, but I loved them! Fit right, used them to kayak, comfortable while carrying my kayak to and from the water. Everything I was hoping for I got.\n"}
{"text": "I used these for beach / wading action on both sandy and rocky beaches. Mine are snug. They protected my feet well from rocks and did not allow much sand it. What minimal sand did get in was not enough to irritate my feet walking on land. I wore these very casual shoes to casual restaurants. That being said, I wouldn't go for long hikes in them (except walking near/in the surf).\n"}
{"text": "Great overall water shoes! They are comfortable and tight enough to my feet to not lose them in the water or sticky sand/mud or some speed with watercraft, diving with them is no issue ether. The material quality is really good for the price and looks and feels like it will last numerous uses as long as you do your part in the maintenance of rinsing them with fresh water if using in chlorinated or salty waters and out of the sun when not in use. They came in a plastic reusable sealable bag for storage, shoes with removable sole cushion. I've used them quite regularly when I was vacationing in Cozumel, Mexico and they have not shown any signs of deterioration or flaws. Excellent!\n"}
{"text": "Happy with this purchase.  There are better water shoes out there but not for the price.  These are better than many in terms of being lightweight yet strong and can walk on anything, but they are still relatively thin so if you have to walk a long way on a paved surface on the way to the beach they do not replace running or tennis shoes.  I prefer to put these on all day starting when I arrive at the sand.\n"}
{"text": "I needed river shoes that wouldn't let sand in and these are just about perfect. Fits pretty well, maybe a little scratchy at first on bare feet. Great color and I like the soles, although I wish they were siped. Not bad at all for the price. Ok for short walks and hikes and longer swims and paddles, but I wouldn't plan on wearing them for long hikes, not enough support.\n"}
{"text": "I do alot of river floating and most water shoes barely make it through a single day from walking in the graval and rough terrain. So far I've spent 2 days on the beach, floated 25 miles of rivers and spend hours walking in creek beds tgis season and they're still in good shape.. I'll admit I'm alittle impressed by the durability of these shoes.. Definatly recommended\n"}
{"text": "These fit rt on.  I feel water shoes SHOULD BE SNUG. Shoes seem like they'll be great in the kyak/River, lake swimming HOWEVER, They come up almost a 1/2\" higher than what I think would be comfortable. The tab they included to pull shoe on is MOST LIKELY going to rub my skin blistered and raw. Wish they weren't so think in the back seem; not so high on back of heel.  Top of the back of shoe, is equal in height to my ankle bone. For the price, I will cut the back of shoe down.\n"}
{"text": "These shoes work great!!! I took them to Costa Rica and used them the majority of the time. I did not experience any discomfort, even when hiking. However, I personally would not recommend using these as your primary hiking shoes but they will work if needed. I swam in these, went zip-lining, and walked a lot in them. They fit easily in a backpack, purse, etc. They do dry quick!!\n"}
{"text": "My husband got me a pair in pink. The size is perfect. I love them. Only one thing that most shoes will do, they rub. The right side rubs against the back of my ankle, so I use a bandage for the entire trip. No big deal. These stay very well when I wear them in the water. I do get sands in from time to time but very minimal. I wear these to walk on the beach and the streets from 7 am to 5 pm for every time our cruise makes a stop. I feet do get a little sore by 6 pm but at that time, we are already back on the cruise and I can change to my regular sandals. Then the next day, I wear them from 7 am to 5 pm, again. I do this for 4 days straight. I LOVE THESE SHOES. STRONGLY RECOMMEND.\n"}
{"text": "Chinese garbage rebranded under 20 different names and more than likely purchased in bulk from alibaba for .50 cents a piece. Used kayaking and fell apart from pressure against the foot rest in 1 day. No clue how so many people Rates these so high. If you actually use your shoes to do something such as walking or kayaking these are waste of money. Also they stay very wet. The drain holes are not open how they are supposed to be. You can see where they go but this particular re-seller didn't take the time to punch them out. AVOID AT ALL COST.\n"}
{"text": "I purchased these shoes for cycling.  They're extremely light and are comfortable.  They appear to be made of average quality so as long as you're not abusing  they should last for quite some time.  I purchased the A Black/Green variant an can definitely confirm that the drain holes on the soles are merely cosmetic.  You'll have to dump any water Lodge in the shoe yourself.\n"}
{"text": "got these to wear canoeing in my local river. they fit nicely, feel comfortable, and look good. after the first weekend they held up through rocks, sand, and being in the water the whole time.\n"}
{"text": "I bought these for cleaning the bathroom and they work quite well for that. I have wide feet and the width is comfortable. However, I also have thick feet and the mesh is pretty tight on the tops of my feet. No need for the tightening dongle.\n"}
{"text": "We kayak down the local river a lot during the summer and the rocks tear up our feet. Just went down the other day and these shoes worked perfectly! They fit just as they should and I felt very steady while walking on the sharp rocks. Will definitely be buying a second pair for my better half!\n"}
{"text": "I wore mine on a 1/2 mile hike to the top of Sitting Bulls Falls over sharp rocks.  No tears and then swam in the top pool for a few hours.  Hiked back down and swam under the waterfall. Very comfortable fit with no rubbing or break in period necessary. 5/5\n"}
{"text": "This fit and feel great.  Flexible sole.  True to size.  My wife liked mine so I ordered another pair for her.  We plan to use them at the beach and occasionally kayaking.\n"}
{"text": "They fit snug but still comfortable. Theyre tight enough to keep sand out but still comfortable while walking around. I could swim with these without any trouble at all.\n"}
{"text": "Seem durable enough, a bit uncomfortable though. I wear a 9.5 show but had to buy a size 8 to get the right fit. Great for the inexpensive price\n"}
{"text": "These are cute I was going to return these but my sister likes them and her foot Is larger than mine so I gave them to her and I bought a different pair. Go down a size.\n"}
{"text": "Great water shoes.  I bought 2 pair, 1 for.my husband & 1 for my son (I prefer a more feminine look, but a woman could wear as well) they loved them.  Wore them just about the whole time on our cruise & ports at different beaches\n"}
{"text": "Love these water shoes.  Fit well and are comfortable to wear.  Like all the colors.  I got the gray and pink.  I have narrow feet and was able to tighten them with the straps.  They stay on well and prevent slipping on wet surfaces.\n"}
{"text": "These shoes are amazing for kayaking! They drain without any problems and they fit like a glove!\n"}
{"text": "When I first got these and took them out of the bag, I was like no way these are gonna fit my extremely fat feet.. but.. THEY ARE SOOOO COMFORTABLE!!! Im gonna wear these everyday!!\n"}
{"text": "Love the look and fit of these water shoes and they were a great price.  I always glue my insoles down for water aerobics.  Seemed to be well made, but I haven't had them long enough to know if they wear well.  Great so far!\n"}
{"text": "These shoes are great. I LOVE them. I know they are water shoes but I wear them almost everywhere because they are so comfortable & light weight . Thank you very much :)\n"}
{"text": "Really liked these and was super excited to use them, first time using them in a lake was great, second time I used them in a river and was so happy to have them but when I got out of the river they already had a hole in the top of the foot, its small right now but I imagine it will get bigger fast, Id like to try another pair to see if its a fluke but Im not sure how to contact the seller.\n"}
{"text": "Just received these and tried them on. I usually wear between an 8 and 8.5 in womens. I generally have a wider foot- a lot of womens shoes are too narrow. These are a little snug, but not uncomfortably so. The material is very stretchy and my toes do not feel cramped. I think the next size up would be too loose. Seems to be well made and sturdy with a sole similar to a minimalistic shoe.\n"}
{"text": "We bought these for our trip to Maui for the hikes so we had some support during the hike but also water shoes for the waterfalls, etc. These were PERFECT!! We were soooo glad we bought these!\n"}
{"text": "Bought these for a recent trip to Nassau. They didn't fit well, were snug and tight, and caused A LOT of pain while wearing them both in and out of the water. Would not recommend.\n"}
{"text": "I bought these for a white water rafting trip. They are comfortable and good to walk in - similar to many \"barefoot\" running shoes.\n"}
{"text": "Best water shoes I've ever had perfect fit . Reading the reviews I was not sure if they would  so I order same size as I wear in shoes and it fits like a glove\n"}
{"text": "Both womens and mens run about a half size small so round up. However, they have good flex.\n"}
{"text": "They fit as as expected. Taking them with me on a trip to Jamaica and very excited to wear them. Very comfortable and good quality.\n"}
{"text": "Fit just right, very comfortable to walk around the house, lol. They feel and look good. Easy to put on! Material seems of good quality. Price could be lower a bit though.\n"}
{"text": "Fits well.  My husband mows the lawn in these because they give him more stability.\n"}
{"text": "Took these on a trip to Havasupai Waterfalls - they were very sturdy and comfortable!\n"}
{"text": "Fits great! They look good and feel comfortable! Bought a pair for myself and one for my husband and we both love them. Thank you.\n"}
{"text": "High quality! Very comfortable! Worked really well walking on the beach and swimming in the ocean. Highly recommend\n"}
{"text": "These work well for me. Easy to get on and back off, comfortable and nice looking.\n"}
{"text": "They look good and fit well.  great for Hawaii's rocky North-Shore.  Used them a dozen times.  Showing wear, holes near sole/upper.  Mesh inner sole liner traps sand in the shoes, very difficul to flush out.\n"}
{"text": "Extremely surprised they fit so well. Great water shoes and super comfortable.  I didn't really expect much out of them but now considering getting them for the whole family. Got well on my 11 Wide feet.\n"}
{"text": "These water shoes are very comfortable and did a great job of protecting my feet from the rocky shore of the lake.\n"}
{"text": "Fit just right my son used it during a visit at the river and it was perfect.\n"}
{"text": "These are great! I baught them for wheb im at work. Great grip on all floor types. Easy to slide on and off and can adjust with the laces.\n"}
{"text": "Great for fishing. Easy to wash. Fast shipping. Great price\n"}
{"text": "Good on going to beach or swimming I liked it so much but it looks lite weight you so comfortable having on your feet\n"}
{"text": "Good water shoes, We walked all day long in a water adventure park and they are still like new. Very resistant\n"}
{"text": "Perfect, just what I was hoping for and needed.\n"}
{"text": "Not true to size and poor quality at any price.\n"}
{"text": "BEST WATER SHOE EVER.  ESPECIALLY FOR THE MONEY\n"}
{"text": "Shoes fit okay, but they \"bleed\" every time they are worn in water.  Cause discoloring on the feet, as well as bleeds the color all over.  We bought these to wear on our boat, but it leaves black marks from the dye.  Not happy with that.  These come from China.\n"}
{"text": "I purchased for an upcoming white water rafting trip.  SUPER COMFY!  LOVE THESE!!\n"}
{"text": "These shoes are seriously comfortable, great grip in the river, walking, hiking and kayak\n"}
{"text": "Only wore once so far, but they are comfortable and held up to the day of floating on a canoe down the river\n"}
{"text": "This is a awesome shoe for Sand Volleyball, you do need to wear ankle high socks. But able to move around sand VERY well! Soles way better than regular Sand Sock!\n"}
{"text": "Wore these on Siesta Key beach for a week and loved every step. Fit, looks and all else were everything I wanted.\n"}
{"text": "These are even cuter in person!!! I love them!!! Theyre so comfortable! I will be buying more colors!\n"}
{"text": "I bought these to go cave tubing in Belize. It was a last minute purchase, when I didnt want to be in soggy sneakers. The fit was as expected and they were comfortable for a 15 minute hike to the cave and did well climbing up and down the rock staircase. They felt secure while wearing them and didnt rub.\n"}
{"text": "Comfortable, inexpensive, average durability. Cant complain for the price \n"}
{"text": "Drain Holes on bottom of soles were not open, so will have to drill into them and hope I don't ruin them.\n"}
{"text": "Fit was great. No slippage. No rocks got in and very little sand. Great to have! First pair I ever owned and loved them.\n"}
{"text": "These shoes fit so comfy! They are easy to slip on wet or dry and stay on your feet even when on some rough terrain. I was able to hop out of my kayak and walk around like I was in hiking shoes but get back in the water and have no issues.\n"}
{"text": "I wear US womens size 9M & these are size 9.5 (as most reviews say they size small) that fit perfectly. I love them as I can no longer walk barefoot on hard, lumpy or other terrain.\n"}
{"text": "Purchased these shoes for kayaking.  The rubber soles have good tread to soften the impact of walking over rocks near the shore. The shoes are very comfortable and dry quickly.  Very please with this purchase.\n"}
{"text": "Took these to the lake and my husband was loved them. He said he didn't get any sand in the shoes which made him happy. He hates feeling sand on his feet. He said they were easy to walk around in.\n"}
{"text": "They ok at best. They DO NOT grip algae covered rocks. The back tears up your heels, I have blisters. Easy to get on and off. Sand slides in and out easily. Was going to return them but missed the return period by one day. Super bummed. I kayak a lot and was looking for a water shoe that can hold up on the rocks. This isnt it.\n"}
{"text": "Love the design It has a good grip for water and rock activities The quality is not great though The lacers placket went undone the stitch didnt hold the first day, I have to glue it now\n"}
{"text": "Just received these so I dont know about longevity but the fit and comfort are great,I use them for house shoes this way I can go outside with out worrying about getting wet or dirty just hose off.\n"}
{"text": "Fit perfectly and bought my normal size. Wore these on several occasions walking on rocky beaches. Also wore these on short hikes where there were also waterfalls. Held up great. Very comfortable.\n"}
{"text": "I purchased these shoes to be used in the Boundary Waters area of northern Minnesota during a week long canoeing trip. They survived 18 miles of hiking where I had either a 44 pound canoe or 50 pound backpack on my shoulders with very little damage. Portage's in the BW are not improved and the trails are rough but they did a very good job. I wore them at all times except when I was sleeping. All in all I'm very impressed with how well these low cost water shoes held up.\n"}
{"text": "all in all a good product, especially for the budget; some glue residue on the edges, could be finished better, but nothing  to crazy considering the purpose. Sizing was the biggest let down; I am more of a 44 size than 43, so went with their recommended/available option which seems to be a proper 45 size. Beyond that, all good; used it a few times on a JetSki,  grips well, comfortable and it did not smell like toxic chemicals, always a bonus...\n"}
{"text": "These shoes were everything I expected. My son used them for wading in the river, and fishing along the banks. They were sturdy, even while walking along wet rocks. The shoes dried quickly, and are holding up great showing no signs of wear. The seller shipped these quickly as well. No complaints and look forward to buying them for my other kids.\n"}
{"text": "I bought a pair of these last year and ordered size 40 (this is usually the size I wear in european sizes). It was alittle too snug at the toe, but I kept the shoes and gave them to my daughter as she wears a size down. I purchased the next size up a 41 and they fit perfect. I wore them while we were vacationing in the Bahamas, they were great walking on rough lava rock and rocky shores. The tread on the bottom was great! I would totally recommend these shoes.\n"}
{"text": "I bought these for a rafting trip, but honestly they will get used A LOT! My husband loves to fish and he loves these shoes. He has worn them hiking where there was water near by. He wears them to go fishing. He absolutely loves them. There are few things my husband loves, so this is a huge win!\n"}
{"text": "The PERFECT WATER SHOE to navigate comfortably, confidently, and smoothly in water.  Shoe fits like your own skin and yet provides a non-slippery surface to move on!\n"}
{"text": "I wear a size 91/2 womens and it was supposed to fit up to a size 11. it barely fit. no extra wiggle room. A little hard to get on unless you have very thin feet.\n"}
{"text": "Before I got this pair of water shoes, I tried my friend's that was light weight and comfortable. When I received this pair of water shoes and tried on, the solid quality and flexible material provide better protection.\n"}
{"text": "These water shoes are so awesome I will be buying a pair for my whole family because no sand get inside these water shoes. Love the way they fit and the look. The style was  another reason I bought the shoes. Love them.\n"}
{"text": "These shoes drained quickly, fit extremely well, and definitely protected me against rocks out on the river. Pretty much everything you'd want water shoes to do. The only drawback I've found is they're a little slick if you're walking on concrete once they're wet. Not enough to be a problem, but it is something to keep in mind until they dry.\n"}
{"text": "Very comfortable and nice shoes, I only give it 4 stars as the insole slips out really easy and that is kind of annoying.  If it was glued in or whatever they would be perfect.\n"}
{"text": "Needed something to wear on a water adventure.  These are well made but unless you have an average size foot, expect to find a really tight fit.  Definitely won't be \"losing\" these in the water, so that's a plus, but wouldn't want to wear for more than an hour or so.\n"}
{"text": "These shoes are just super cool for biking and such  even the beach (Florida here)  The price rocks it also and the assortment of colors darnnnn.great buy\n"}
{"text": "i recently bought a pair of these shoe considering our activities in water park..  i had a great first experience wearing them all day either on surface or water. quality of material used is good. feels light weight and to surprise they dry out quick. . i ordered a US 10/men size and fits perfect.  now i started using for regular activities like evening jog, cycling. i would definitely keep them for a long time\n"}
{"text": "They fit as stated and actually arent as miserably ugly as I would have expected from a water shoe. Also, my feet dont slosh around as much as they have in past experiences with this kind of footwear.\n"}
{"text": "He loves fishing in these.  He wades doen the creek alot.\n"}
{"text": "These water shoes fit my bf great and they were true to American sizes, be aware most water shoes run 1 size too big the make sure you get a size down\n"}
{"text": "Product arrived in a timely manner. These shoes fit true to size, work well for water activities.\n"}
{"text": "Great quality and they were comfortable.\n"}
{"text": "Bought a 7.5. A tad on the large size, but  Comfortable. I have wide feet too.\n"}
{"text": "Not sure if I didn't get the size ordered but it didn't fit. Gave them to my wife, she likes them. I'm not mad it's all good. They look pretty kool tho .\n"}
{"text": "I bought these water shoes for our vacation last year. These shoes are very comfortable, i would recommend them to anyone that is looking for water shoes.\n"}
{"text": "I love these so much I even tried them running one day when I could not go out on the water and they did amazing.\n"}
{"text": "Bought these for our honeymoon and we climbed dunes falls in them they worked out great to protect our feet\n"}
{"text": "I love these to kayak or swim the lake.  Great price as well!\n"}
{"text": "There are a lot of rocks around here so now it doesn't fill like I'm walking on legos\n"}
{"text": "Fit perfectly will write further review after I return from ocean vacation\n"}
{"text": "Great for beach and even like it for the gym\n"}
{"text": "I needed these because they had laces to get my wide feet into\n"}
{"text": "Good shoes for the price, pretty durable, soles held up well to hiking trail and kept water out very well, slow to dry.\n"}
{"text": "Found this great shoe for our trip to Hawaii last week! Used it for hiking, for swimming amd walking at the beach. Didnt slip off in the water and helped a lot with the rocky part of the beach.\n"}
{"text": "These are a little more difficult to get on than another brand that I have, but once on they fit and work well.\n"}
{"text": "It arrived in 2 days as promised and looks and feels awesome on my feet.  Material is very high quality as well.  The drain holes are in a perfect position to quickly dry the feet and the mesh is super comfortable on the feet. Highly recommended.\n"}
{"text": "I don't know why these were rated so highly. They are cheaply made and very over priced. I found an alternate pair in the Longs in Hawaii for1/3 the price and they look better.\n"}
{"text": "Best Hiking shoes I've ever had! I was worried about dirt coming through them, but the material somehow keeps your feet clean. Less supportive than regular shoes, and you can feel more of what you're walking on. Really good for hiking through rivers or desert.\n"}
{"text": "I typically wear 10.5 and I would say these are a little big. Might order a 10 next time. Otherwise they seem like a great deal, I wear them stand up jet skiing.\n"}
{"text": "They fit ok but the heels rubbed and I had to remove them before getting a blister. Donated them to Goodwill.\n"}
{"text": "Bought these shoes to use while stand up paddle boarding in the lakes and rivers near me in Colorado.  I needed a shoe that would dry quickly and be able to walk around in comfortably on dry land as well as grip on slippery surfaces ( I know that is a lot to ask).  But these shoes preformed admirably in all conditions drying completely in about 10-15 min.  Very comfortable and a great value.\n"}
{"text": "Great fit, comfortable, but easily torn.  My left shoe had a hole torn in it after 1st use :(\n"}
{"text": "Great durable water shoes!  They lasted our full week snorkeling in Hawaii and walking over lava fields.  Comfortable packable great value. Lightweight and the soles are strong.\n"}
{"text": "I bought these for a cruise to the Bahamas and they were great. I wore them on the ship and on the beach. They were comfortable both on land and in the water.\n"}
{"text": "These are a very snug fitting water shoe. True to size. The only downfall is that the sole comes out with your foot each time that you pull your foot out. Other than that, they serve their purpose.\n"}
{"text": "Super comfy, dont look too dorky and are very cheap.\n"}
{"text": "Well made, good quality. Used them several times.\n"}
{"text": "Awesome product very light weigh and dries fast\n"}
{"text": "They fit as expected and were very comfortable\n"}
{"text": "Wore these the other day, gotta say they were comfortable. Hopefully they last the summer\n"}
{"text": "Used on vacation in BVI. Worked great no issues noted\n"}
{"text": "Awesome shoes for doing anything water related\n"}
{"text": "Quite comfortable. Dry quickly as well. Sturdy but you can still feel Some rocks underfoot -  it doesnt hurt, just make you aware. I love them!\n"}
{"text": "Good in the water but does not stop slipping on the boat or the dock.\n"}
{"text": "Used a lot of time in Puerto Rico's beaches and they still looks like new. Fits perfectly on me. I use size 8 mens they are 41.\n"}
{"text": "Mi package came late and they did not have much size variety for men. I ordered 9 and they are tight, but I liked them. They are beautiful.\n"}
{"text": "Work great\n"}
{"text": "Bien\n"}
{"text": "Excellent\n"}
{"text": "I wear them all over.  It is like wearing socks with protection on the bottoms.\n"}
{"text": "These shoes were good for the beach and hiking where you get your feet wet. Fit as sizing stated.\n"}
{"text": "These worked out great for our float trip.  No one else could walk on the rocks except us.  Stayed on just fine too, never had to worry about them falling off.\n"}
{"text": "This size fit just well. Like walking with Sox. Very comfortable and perfect for beach and river walking.\n"}
{"text": "Awesome water shoes! Fit great, look great, work great!\n"}
{"text": "Nice shoe and very comfortable. Thank you!\n"}
{"text": "shoe insole is about four sizes smaller. My wife took it for other shoes that she wears. I have to find other shoe inserts for mine.\n"}
{"text": "Not true yo size, size 6, sent me a medium which was too large\n"}
{"text": "Ordered these for my husband and he loves them.  Much better looking then classic water shoes. He wears them mostly for kayaking and boating and they are perfect.\n"}
{"text": "I bought these specifically for sailing where traction is a MUST and foot and toe protection is very important.  Love these shoes. Light weight, comfortable, and the drainage is a huge plus.  Highly recommend.  I wear a size 9.5 and ordered the 10.  They are slightly big but much better than too tight.  Go buy them!!\n"}
{"text": "Graciassssss\n"}
{"text": "Very good\n"}
{"text": "Love them! Tad small, but ok fit. I live at the beach and these will be perfect for the summer hot sand.\n"}
{"text": "Feet dont sit in water, they have holes in soles and the water drains. I wear them from my car into Disneys Typhoon Lagoon and back.\n"}
{"text": "Very comfortable and light\n"}
{"text": "Nice Fast delivery\n"}
{"text": "Ordered these for an upcoming beach vacations.  My husband hates sandals! ??? These are athletic looking, and for well.  They were exactly as described on the site.  Looking forward to putting them to use!\n"}
{"text": "I took the advice to buy small. I am 10.5 size men shoe and I went with a smaller size 10 and they fit perfect. They are terrific.\n"}
{"text": "There is no drain holes on the sole.\n"}
{"text": "Lightweight comfortable good for flat wet environment\n"}
{"text": "Nice and lightweight! Great Price!\n"}
{"text": "The tops of the shoes curve inwards, making it look like I have pigeon feet. Ugly, unflattering and uncomfortable. If you have sensitive ankles, do not get these.\n"}
{"text": "Very comfortable but the stitching on one of the rubber tighteners is coming out\n"}
{"text": "Good product. Great grip. Snapped the pulley off the end of the laces on one shoe the first time putting them on, but I would def buy them again.\n"}
{"text": "Kayak water shoes these are the best fit and very comfortable buying another pair\n"}
{"text": "Got these for my husband who never would have purchased these type of shoes. He loves them!\n"}
{"text": "They are great!  I wear a 9 womens size and ordered a size 40.  They fit well. I like the fact that they are adjustable at the top of the foot, since I have a slim foot and can get a tight fit. Perfect for all water sports.  Good grippy sole that drains water well.  Lots of colors!\n"}
{"text": "We bought these for a trip to a rocky beach weekend trip.  We were worried that the bottom of the lake would hurt our feet. These shoes were the perfect solution.  They are very high quality and I was honestly surprised at the quality of these shoes.  I know they will last us years.\n"}
{"text": "The bottom feels a little long compared to where the foot hole is, so I had extra room in the heel, but that may just be my foot. It would make for a sometimes floppy fit, but as far as durability it is great. They dry pretty quickly and do not let too much sand in if you are taking these to the beach. The cushion is comfy and easy to clean.\n"}
{"text": "Ive never purchased water socks before, but I actually like these a lot. I purchased them for a trip where I could use them on the beach, kayaking, etc. I have to say, I like these funky little foot floppers. I havent used them in action yet, but they look durable and comfortable enough to hold up to whatever swimming, walking, or trails Im going to put them through. They are made well, not falling apart, quality rubber bottom too. I compared all of these foot floppers for price and quality and despite only buying one pair, Im more than satisfied with this purchase. ( 4 stars because I havent gotten to the beach yet, other than that 5 stars).\n"}
{"text": "This may be perfect for flat sandy beach walking but thats pretty much it. There is zero support and although they have a nice rubber bottom (no smooth) I do not see hiking or walking far w them. You will feel everything under your feet. Like wearing a slipper or going barefoot.\n"}
{"text": "The front tip is just a rubbery coating and not a more robust rubber protection per se, as one might imagine by the photos. It looks a little nicer than the other water shoe I have, but the holes in the insole are larger and feels less comfortable. If you like a more \"free form/barefoot\" felling, maybe look for one with a larger toe area with the toes format in the front.\n"}
{"text": "I bought these for my husband when we were going snorkeling and hiking down in Florida. He did not want to take them off, they were so comfortable. You can easily rinse them in water, wash them with soap, put them in your washing machine, etc. They are really attractive too!\n"}
{"text": "What a comfortable air of shoes. They are great indoor/gentle outdoor shoes. The toe box is roomy the platform supports well. Great for the pool and washing cars. I find myself changing into them when I get home - arch support is pretty good for my foot geometry. Im buying more.\n"}
{"text": "I have only used them a few times but I really like them. I usually wear 10 or 10 and a half, so I bough 11's in these shoes and they are perfect. Some others suggested I go slightly bigger and that was a good decision. Now, if I had bought a 10 it might have fit just fine, but there is no way for me to know that for sure so going just a touch bigger might?? be a good idea.\n"}
{"text": "I bought these for vacation and they worked perfectly! There were lots of rocks in the rivers/lakes, so I wanted something with more tread for hiking trails etc. I have zero complaints. They were comfortable, and the laces were adjustable for a tighter fit. I highly recommend.\n"}
{"text": "I do love these water shoes. They fit great and now I wear them all the time. I'm very happy with this purchase and would buy again.\n"}
{"text": "Love these!  They are light weight and the material seems to be good quality.  I am usually a 9.5 in womens but since they didnt have a half size, I went up to 10.  They fit perfectly. I have yet to use them for their intended purpose,  so this review may be subject to change.\n"}
{"text": "Great price for what seems to be a very sturdy marine slip on shoe. I am a sized 9 women and I ordered both a 9.5 and an 8.5 since they only come in full sizes. The euro 40 is a womens 9 and the 8.5 fits like a 9.25-9.5size. I am very comfy in it and plenty of room for thick socks which I can remove when my travels take me to watery areas.  I found the shoe to be larger than printed TRUE-to size. I gifted the 2nd pair to a 9.5 or 41 for a 9.5-10 shoe size women.\n"}
{"text": "I Love these! They are super cute! Perfect for going to the lake. They have nice firm bottom for walking in the stream or lake. Very comfortable. I am a size 8 women's and they fit perfect.\n"}
{"text": "Work great. A little snug and the part were the strings loop thru it is seperating. But overall they worked at the beach and the river this past summer.\n"}
{"text": "I bought these for my boyfriend for our recent cruise and he is super flat footed....so he has a hard time with shoes. I was worried when I bought these but he absolutely loved them..he kept saying how comfortable they were and how they don't slip off like other water shoes. Great job! Highly recommend.\n"}
{"text": "they fit as expected and its nice to know that you can go from beach or boat ramp to boat and not have to remove your reg sneakers to get on they are perfect for what I'm using them for couldn't be happier\n"}
{"text": "These are super light, dry quockly, and very comfortable. Fit as expected. The only complaint I have is that they show some wear after 1 river float trip (the sides are starting to split from the sole), bit that is likely due to the rocky river bottom. Overall, this was worth the $25 spent\n"}
{"text": "Fit well, nice materials. Flexible & comfortable with nice rubber sole Fake drain holes, have to drill yourself with 7/16\"\n"}
{"text": "Great confortable water shoes! Wish the sole was a big thicker but it worked pretty good for my trip to Tulum discovering cenotes!\n"}
{"text": "Light, packable, perfect water shoes\n"}
{"text": "Used for a muddy jungle ATV excursion during our last cruise, definitely recommend. They are very comfortable, fit true to size, and dry quickly.\n"}
{"text": "Wear them constantly at the beach\n"}
{"text": "Don't typically wright reviews. However, this product deserves some recognition.  They have the weight of feeling barefoot with the comfort of my $150.00 Asics.  They look really neat as well.  I typically wear an 11 in Asics and 11.5 in adidas.  I purchased a size 11 in this shoe and it fit perfectly.\n"}
{"text": "Excelente calidad, y muy cmodas. Me encantaron.\n"}
{"text": "Good price, good quality, comfortable. I have bunions and was worried about comfort, but these were great\n"}
{"text": "Very light weight and fits well\n"}
{"text": "it is built with good materials\n"}
{"text": "I had purchased these for a gift and they were received with high praises\n"}
{"text": "Would Recommend Because of quality\n"}
{"text": "I loved these at first but after 3 times in a pool they have really stretched and are way too big now. Order a size smaller than you think you should. If they didnt stretch so much, Id give 5 stars.\n"}
{"text": "These are very comfortable and look nice. I haven't been to the beach yet but they work great at the pool\n"}
{"text": "Nice & comfy, fast ship!\n"}
{"text": "I bought these to go on vacation.  They fit perfect and are so comfortable!\n"}
{"text": "Great water shoes. My son and husband loved them. Very well made for such a great price\n"}
{"text": "I wore the shoes walking on pavement and also into the water at a beach with coarse sand, pebbles, and shells.  They performed beautifully.  But the following evening and days my toes and toenails were in pain.  I realized they must've been too snug on my feet.  I would suggest ordering up a half size.\n"}
{"text": "I do tons of waterfall hikes every weekend averaging 5 to 10 miles a day in the shoes very comfortable and great for all water sports\n"}
{"text": "So far so good!!!!!\n"}
{"text": "They are run big and are very thin so you feel every rock you step on.\n"}
{"text": "Super comfortable! Fits like a slipper!\n"}
{"text": "My only issue with these is that when water walking in sand the sand gets trapped at the back of your heel and starts to hurt. It doesnt matter how many times you empty it, it continues to happen. Other than that they are very light weight and Comfortable. And a lot more durable than some of the other ones Ive seen.\n"}
{"text": "I needed a lightweight water shoe for a week-long adventure cruise in South America.  The shoe was ideal.  It is comfortable with nice stying. Plus it was lightweight to pack and comes in a resealable heavy-duty bad which made it easy to pack in my suitcase while they were still damp.\n"}
{"text": "Very cheaply made and looks.  I will not wear out in public but just to fish in.  The product is not worth the  money paid or even close.  Walmart sells $3 water shoes with more style.\n"}
{"text": "They are true to size, out of two other brands that ran way to big and returned. Just get your regular shoe size. I will have to drill out the holes because they have rubber in them. But a fair trade for a great fit. Built well with good materials. Would recommend.\n"}
{"text": "Fits as expected and works with water. Dries quickly and has lots of grip on slippery surfaces. Does have a lot of flex so you will feel every rock. Watch out for the back of your heel though as this shoe will rub your skin off if you dont use a bandage or tape!\n"}
{"text": "The water shoes have a shoe lace adjustment piece to keep the shoe quickly removed or put on. A removable insole let's water quickly drain out holes at the bottom of the soles. It also aids in drying and cleaning to remove the insole temporarily. They look good too.\n"}
{"text": "Left blue dye marks all over my feet even though the color of my shoes are white and pink...? They were kindof big where my toes and heel didnt touch the front or the back of the shoe, but it was tight enough where my foot didnt move around. Theyre okay but I was hoping for some super comfortable shoes and that isnt what these were unfortunately.\n"}
{"text": "They fit great and are very comfortable. I wore them kayaking the first time. Would have been 5 stars except...they aren't color fast. When they got wet, the dye bled onto whatever they touched. Recommend washing them in vinegar to set the color before wearing them.\n"}
{"text": "So can I just say I LOVE the color of these shoes, such a vibrant pink. I received these shoes today and I have had them on all day! They are so comfy, like wearing socks with a sole. I wasnt sure to size up or not reading other reviews, but I dont have a wide foot so I ordered my normal 7.5 and they are perfect!! These shoes are so much more than I expected. I will update if I have any trouble with them, but as of now.... THUMBS UP!!\n"}
{"text": "I like the concept of these very much. They have a snug fit, much like that of a sock with a hard bottom. They are fairly comfortable, a note for myself; the front of my foot spreads wide when stepping down. That being said for someone whos foot isnt very tall, but still wide; they are a good fit. My only reason for giving 4 stars rather than 5 is I wouldve liked them to drain a bit better. Ive worn others in the past that didnt become as waterlogged as these did. Im only trying to be fully transparent as I didnt expect them to hold as much water for the length of time that they did.\n"}
{"text": "Looks to be of decent quality. Since I havent worn it yet difficult to say how long it will last.\n"}
{"text": "I love these water shoes! I bought these for our trip to Florida and they are great. They fit snug so I don't have to worry about them coming off in the water. They protected my feet great from things on the beach and in the water.\n"}
{"text": "These work fine as water shoes. I use them up in the finger Lakes, NY which has a shale beach and rocky bottom lake. However I would not call them quick drying at all. In fact they seem to dry slow. Not sure a regular pair of sneakers wouldnt try at about the same rate if not faster. A few hours after coming out of the lake and they are still wet.\n"}
{"text": "Used to climb falls in Jamaica, explore ruins and walk beaches. Held up great and didnt hurt my feet\n"}
{"text": "Worked great for a rafting weekend.  We had some light hiking, lots of rafting, zip lining, and out door games.  These shoes worked great for the whole trip.\n"}
{"text": "Great shoes for the price. Perfect for swimming in most places with rocks and muddy water. Great for crossing rivers.\n"}
{"text": "Best looking water shoes I have seen.  Love that they have drain holes.  Very comfortable.\n"}
{"text": "Great inexpensive water shoe! Used them at the beach for a 3 day camping trip and at the river a few times. Considering 3 days of salt water & sand, theyve held up nicely.\n"}
{"text": "I purchased this for our Oregon Coast trip this past June 2019! This things are amazingly tough! They are also comfy!!! Will definitely use them back home in hawaii ne.\n"}
{"text": "Great for excursions when you need shoes and water shoes! I wore these all over Jamaica! Comfortable and dry fast!\n"}
{"text": "I am a guy with a 10.5 shoe size, ordered a 10 and they are to big.  Will be ordering a 9.5 for a men's 10.5 shoe size to replace these.  THE SIZES ARE TOO LARGE.\n"}
{"text": "I think I like its soul.\n"}
{"text": "Almost too small; hard to get on but once on ok\n"}
{"text": "The fit is good and the shoes are very comfortable\n"}
{"text": "Comfortable, light, but sturdy water shoe. My son used them for our recent trip to Costa Rica. Since the beach and ocean were a bit rocky, they were great for walking and swimming in the ocena.\n"}
{"text": "The shoe construction is really good and the fit was correct. However there was a tightness on the back of the toe, where the elastic gives a bruise on the skin.\n"}
{"text": "Not durable\n"}
{"text": "Perfect for cruise ship deck wear\n"}
{"text": "Better than expected. Great water show, definitely worth the money\n"}
{"text": "It looks like a decent water shoe but in under 6 months of use it has started to come apart.\n"}
{"text": "I like this shoe.\n"}
{"text": "Super cute, I am a perfect 7.5. It runs small.\n"}
{"text": "Fix nice I like them\n"}
{"text": "Very comfortable\n"}
{"text": "The fit of this shoe is just right. Feel comfortable and they look as though they are durable and well made. We will see!\n"}
{"text": "Wayyyyyy tooo big. Size down.\n"}
{"text": "True to size, light weight, easy to get on and take off with some room for adjustment! Water resistent but not water proof, however dry very fast and so far havent developed any odors. Super easy to clean and for a water/shower/gardening shoe super stylish! Its great to be able to work in the garden and run to the store in the same shoes if you wanted to. Would make great beach shoes too! Durability TBD.\n"}
{"text": "Boating... happy\n"}
{"text": "It fits didn't go in the water let but so far it's ok thick bottom do you can walk on tough surface\n"}
{"text": "Very comfortable and well made.\n"}
{"text": "There is nothing I dislike about this shoe, it fits well, is comfortable and great to wear on the jet ski.\n"}
{"text": "Love these water shoes! They are great and dry fast. I use them when I am out in my kayak.\n"}
{"text": "Very inexpensive deck or pool shoe. I purchased these shoes for a trip to Florida. I wanted a shoe that I could get wet and was easy to pack. These fit the bill\n"}
{"text": "Good grip on sole.  This is the first pair of water shoes I've bought in years, and those were awful, so dont have much to compare to.  But these are solid imo.\n"}
{"text": "fit good looks grate\n"}
{"text": "Love them, light weight, comfortable,  very enjoyable\n"}
{"text": "Realmente nos encanto, aun no lo usamos pero ya los probamos y el producto es todo lo que estbamos  esperando, super comodos, se adhieren a los pies y sob muy frescos, los recomendamos 100%\n"}
{"text": "Very good price and they fit perfectly. I was surprised how well they stay on your feet while being in the water all day. I recommend them for anybody that does a lot of boating\n"}
{"text": "We loved our pairs, they fit perfectly and were very comfortable. We used them to snorkel, jet ski, and paddle board.\n"}
{"text": "I bought these water shoes for me and I love them.\n"}
{"text": "I bought these water shoes for my husband to wear on our boat.  He wears them to do yard work etc.  They were a perfect fit!  They are comfortable, practical and very versatile.  A great buy for the beach, or working around the yard.\n"}
{"text": "The fabric/elastic where it goes over the top of the foot tore away on the first wear. Stay away - poor quality. Had to give it a 1 star in order to submit the review. Should be a big fat 0.\n"}
{"text": "They look sharp and are a great value. Their strongest feature are the grippy soles. Took them down the Colorado River and felt comfortable in them in a number of wet and dry situations including rock scrambling. A little slow to drain once wet. Good light weight aqua shoe.\n"}
{"text": "Great shoes. They are super comfortable, basically like not wearing shoes while still being able to walk on rocks. I bought them to use on the boat while fishing, now I wear them anytime I don't need real shoes.\n"}
{"text": "Bought these bad boys to take to Costa Rica last month. Light weight and easy to pack. We took only backpacks and they left plenty of room. They held up amazingly hiking through the rainforest and exploring through waterfalls. We wore them zip lining where we had to hike through the mud and up pretty steep inclines and they had great traction. My boyfriend and I both got a pair and we couldnt haven been happier.\n"}
{"text": "I had booked a self guided rafting trip at the start of the week and needed a quick alternative to flip flops.  These shoes shipped immediately and worked exactly as intended.  I was able to comfortably walk on a gravel parking lot with no problems.  I'd recommend buying a size smaller and possibly even a half size more.  I'm an 8 and half in mens and had to return my first pair for being too large.  I'd say even the 7 and half was slightly too large but the laces helped counter that problem.\n"}
{"text": "This shoes seems to run a little small but when you find the ones that fits you they are the bomb. I bought this for a trip to the Florida Keys  and never took  them off, go figure.\n"}
{"text": "These feel great and super lightweight! When I tried them on I was like Ooooh can I wear these to work haha. Seriously though, theyre very comfy and I wear a size 11 in Women. Only dilemma is the teal blue color is actually more green but Apple changed color variations for some reason.\n"}
{"text": "Its a Very well designed good looking water shoes. It fit as expected and very comfortable to walk and looks good too.....material is looking durable and would definitely recommend this\n"}
{"text": "Love this shoes. Stays on well as it has an adjustable lace and is soft on the pool floor. Tried two other different kinds and liked this the best. The only con is that the water doesnt drain out as rapidly as the others but for water aerobics, this is a great shoe\n"}
{"text": "Shoes to narrow. Would be nice for people with narrow feet\n"}
{"text": "These water shoes fit very well and look great.  I hope the inner sole won't delaminate from the inside bottom of the shoe like mine have from other manufacturers.\n"}
{"text": "Work as expected.\n"}
{"text": "These shoes are so comfortable!  They stay on in the water and feel great for walking. I was very impressed, highly recommend.\n"}
{"text": "I wear 8.5 but got an 8. They fit perfect. Very form fitting. Comfortable. Great grip.\n"}
{"text": "I purchased these water shoes specifically for tubing down a lazy river and am very pleased! The shoes fit as expected, were comfortable throughout the day (no blistering), and held up great in and out of the water. Id highly recommend!\n"}
{"text": "Didnt like anything, product runs 2sizes too small and isnt worth $20.00. Ive bought better aqua socks for $8.00\n"}
{"text": "Fits great, my son has very wide feet wears a size 6 and the 6 fit great. Very durable holds up to the river bottom well. Easy to put on and adjust.\n"}
{"text": "Very light weight and comfortable, great price, would definitely recommend to others.\n"}
{"text": "These are amazing water shoes that actually LOOK like running shoes! They are completely comfortable, as I have slightly wide feet. I felt very comfortable walking around my boat, in the water, the dock, EVERYWHERE!\n"}
{"text": "Too tight...runs half to full size smaller\n"}
{"text": "Perfect, just what i was looking for. Fit nicely and good quality\n"}
{"text": "Good product. Held up well for rafting. Fits slightly wide feet well. But did rub a bit on the heel over all good value . Held up well during river hiking and rafting with good traction on rocks.\n"}
{"text": "I recently purchased these was just able to actually put them on for the first time and went by what the recommendations were to order per size they still were a half inch too large. If you ware 10 1/2 . You should order a size smaller than what you normally wear\n"}
{"text": "Comfortable and very light\n"}
{"text": "The shoe itself is fine however very un comfortable due to the rear heal having a very rigged stitching that irritated my ankle in less then 1 minute\n"}
{"text": "Made of very light stretchy material. We live by the lake so these are perfect for walking the dogs on the lake shore. Would recommend.\n"}
{"text": "Good for boats and beaches.\n"}
{"text": "Water shoes were exactly as they looked on line. I got the shoes for launching my boat and playing in the water obviously, but the shoes have a thicker sole so that after lauching the boat i can walk on the gravel parking lot with no issues. Great water shoes!!!\n"}
{"text": "Wears them out fishing!\n"}
{"text": "Hiked Hawaiian trails with them and loved them. I wasnt happy when my wife ordered them but couldnt be happier after.\n"}
{"text": "I bought 2 pairst rotate when I kayak fish. They fit well an are more comfortable than I expected for what I paid. I've used them once in a sandy river and was well pleased.\n"}
{"text": "Love how comfortable they are\n"}
{"text": "Great fit. Flexible and comfortable.\n"}
{"text": "I absolutely love these shoes. The fit was perfect however at times the back of my right shoe rubbed on the back of my heel ( I believe this was due to not putting the insert back into the shoe properly). They held up during the beach, pool, and two Jamaican excursions (Luminous lagoon and Dunns River Falls). These shoes exceeded my expectations!!\n"}
{"text": "These run small and are very narrow. If you have a large foot I'd look elsewhere.\n"}
{"text": "Will use for swimming and fishing\n"}
{"text": "Decent for hiking but do not buy them for water shoes. Got these for oyster bars and they hold water all day and hurt my feet after a few hours on the boat.\n"}
{"text": "perfect for the pool and beach\n"}
{"text": "Easy to wear easy to clean , comfortable and dry off time is short . Highly recommend for outdoor needs , hiking , boating , fishing , wading , kayaks , running , really light weight can do just about everything a normal non water shoes can do\n"}
{"text": "I wear them daily to water aerobics. They fit great and are true to size. Quick drying also!\n"}
{"text": "If you are wearing this over a neoprene boot add 1-2 to us shoe size\n"}
{"text": "Great product at a great price love the shoes\n"}
{"text": "Better than expected! Comfy, drains water quickly, great shoes! I've gotten myself and my mom/sisters all pairs!\n"}
{"text": "Looks good, feels great, comfortable. Im not sure about durability yet. Well see\n"}
{"text": "I bought the swim shoes with hopes of the being comfortable. Well they are comfortable, dry pretty fast, and the size recommended actually fits my foot. This is a great buy for me.\n"}
{"text": "Love it\n"}
{"text": "My husband love these! Hes very particular about his shoes, but he loved them and wore them the whole camping trip.\n"}
{"text": "Love these water shoes. Comfortable and the tread grip is great\n"}
{"text": "Fit well and comfortable\n"}
{"text": "Fantastic pool shoe for the price.  Extremely comfy and the fit is great.  I wear size 11.5 and ordered a size 12.  Perfect fit.  My wife ordered her exact size and fit great.  Good value.\n"}
{"text": "To small\n"}
{"text": "Bought for my dad, he only used it once so far but they worked great.\n"}
{"text": "Awful used 1 time and didn't last! Ripped, didn't help in slippery rocks\n"}
{"text": "Very comfortable, easy to put on, easy to get off. Great!\n"}
{"text": "Great Price, comfortable, functional\n"}
{"text": "Ran a Spartan race with these bad boys & they held up great! I normally wear a 9 1/2, but since they only come in whole sizes I went with a 10. Probably could have ordered a 9, because it was a little big.\n"}
{"text": "I like the laces as shoe stays on better.\n"}
{"text": "Its is great and comfortable but the fabric is to thin\n"}
{"text": "You will notice that the part for the strap ripped right off when I put on out of the box. These werent even tight, just cheaply made. From China. Sent back the next day.\n"}
{"text": "I have probably worn these shoes 30+ times and that is why they look dirty in the pictures. I tried to show what two months of abuse looks like. I got mens5.5/ladies7.5 in pink. They say size 38 inside the shoe and they are made in china. I wear USA ladies size 7 to 7.5 and these fit perfectly. By that I mean that my toe just hit the end making them just barely perfect. If my toes were any longer these would be slightly too small. I have small flatter feet also and do not need wide widths at all. If you do you probably want to go a size up. They hold up well to my many different surfaces. On gravel you feel it but it is not painful. They have pretty good traction and the insoles stay put. I've not had any blisters and they are made very we so there is no odd stitches that rub ur feet or that cause any issues. I personally love these shoes and am happy with my purchase I've tried others before since I was a teenager and these are my favorite. I like the color options and the drawstring laces also. Makes them easy on and off. They are lightweight also and my feet dont cramp after wearing them for hours. I want to note that all pictures are while they are wet and dirty. I have worn them over thirty times on multiple surfaces and in and out of water. This is what they look like today after a few miles of walking 3 huge dogs in wet freshly cut grass. They havent been washed as of yet and they still look good. No busted stitches or worn spots although I haven't been easy on them. If you are on the fence you should buy these shoes. If you have a thinner foot your size in usa sizes may fit u but if you have longer toes or need a wide with go a size up. Hope this helps.\n"}
{"text": "Wished for a bit more internal padding and support like a bit of an arch.  I wear for exercise, jogging, water resistant work in the ocean to protect my feet from cuts.  The cords are almost too generous if they become get free from being tucked under the  lattice formed when laced. then they hit my foot/ankle and almost the ground. My foot is a bit narrow, so maybe if you are wider than not an issue. Nice drainage holes and thick sole.  A thin, (think white old school shoe odor/pad), insert with an almost rice paper thin mess fabric cover(soon will be useless -  cheap).  I rinse mine really well with hose and sometimes turn inside out and remove interior foot bed padding to clean away all beach debris.\n"}
{"text": "The soles seem supple. I'm confident that the pattern and rubber like material will be grippy on the boat, but I haven't tried them yet. The shoes are light weight. The soles a bit thin so they really are water shoes or boat shoes as advertised. I won't be using them for much else. Back in the day of work boots my USA shoe size was 11 EEE. Over the years I've learned to order larger sizes in other types of shoes. Sometimes as large as 13. I ordered these in size 12. They fit just fine. Look closely at the individual pictures of the product before ordering. The soles and styles vary.  The shoes I got were \"Size 14 Women / 12 Men A Grey Orange\".\n"}
{"text": "I bought this shoe to go to Hawaii.  It ended up being the only shoe that I wore.  We were on the Big Island and hiked over lava beds, jungle, sand, rocks, sloping hills, water every type of terrain imaginable.  The shoes held up great and my feet remained comfortable for 12 hours at a time.  I did get sand in them once, but I don't think that was the fault of the shoes as I did not have them tightened down.  Otherwise I did not get sand in my shoes, the water ran out, my feet did not feel wet and soggy.  This is however a \"barefoot\" shoe, so they are very pliable and bend with your foot, no support or stability.  I was careful not to hit sharp edges of rocks.  I like the way the laces are sown and the way the rubber comes up to protect the tips of your toes.  That feature saved my toes more than once.  Overall, a very comfortable shoe.  The group I was with all had on expensive water shoes.  These held up better than theirs and for a fraction of the money.  I have not worn them since, but I put them through their paces for 6 full days.  Will start wearing them soon for lake and river boating this summer.\n"}
{"text": "As a family guy my summers are comprised of swimming in rivers and beaches and climbing inflatables at the water park. I also have bum feet - flat as pancakes and I need support, especially while waiting in long lines for a water ride or getting lunch for the kiddos. I need something that I can go in and out of the water and will handle sand, rocks, grass and concrete ...and boy do these shoes rock. I've tried more expensive water shoes (Keen's - too bulky and little toes stick out),  Adidas, Chaco Torrent and Odyssey (interior stitching leads to major chafing...WTF??) and those do not hold a candle to this bargain basement priced pair of UBFENs. I got the \"C Blue\" with the side cage and laces ... didn't even need the laces - they fit great without any kind of lacing. The traction on these are fantastic - I made mincemeat out of the inflatable obstacle course out on the lake. They tried relatively quickly, too. Getting my wife a pair of these toute suite!\n"}
{"text": "The size on the shoe is 45.  The size on the bag is \"XXXL\".  The size in the description I ordered was \"Mens 11 / Womens 13\".  Way too big for me even though my normal shoe size is 12.  On top of this the description says these run small.  This is the second time I have tried to order these with similar results.  I really don't know how a person is supposed to order clothing of any kind when this nonsense takes place.  Such a waste of my time.\n"}
{"text": "Not capable of fishing streams. Every rock larger than a pebble was felt with every step, also my tennis shoes have better traction than this product.  I'm sure they would be great in a public pool or walking on smooth surfaces but it was a disappointment for the river I used them in.\n"}
{"text": "I am so happy I got these shoes! I love working in my garden. One of the downsides is I get my shoes very dirty and muddy. And it seems that just briefly letting your shoe touch any dew or wet grass instantly results in them becoming drenched! Then your socks are wet and your shoes start to stink. These fix all that. They are meant for wearing in the water, which is also cool, though I haven't used them like that. But I can see how they would. When I go camping and go swimming or wading, I don't like my feet touching the bottom. I don't like the slimy feel on my feet, plus sometimes there's sharp rocks. I've often tried to wear flip flops but as soon as you start to swim, up they go (or down, and you got to try and find them!). But I use them out in the garden. I can get them dirty and wet and muddy, and it's no problem. The dirt will wash right off, and then they'll dry fairly quickly. They feel good on your feet. I wouldn't wear these for extending walking - like on a hike. But for specific things, like going to the beach or working in the garden or even just having to go outside quick in wet grass, these are excellent.\n"}
{"text": "The grip on rocks under water is really good, it kept me from slipping on rocky river ( The Narrows, Utah) however, the shoe will leave a stain on your foot if you are wearing it for hours under water. The leather backing on the shoe must have been soaked on black dye and was not cured properly. It stained my foot for a week. It also stained our bathroom floor for a couple of days since I left it standing there to dry out after I used and rinsed it. I was not aware of the dye would still stain my floor until after 2 days of letting the shoe dry and left a mark on the floor. Other than the stain issue, this shoe works great. I hope they will do an update on the material they used to avoid this issue.\n"}
{"text": "They are everything as advertised with the exception of being a bit large.  They appear as slip-ons and go.... yet the sizing is for sock included. Example: I wear a 9.5 to 10 in shoes WITH socks.  The 9.5 I got is just that much larger..... yet they are intended to be sockless. Other than that they are GREAT.  The soles and mesh are as I hoped for and expected.  My wife immediately ordered herself a pair....... that is the gold seal.\n"}
{"text": "Nothing. Only they are in Chinese sizes. Just so the buyer is aware. My U.S. size 11 was a Chinese XXL\n"}
{"text": "Nice\n"}
{"text": "Very thin sole and uncomfortable shoe.  I sent them back.\n"}
{"text": "nice fit\n"}
{"text": "Comfortable\n"}
{"text": "Bought these for out Florida trip. Only planned on wearing them occasionally,  but when I put them on, I never took them off. I wore them all day everyday for the whole week.  I love them. Highly recommend!! Super comfy!!\n"}
{"text": "Love these! I recommend a 1/2 size larger. Comfortable and cool. Great deal for the price.\n"}
{"text": "These things have come in handy more than not. It is easy for rocks to get in them but they are easy to take on and off\n"}
{"text": "These water shoes are like socks, you simply just slide them in and it conforms to your feet. It gives the freedom of being barefoot, but provides traction for slippery terrain. It was comfortable and did its job in keeping me stable.\n"}
{"text": "Very comfortable wear used in the beach n noticed it fit comfortable didnt feel loose on the water\n"}
{"text": "They are almost like walking barefoot, with cute little toe protectors. I like that I can take out the insoles and wash them. For the price, it wont break the bank to replace them when they wear out.\n"}
{"text": "These are good to swim and walk in. May want to get insoles is you are going to do a lot of wlaking\n"}
{"text": "Im a mens 10 ordered a womens 11/mens 9.5 fits like a 10.5\n"}
{"text": "I have enjoyed these shoes. I would recommend them.\n"}
{"text": "Perfect size, nice and light weight also.\n"}
{"text": "Took these out for a kayaking trip. Felt great, worked great!\n"}
{"text": "Good fit. Could be a little more \"grippy\" I have some trouble with rocks covered in moss\n"}
{"text": "these fit well, grip well and protect your feet in water.\n"}
{"text": "product arrived on time and as expected.\n"}
{"text": "The shoe fits great very light weight an looks really great make sure u go up a size\n"}
{"text": "Ordered a size 13 for my husband.  They are at least a couple sizes too small.\n"}
{"text": "Good\n"}
{"text": "I bought these for my son before a trip to the lake.  They fit him well and they were comfortable for paddleboarding, kayaking and walking to/from the swimming hole.\n"}
{"text": "I like the ease of simply slipping them on. I have yet to wear them in the water, but I did wear them on a quick store run and they felt fine.\n"}
{"text": "So comfortable and great for wearing during my workouts. My feet used to cramp and hurt after workouts when I wore tennis shoes. These shoes activate the muscles in my feet and ankles and now the pain is gone.\n"}
{"text": "I order a ladies 6.5 / men's 5.5. They came sized as a European size 42. I would wear a size 38. They were 4 sizes too big. I couldn't obviously wear them on my river weekend adventure. Bummed.\n"}
{"text": "Love the fit. true to size.\n"}
{"text": "My son is normally a size 10.5 and we ordered a size 9 and they fit perfect. They are nice!!! He was very happy with them!\n"}
{"text": "These shoes will give you more protection than the regular water shoes, I liked them a lot and they are so stylish\n"}
{"text": "Liked the water shoes, fits great\n"}
{"text": "Los zapatos son bastante bonitos el diseo es increble. Y la talla super bien y ms que bien excelentes.\n"}
{"text": "comfy and great value.  throw em in the washing machine when they get dirty.  good colors\n"}
{"text": "Dirty! My \"new\" shoes came to me covered in mud!\n"}
{"text": "Great for lounging around the house or yard.  Very well made.\n"}
{"text": "These shoes were perfect for our cruise, they drained easily and fit perfectly\n"}
{"text": "Nice fit did the job\n"}
{"text": "Ripped first time wearing them\n"}
{"text": "I ordered my regular size but needed to go whole size up, but they look great in pink color!\n"}
{"text": "The quality of the shoe was okay, but the sizing was way off.  China must not adhere to U.S. sizes.  Ordered an 11 mens and it was two inches shorter than my husbands other water shoes.\n"}
{"text": "Excellent product as advertized.\n"}
{"text": "Perfect for wearing on a boat where you need good traction, and non marking. Also the toes are protected from bangs and scrapes from the deck hardware on the boat. Love Love. My husband's shoes he loves too. We may buy extra pairs to keep on hand!\n"}
{"text": "I ended up buying mine a little small, but it's not a big deal since these have plenty of stretch to make up the difference. These have been nice summer shoes for around the house. I would not recommend these for long walks on pavement. I would recommend them for beaches, trails, and sandy areas with some cushion.\n"}
{"text": "Never had this type of shoe before.  Always wore Nike but I must say I will never buy any shoe but this from now on. Exact fit, Super lightweight , outstanding traction.  Probably will be my every day shoes.\n"}
{"text": "Great quality! Husband really liked it and said they fit well and very comfortable. A friend whos a diver recommended getting 1/2 size bigger for water shoes, and were glad we listened to him.\n"}
{"text": "Thes are the best water shoes I have ever owned.  The holes in the bottom let the water escape so I don't feel like my feet are squishing around in water all day.  Also they fit me perfectly in my regular sneaker size shoe.  Glad I made this purchase.\n"}
{"text": "I'm using the shoes for sim racing, because of the thin sole and the rounded heel.  They give great pedal feel for heavy duty brake pedals, are light, breathable, grippy, and affordable.  Works great for my purpose.  I can modulate the brakes even better than with bare feet or socks.\n"}
{"text": "I should have bought these a long time ago. I fish the back bay where there's glass and rocks on the shoreline. These protect your feet and are extremely comfortable. You don't even know you have them on. Easy to get on and off. Rinse them off and they dry pretty quickly.\n"}
{"text": "It fit perfect. Good color and good construction. The heel material right by the ankle needs to be softer and or shorter. After wearing it for two hours it rubs right at the ankle and may cause a blister.\n"}
{"text": "So I watched another post on these shoes saying he had to drill the holes in the bottom of the shoes to drain. Overall this is a great pair of water shoes and would have a 5 star rating if I didnt have to make this modification.\n"}
{"text": "I am not used to other sizing and would.plan on ordering a little bigger than Google says is American sizes .. next time I will know. But these are awesome shoes... easy to put on quickly and have a good sole with great traction! They are going to be awesome at water parks this summer! Will be buying more for the whole family!\n"}
{"text": "Very good looking shoe but if you are size 11 go for 12.\n"}
{"text": "Great fit and sturdy material! Colors are great :) run a little big but otherwise great water shoes!\n"}
{"text": "Perfect!\n"}
{"text": "Nesesito cambiar los zapatos me lo puse 2 veces y seme rompieron\n"}
{"text": "light and comfortable\n"}
{"text": "Great shoes to climb Dunn's River falls in Jamaica.\n"}
{"text": "It fit well and was comfortable to walk around in.\n"}
{"text": "I have used these for sand volleyball and kayaking adventures. They are true to size, and the adjustable band makes sure they fit well. I would highly recommend these wayer sports shoes\n"}
{"text": "Nice price and shoe\n"}
{"text": "no tenia muy buena pega\n"}
{"text": "It was supposed to be a men size 13, but it feels much too tight.\n"}
{"text": "The water doesnt drain out...you have to use a blowdryer to get them dry enough to wear the next time.\n"}
{"text": "Feels almost like Im barefooted.\n"}
{"text": "This shoe was to small had to return for larger size.\n"}
{"text": "Perfect for walking the beach or for use as shower shoes at camp sites. Nice, Well constructed,\n"}
{"text": "\n"}
{"text": "Well made. Comfortable.\n"}
{"text": "Great fit.  Comfortable.\n"}
{"text": "Great\n"}
{"text": "Great water shoes.  A bit pricy, but we will see how they hold up over time.\n"}
{"text": "Honestly these rock I want like 4 pair just to wear everyday I explore and metal detect and these help me they drain and dry fast makes it nice to go back and forth from river to land by kayak\n"}
{"text": "I love these shoes especially hiking,tubing and rafting.\n"}
{"text": "They fit great\n"}
{"text": "I like that they can be worn around comfortably and they are not just for water use\n"}
{"text": "I participate in an aquatic therapy program for Parkinson's disease, which has been extremely helpful, but dealing with a rough-surface pool 3x/week has been hard on my feet. These water shoes are the perfect solution.\n"}
{"text": "Very comfortable\n"}
{"text": "Needed 11.5 got him a 12 and they got perfect. He loved them\n"}
{"text": "Good product\n"}
{"text": "Comfortable to wear.  Best water shoes I've ever owned.\n"}
{"text": "I bought a bigger size than usual and they were still too tight. I ended up giving them to my brother who is a size down from me. They were tight on him but I believe they are supposed to be tight. My reccomendation is to go a size and a half bigger than usual.\n"}
{"text": "My husband wears a size 14 and it was hard to find some to fit him and he says they r very comfortable.\n"}
{"text": "As far as draining water it is good but there is very little support. Can only wear them for short periods at a time. Don't understand how other reviewer go hiking in these shoes.\n"}
{"text": "These things are great! Pretty good grip in the rocky river and they dry out well. I wish I had ordered just a bit smaller, but theyre pretty rad!\n"}
{"text": "I've worn them for two summers now and I love them. They've held up well and everyone asks where I got them!\n"}
{"text": "Time will be the real proof, but so far so good. They look good, fit well, and are very comfortable!\n"}
{"text": "This is the second pair for my husband, he loves them! Great for walking in the sand, on the beach! Great for rugged walking!!!!\n"}
{"text": "These are sturdy enough to wear on long hikes and in the shop.\n"}
{"text": "Inexpensive and lightweight. Bought a half size smaller than what I wear for sneakers and they fit smugly. Comfortable and enough support/protection for intended use..\n"}
{"text": "Bought these not for water especially but for a comfortable casual weekend shoe.  I have a narrow foot so may not be the best to review, but wish the heel fit better. All in all a good shoe and I'm very happy with them.\n"}
{"text": "They're really good shoes for the cost, but the sizes are a bit tight. Not sure how long they'll last, but for the cost one season will be good enough for me.\n"}
{"text": "Just got my shoes, put them on, walked in them  They feel great  R comfy and look good.  Soft Came well packaged.\n"}
{"text": "Weve had these 11 days exactly and have maybe used them half of the days. Quality is terrible dont buy.\n"}
{"text": "Great water shoes bought them for my son for a trip to a water park he said they were comfortable fit well and didnt feel heavy on his feet\n"}
{"text": "The shoes seem to be great quality yet they are too large. I ordered a pair one size smaller and those are 2 sizes larger.\n"}
{"text": "So I bought these shoes for the pool and beach. They are so very cute but durable. Very well made. Will buy again.\n"}
{"text": "I wore these on a two-day white water rafting trip. They seemed like a very good quality for the price and were extremely comfortable. They dried very well and held up well on the camping portion of the trip\n"}
{"text": "I purchased the shoes for my son who is working a camp with water sports.  He didnt want the cheap looking ones so we found these and they look great. He loves the fit and look and they will be perfect for the summer.\n"}
{"text": "Don't like that they stay wet so long. Wish they would dry out faster. Once you are out of the water, your feet feel wet for a long time.\n"}
{"text": "These are THE BEST water shows EVER!!! We loved them! My boyfriend and I used them throughout our entire vacation. Very comfortable and quite cute! Did not hurt after wearing them all day. Highly recommend to buy these! Very true to size!\n"}
{"text": "Great water shoes!! Look exactly as pictured (I ordered the purple with white, and the black with white) fit true to size and just as described. Walked on gravel and went white water rafting: had no problems! Stay on well! Very flexible and easy for travel! 10/10 recommend.\n"}
{"text": "These were a Christmas gift that held up well. Almost a year later and they are still wearable.\n"}
{"text": "Really awesome for the price! Never used water shoes before. What a great thing to have when swimming with sharp rocks\n"}
{"text": "Wish it had more arch support but for the price I am very pleased.\n"}
{"text": "These shoes are comfortable and lightweight. The material is decent quality. Great for trekking in the water.\n"}
{"text": "Bought these water shoes for my husband to take on a river float trip.  They worked out well for the purpose and were a good value for the price.  He is normally an 11.5 and went with a 12 in this water shoe (half size was not available).  He was pleased he went half size up to 12 versus going down half size to an 11.\n"}
{"text": "These are great shoes and I totally like them, the only thing is the elastic laces don't stay tight. I just tied a knot in them.\n"}
{"text": "Finally got a pair that actually does what they say they are\n"}
{"text": "Feels comfortable on my feet. Havent walked in water with them. They do seem very\n"}
{"text": "I felt like it would hurt if i stepped on rocks in the river with these on. They were comfortable and fit well.\n"}
{"text": "Comfort, fit and style! Girlfriend hates them, I love them!\n"}
{"text": "Great shoe but smells really bad and can't be used next year.\n"}
{"text": "Just what I was looking for, beach/swim shoes\n"}
{"text": "Worked great\n"}
{"text": "Nice style, but couldnt wear because I bought it the wrong size, and went to purchase again but they didnt have my size.\n"}
{"text": "I bought for my daughter as a gift. She camps and hikes. They will be great when crossing streams. Light enough for putting in pack to take along anywhere she goes.\n"}
{"text": "Fits well and handled the river rocks well. Feet were protected and kept pebbles out, only allowing sand inside the shoe.\n"}
{"text": "Very good quality. Loved the color and design. Perfect fit!\n"}
{"text": "This water shoe fit my wide feet.\n"}
{"text": "Good value item.\n"}
{"text": "Comfy, quick drying, and love that you can tie/make them tighter\n"}
{"text": "Love the shoes sooo much! However the picture colors are far off from what i got. The picture  clearly shows a teal and pink tag in the back. However when it showed up, the front was dark green and the back was reddish orange.\n"}
{"text": "Hubby dreaded the idea of these. Then he put them on! Wants to wear them everywhere & show them off to everyone. Comfy. Sleek. Good looking. I had to take them away from him temporarily til we go on our honeymoon. Haha.\n"}
{"text": "Got these for a cruise and honestly wish I had gotten them much sooner. They are comfortable and work great for wearing directly into the water while protecting your soles. The felt like wearing socks. My only gripe is if you don't rinse them the sand can stick around from past trips.\n"}
{"text": "I originally loved these shoes.. until I used them in the water. They rub on your feet so much it makes them raw and are extremely painful. Also the bottoms are not enough support if you plan on doing any type of walking over rocks. I asked other people who also were wearing these shoes and they also hurt their feet. I DO NOT RECOMMEND BUYING THESE.\n"}
{"text": "Sand, and small pieces of glass can easily get inside the shoe. Got home from kayaking and had small cuts and scrapes on my feet. Also the insoles in mine fell apart after the 5th use. Now they are uncomfortable to say the least. I personally feel mine were defective from the beginning. I wish i could return or at least exchange them for another pair.\n"}
{"text": "At first I thought the fit was too small or too snug but they stretch well and other water shoes have had a tendency to slip off in sand or mud, but these feel really good. They're good and snug but not uncomfortably so. The soles are heavy enough to make walking on rocks comfortable but are not clunky or bulky. The durability is yet to be determined but I'm very pleased with these. I snorkel and kayak in Maine.\n"}
{"text": "Bought these because I was going on vacation and I was definitely pleased. Got a size 13 and they fit great and felt comfortable in the water. They are really good quality as well. Definitely recommend if you are looking for some swimming shoes.\n"}
{"text": "Great shoe so far. Nice insole better cushioning. Didnt give it a 5 star rating because didnt come on time when at first it was and company didnt do anything about it and it was like almost two weeks late\n"}
{"text": "These are actually comfortable and I think they will last beyond the vacation stream wading I got them for. Now I am using them as canoeing shoes and they are perfect: decent tread, comfort, not falling off easily even in mud. Happily surprised with these.\n"}
{"text": "I ordered a men's 7 and I'm a women's size 8.5 US. Because these do run small try to order the next size up. Getting a pair for my husband and 80 + year old godfather. These are great for a non-slip surface . Easy to put on and take off in my opinion. Made fairly well and washable you just can't beat the price. Because these are  Aqua Shoes the support is that not great, so I used my removable arch supports. Perfect fix and so comfortable, I just love them.\n"}
{"text": "They did what they were supposed to do, were great while dry. Unfortunately they run you raw once you get them wet.  Other than that, they were great. No pulling in the water, or sucking in the sand at the beach. Stayed in place, even while jogging.\n"}
{"text": "Buen da los ped talla 5, nmero 37 y no fue lo que recib. Me enviaron el artculo una talla menos y le quedaron sper pequeos a mi esposa.\n"}
{"text": "I typically wear a size 7and they offered 7.5 so I bought it and it was a perfect fit -very comfortable, I found myself wearing them pretty much all day long.\n"}
{"text": "I wear a10.5 wide and the 11 fit great. But the package just says xxxl. None the less they are super comfortable. Probably not great to walk on sharp rocks. Did 4 stars because the side of one shoe is scraped up\n"}
{"text": "I love these shoes. I wear them all the time. Quick drying, light weight and so far holding up well. I wear a 13 wide and the 13 mens fit perfect\n"}
{"text": "Perfect fit. Unlike other water shoes, these cling to your feet really well. it gives great traction on rocks without your feet moving inside. great for hiking too. it's almost like being barefoot but with enough protection to prevent sharp rocks from hurting you. I am very pleased w these water shoes.\n"}
{"text": "These shoes are a great value. I took them on a hike to Havasupai Falls in Arizona. Great traction and no issues with the rocky pools and stream we waded through.\n"}
{"text": "Great water shoes. They do rub and cause irritation on the top of the foot. I use them with pedal kayak and they could be gentler on the lace area. Good value, though\n"}
{"text": "I got 2 pairs for both my sons. My oldest one has been wearing his while he's working on his aquaponics  system in my backyard. He has complemented that the shoes are very comfortable and true to size. He's been wearing them for the past week. If they last till November, he will use them at our family Maui trip.\n"}
{"text": "Water shoes fit good and comfortable. But I noticed the back of the rub to much on back of my heal so I put on bandaids to help with friction works great\n"}
{"text": "The shoe was worn on a paddle board on a lake for 2 hours before the sides came loose on both shoes.  Unfortunately, we came back from vacation just after the 30 day return window closed.  What a waste of money.\n"}
{"text": "The shoes fit like a glove. I purchased the shoes for driving. I didnt know they were for water application \n"}
{"text": "These were exactly what I was looking for, an alternative to those black water/socks, slipper things.  These look like minimalist running shoes and are comfortable to wear although I havent worn them for any long period of time.  I bought them primarily to use at a lake that has a rocky floor and truth be told haven't had the opportunity to use them for that purpose yet, however the look and comfort are great.\n"}
{"text": "im using these shoes for the beach and since i like my feet as flexible as possible while walking im using them in the park in yard and while fishing feel great thin enough sole to flex and feel the ground but thick enough to protect the feet love it\n"}
{"text": "While I haven't taken these out yet, I have worn them around the house, and let me tell you, these are a nice shoe. They seem to be better quality than any water shoe I've ever had, they are comfortable, and the sizing was on the money, which can be an issue ordering online. These are recommended!\n"}
{"text": "I've had these for just over a month, used them a handful of times, and they are already ripping. Not worth buying, don't waste your money.\n"}
{"text": "Awesome shoes. Break them in a little before hiking. Theyre good in grip, but get a little slippery when wet!\n"}
{"text": "This is one of the best water shoes I have ever bought. I used it to go surfing in Hawaii on a really rocky beach and had no problem walking. Its also very comfortable\n"}
{"text": "They are comfortable and look nice. The fabric is very thin and I am a bit worried about how they will hold up in the long term. But nice so far.\n"}
{"text": "Wonderful fit, and grips well to wet/slimy rocks (where I fish), as well as slippery materials like slides etc. Fantastic!\n"}
{"text": "The UBFEN shoes is very comfortable!  So far I have walked around the yard and shampooed the carpet, soon I will go to the beach and see how the shoes works out.\n"}
{"text": "I, love, these shoes! I use them more than the intended purpose. I wear them everywhere. When I'm going to the store or just around town. Super comfortable and durable.\n"}
{"text": "THESE SHOES ARE GREAT. THEY FIT AND FEEL AWESOME.\n"}
{"text": "First all day out in them  an I'm very happy.  Only had a couple small small rocks get  inside.  Looking  forward to seeing how long they last.\n"}
{"text": "Love these water shoes. I wish i would have got them earlier.\n"}
{"text": "The 1/2 size made the fit perfect!!!\n"}
{"text": "The shoes were fine but the delivery was really off they kept saying it would be deliver in a day and it took a week to get here\n"}
{"text": "Super comfortable and lightweight water shoes.  I would, however, order at least a size larger, especially if you have wide feet. Great buy for the price.\n"}
{"text": "Very comfy and stay on foot in water\n"}
{"text": "Love them!!!!!!!  My husband loves his too!!!\n"}
{"text": "These water shoes seem to be a better quality than most.\n"}
{"text": "High quality\n"}
{"text": "I am very happy with these shoes not only do they dry quickly they also are comfortable and no sand seems to get in just the water\n"}
{"text": "Fit nicely and are lightweight that I can carry in my gym bag. Ive used these to go to the beach, to work out at the gym, and inside the house. Im very satisfied with these\n"}
{"text": "Shoes are light but with good non slip soles and stay on comfortably when i lake swim. I haven't had these long enough to know how they'll hold up.\n"}
{"text": "Good\n"}
{"text": "I bought these for the lake. Havent been to lake since. Wore them all day around house. Very comfortable.\n"}
{"text": "Easy on and off. Protected my feet at the water park and in the rivers of the National Parks.\n"}
{"text": "Great quality\n"}
{"text": "The first time I used these, the laces track came off. I was on vacation so I had to use them broken!! Cheaply made\n"}
{"text": "I like how it forms to the foot. It's comfortable and stylish and I have gotten several compliments when wearing them out and about. But I have several complaints: I had gotten a half size larger and that fit perfectly, the fabric on the surface holds in all of the heat from the foot causing sweaty and stinky feet, and worse of all, after wearing them for 2 months, they have holes on the tops of the shoe where my toes are. I do keep my nails well trimmed.\n"}
{"text": "I got these for kayaking because of the wrap around rubber sole, and the pull-tight laces to keep them on in the event I fall into the ocean.  They perform exceptionally well, and a nice surprise is that I did not get any sand in my shoes while walking the kayak across the deep sand to launch -- the pull-tight laces created a great seal around the ankle.\n"}
{"text": "These shoes are great. I wouldn't suggest them for anything like running because they don't have much of a sole. But for just hanging out at the lake or being in the water they are amazing. They really excel as river float shoes. I don't spend a ton of time in the raft when we float I am typically walking beside the raft in the water and these shoes don't create any extra drag on your feet like you would have with flip flops or real shoes. They also never slip off or move around.\n"}
{"text": "Bought these water shoes for my trip to the Dominican Republic. Omg, let me tell you, these are the best! Ive had several water shoes over the years and these are awesome! I have narrow feet and other standard water shoes squeeze my feet and sand gets in. Not with these! Super comfortable, I wore them all day at an excursion park where I was in and out of the water, zip-lined, and rock climbed and my feet were so comfortable all day!!!! I also love how the rubber comes up and protects the toes.  Cannot say enough good things about these water shoes!\n"}
{"text": "I am a 37.5 and the size 38 fit me just nice, as expected. The shoes are comfortable and the bottom feels grippy. The material is flexible and seems breathable. Laces can be tightened and loosened based on your instep. The design (I got the black ones) look understated enough, although they do still have a very unmistakably watershoes look, if you know what I mean. I bought these for my upcoming yellowstone trip, where I can hopefully test this product fully. Will update my review after the trip!\n"}
{"text": "It is very comforting and looks pretty good. I wasn't able to swim to well with them on, but not to bad. Did a fair job at keeping the sand out at the beach but I was satisfied with their performance.\n"}
{"text": "These water shoes look great, are super comfortable, easy to get on / off, easy to tighten in case.  They fit well for wide feet too - i have wide feet and wear 7.5 Wide sneakers in general and these kept my toes comfortable.  I wear these on rain days and my feet don't slip like when i wear flip flops, as well as for going to/ from gym (we do our kickboxing barefoot).\n"}
{"text": "I like these shoes a lot.  The only complaint, 1-star's worth, is that they run about 1/2-smaller than advertised.  I generally wear 12.5-13 sized US shoes.  I ordered the Wmns 15/Mens 13 shoe and they are snug - as in no wiggle room and my toes are right at the end.  Calling that out in the description would have been nice.  I might get another pair in the next size up just to see if I like the fit better...the product is that good.  Comfortable footbed, breathes, easy enough to get into and out of.\n"}
{"text": "I bought these shoes to get better traction during water aerobics workouts and because my old shoes would not stay on or drain properly.  These shoes are great!  They are not super easy to get on but they stay on and adjust to the correct width.  I have narrow feet.  These shoes are very comfortable with plenty of toe room and great support and cushion.  I will buy them again.\n"}
{"text": "My son went camping on a week long trip, he told me the sole separated on both shoes while swimming on the first day of use.\n"}
{"text": "I like them, Im a size 10.5 and ordered 11, they fit great\n"}
{"text": "Bought these water shoes for my teenage son for a trip to the Bahamas this summer.  Haven't used them in the water yet, but he said they were very comfortable to wear, and should give him good traction on rocks.  Seem like they will hold up well, and aren't flimsy at all. A bit larger than expected, but still fit.\n"}
{"text": "These shoes work out well for walking down to the neighborhood pool and/or washing your vehicles. I would not recommend doing yard work in them as they offer very little protection.\n"}
{"text": "Very good water shoe! I wasn't expecting a whole lot because of the price being in the middle. But these are great. The insoles have holes that filter the sand so your not walking around in it. They fit great. Very well made.\n"}
{"text": "Great fit n better than any water shoe I've seen. Bought a second pair.\n"}
{"text": "NICE PAIR OF SHOES. WORE THEM BOATING. THEY HAD A GOOD GRIP WHILE WET AND WERE VERY COMFORTABLE. WOULD DEFINITELY BUY AGAIN!!!\n"}
{"text": "I used these on my latest charter fishing trip and they were great.  Felt great, nonslip. I'm happy with them.\n"}
{"text": "Cute. Comfortable. Great value for the price. Use them to go kayaking in.\n"}
{"text": "Just got back from the first trip and they were good. The only thing was I'm a size 13 and I should have gotten a size 14. They're a little snug but not to the point of pain. Felt great standing and walking and didn't slip any.\n"}
{"text": "Wear while kayaking, comfortable, easy to put on feet.\n"}
{"text": "Great product for little $\n"}
{"text": "love the color\n"}
{"text": "Good fit and good quality\n"}
{"text": "Size is smaller than expected\n"}
{"text": "Good product\n"}
{"text": "perfect for my trip to florida! very comfortable!\n"}
{"text": "Nice tight fit and lightweight love the shoes\n"}
{"text": "Fits as expected suited us at the water park well\n"}
{"text": "Great fit and really comfortable\n"}
{"text": "They are just perfect for the purpose. Not too confortable to use it other than the water but is works great for ocean and rivers.\n"}
{"text": "Muy bueno\n"}
{"text": "Hes likes them a lot and fits perfectly\n"}
{"text": "Perfect for for my daughter and great quality. Sizing was a little different though\n"}
{"text": "Size isnt true to fit. They run about a half a size too big\n"}
{"text": "My husband loved them. Very comfortable. He wears 10 1/2 Wide so we ordered a half size up 11. The water shoes fit perfect and true to size. We highly recommend!\n"}
{"text": "Love these for the river\n"}
{"text": "Nice color, looks great. Fit is about a half a size bigger than anticipated but not enough to complain.\n"}
{"text": "I brought the shoes for myself when they came to the house they look very nice a little to girly for me so I gave them to my wife she loved them a big hit:)\n"}
{"text": "I love these water shoes. I used them this summer on a cruise and trip to the islands. The soles are very solid and comfortable\n"}
{"text": "I love the shoes...I wear a 9 1/2 so I ordered a 10 and they were to big I should have bought a 9 they would have been a closer fit...they have excellent grip for being on rocks in the water...all around good water shoes they just run big\n"}
{"text": "After buying water shoes myself, I bought these for my husband as they looked trendy and had good reviews. I ordered these shoes in my husbands normal shoe size and fit perfectly and will be a little bit snug when wet I guess, which is what I wanted. They look well made and Im happy with my purchase.\n"}
{"text": "I love these shoes. I've actually ordered several other colors. They are super comfy and the product description is accurate. One thing I will note. I am not a reviewer. I just buy and go. But in this case I did feel a need to leave some insight into this company. As I mentioned, I love these shoes. Unfortunately, so did my 11 week old puppy. He chewed one of the draw strings off and it could not be salvaged. I emailed the company and they were willing to send me a new set of laces at no charge. That is just awesome in my book. Sure, a great product is what we as consumers are after, but to have the company back that product, even through no fault of their own, is what will keep my business.\n"}
{"text": "one week got fishing hook in foot at the lake... next week bought these and no injuries. So many reviews on feeling like sandpaper, as soon as submerged they feel almost like light weight flip flops. Bought 4 pairs for whole family and not a single complaint about fit, comfort or anything. Wife mentioned uncomfortable on ankle but normal with any new footwear for her\n"}
{"text": "Took the shoes to San Luis Potos for a vacation of outdoor activities. We water raft, rappelled from cliffs, hiked and these shoes were EVERYTHING. Excess water was released from the bottom vents, they were snug and resilient. Totally worth every dollar. Good grip and the shoes did the job!\n"}
{"text": "I bought them for a spare pair of shoes. They are made in China (but what isn't). They are very comfortable and almost feel you don't even have them on. Walking in them also feels like they are not there. When we can get back to going out camping I will be able to try them out for what they are made for. They were a little hard for me to put on but once they were there wow. The only reason of the 4 star is where they are not made.\n"}
{"text": "These water shoes fit true to size and are quite comfortable.  The only reason I am giving 4 stars instead of 5 is that I like to ride me bike after swimming, and the bottoms are a little thin for hard riding.  They are fine for normal use.  Overall, a solid purchase.\n"}
{"text": "I didn't expect much of these and was planning to use it as almost disposable pair of shoes for my treks in Indonesia that involved walking through waterfalls. This pair I bought of my girlfriend and she loved the fit. They are pretty grippy and fit very comfortably. We used it on dry hikes as well on a extremely steep decline and it did pretty well. Very lightweight, so it's easy to pack up into the bag.\n"}
{"text": "I've used these for several weeks now.  Initially one shoe irritated the back of my foot rubbing too much at the top edge of the shoe.  I wore them with socks for about a week and I think they stretched out just enough that I'm comfortable wearing them bare foot. As mentioned these are great protection for your feet walking on a beach that has a lot of shells (or small stone).  Importantly they're also tight enough they do a good job keeping the sand out of the shoe while walking.\n"}
{"text": "Loved these water shoes! If you're using these for river walking, compared to a much more expensive pair that I have these are better for light use. Recently kayaked and camped in utah, the river had small pea gravel, some mucky areas and sand. These preformed well and didn't end up loose when wet. They pack away small and are easy to slip on when needed. If you plan to walk in murky water with larger and/or slippery rocks these will not be sturdy enough.\n"}
{"text": "Pretty decent quality,  the one problem that brought my rating to a 3 star is the toe area. The rubber cap that comes up over the toe folds down enough that it is some what of an irritation. Minimal problem for otherwise a great water shoe.\n"}
{"text": "This product fits great and very comfortable. I have already recommended these to others.\n"}
{"text": "Very comfortable. Best water shoes I have ever owned, thus far Buying! I am purchasing another pair just to wear daily.\n"}
{"text": "Super comfortable, nice and stretchy and flexible\n"}
{"text": "They were excellent for walking on the barnacles and mussel shells on the shore launching the kayaks...but left my heals black for almost a week.\n"}
{"text": "Great shoes.. A bit snug.. Maybe that's supposed to be like that. I'll only be using them in water.. Recommend 1/2 size up for walk around shoes.\n"}
{"text": "Purchased two pairs for lake activities. Cant even walk on top of tiny rocks these shoes are so thin and hurt sooooo bad !!!!!\n"}
{"text": "Very light and fix accuratly\n"}
{"text": "Its comfortable but kinda irritates around the ankle if too tight\n"}
{"text": "Very odd product.Too large at foot too small at upper opening.\n"}
{"text": "Both my husband and I got a pair of these water shoes and were very pleased with the fit.  I would highly recommend this product.\n"}
{"text": "Great for the price!! Works perfect for the lakes and rivers with rocks that hate you.\n"}
{"text": "GREAT SHOES I use them in the gym & theyve held up through some vigorous workouts over the last few weeks. @ the price point these shoes are a must have its like walking barefoot. I had a pair of $100.00+ Vibrams & these hold up to them.\n"}
{"text": "I will not go out on my lake on. paddleboard or kayak without these shoes.  Happy with the fit and quality.\n"}
{"text": "A little too roomy. I ended up with a blister on the back of my foot. Used them for hiking, no slipping or falling so that was great.\n"}
{"text": "Ultra light and washable. Good for walking around at home and on the beach.\n"}
{"text": "It isn't quite as comfortable as I would like. After 2 hours I noticed I was getting a blister. But not bad.\n"}
{"text": "Bought these for vacation and they are very comfortable and seem to drain easy\n"}
{"text": "I like the price point, and hoped the soul rubber that went up the sides would last. But after just TWO WEEKS of use, it started to separate from the cloth! In another couple of uses, they'll be toast!\n"}
{"text": "Very comfortable and functional. Used as walking around shoes for a weekend of diving and light packing.\n"}
{"text": "Great product well made comfortable,  good grip I wear size 11.5 to 12 in shoes . The size 12 fit perfectly. Thanks again\n"}
{"text": "Sper cmodo.\n"}
{"text": "I like the rubber sole on the bottom, some have just heavy material, and  you feel every little stone or whate ever surface you are waklking on.\n"}
{"text": "great in the water\n"}
{"text": "Light weight and sturdy\n"}
{"text": "Fits like a glove\n"}
{"text": "Comfortable shoes\n"}
{"text": "Very happy with this product\n"}
{"text": "Healed up great during our trip.\n"}
{"text": "Great in and out of the water . light weight and comfortable . Love them when im kayaking .\n"}
{"text": "Takes a few minutes to get them on. I will only be using them for a lake while on vacation.\n"}
{"text": "Really nice!\n"}
{"text": "Like that they fit snuggly as I have narrow feet\n"}
{"text": "Bright color and comfortable fit. Easy to adjust and put on and off. Keeps the feet protected\n"}
{"text": "I don't have much to add to that headline. I bought these before a 4-day rafting trip this summer, and I wore them the entire time we were on the water, including when I would jump into the river for a quick swim. They fit as expected and never came loose even once.\n"}
{"text": "How friggin cute are these? I love them. They fit greatand feel super comfy. Best pair of water shoes I own\n"}
{"text": "Muy bonitos los zapatos y muy buena calidad. Lo que si recomiendo es pedirla una talla por encima, ya que yo soy 9 1/2, lo pedi 10, y mr quedaron justos. Pero los recomiendo\n"}
{"text": "Comfortable and nice fit\n"}
{"text": "I found the fit too tight, size 43.  Also, Id be surprised if they lasted beyond one season of beach wear.\n"}
{"text": "Actividades deportivas acuticas, excelente producto.\n"}
{"text": "They work very well but they fit a little large.\n"}
{"text": "I bought these last minute on a trip to Maine.  They were excellent for walks on rocky beaches, stand-up paddle boards, and kayaking.  I would definitely recommend!\n"}
{"text": "I bought these for floating down the river. The rubber soles hold up to the sharp rocks really well. Comfortable and fits snug, so you dont think youre gonna lose them in the water.\n"}
{"text": "Shoe Comfort  Perfect Fit  Great For Short Runs, Workouts & Everyday Activities \n"}
{"text": "They are huge. They should have womens shoes separately from mens. I returned them\n"}
{"text": "Great product\n"}
{"text": "These are amazing in the right size! Makes walking through adverse waters and and even dry land a breeze, the bottom has good grip and protection and they are fairly lightweight\n"}
{"text": "Very comfortable. Nice fit and IMO better looking than speedos\n"}
{"text": "These are light, comfortable, and roomy. The bottom seems well made and protective.\n"}
{"text": "These are some really sweet kicks. Can hardly tell you have anything on your feet. Perfect for getting wet.\n"}
{"text": "These fit great and allowed me to trek down the mighty Ausable river in my tube in comfort.\n"}
{"text": "Like it , very comfortable\n"}
{"text": "The material was thinner than expected and ran small for size stated.\n"}
{"text": "Queda como se esperaba\n"}
{"text": "I haven't used the shoes yet.  I ordered a size 8.  They are a tad bit to big for me.  I don't think it's the sizing.  Just my foot.  So far so good.\n"}
{"text": "Super comfy and fit just like most of my other 9s. Can't wait to go out and kayak in them! Will review again once they hit water.\n"}
{"text": "Live by the beach and often like to walk along the shore. Great water shoe fits well and doesnt let in small stones. Very comfortable. I really like these.\n"}
{"text": "I wear a womans shoe 7.5 which is what I ordered. I received Euro 39. They fit perfect. Snug liike a sock.\n"}
{"text": "Good fit,  Feels good.\n"}
{"text": "Look good, fit well.\n"}
{"text": "Fits nicely. I love that you can pull out the sole insert to shake out all the sand and then put it back in. Only complaint is that the area inside of the shoe where your heel rests, is rough. It rubs up against your heel taking skin.\n"}
{"text": "Light comfortable and easy, slip on and go\n"}
{"text": "Great product for the money. Comfortable and durable. Worth the money\n"}
{"text": "Very comfortable,  my husband has a wide foot so it was a little hard to get on, once on the fit was good.  Worked great for cruise and a dolphin encounter.\n"}
{"text": "Son excelentes, se ajustan muy bien y muy cmodos\n"}
{"text": "Excellent shoe for the price. I use these for river floating. They have been fantastic and good quality.\n"}
{"text": "Poor quality, the insoles came out the second day on vacation. Hurt my feet as well.\n"}
{"text": "Feels good\n"}
{"text": "Comfortable and durable. Tightening strap is a great feature.\n"}
{"text": "I love the water shoes, we had to walk before using them in the water and they are so comfortable.  They look great and feel good walking in sand or swimming in the water.  Great purchase!\n"}
{"text": "As a dental hygienist, these are my work shoes. They are only worn in the office and I love them! And so do others! The colour which was the navy matches my scrubs perfectly and the shoe is comfortable and chic in my eyessmile\n"}
{"text": "Needed a size 13 in this shoe.  Size 12 and my toe jammed through the tip.  Other than that - nice product.  Will update if necessary after my trip.\n"}
{"text": "I used this shoe as my jogging shoe. My feet get really hot when I run and with this shoe my feet could breath and I ran with no problems! Will be trying on water soon!\n"}
{"text": "Para deportes y travesas en zona humeda\n"}
{"text": "Great, I watched a lot and decided to buy it at this shop.It didn't disappoint me.  The shoes are very soft and the feet are very comfortable.  I can play with water, it's cool.  Recommended purchase\n"}
{"text": "Flimsy, no support, way too small even at size 11\n"}
{"text": "perfect\n"}
{"text": "Superb. Feels so good, when u where it.\n"}
{"text": "Extremely comfortable and great quality\n"}
{"text": "Perfect fit\n"}
{"text": "these are very comfortable, light weight, great to use in water, if you have sensitive feet you can still feel rocks while walking across them, but they are great shoes! going to buy another pair!\n"}
{"text": "Everything as expected, but they are very difficult to clean once the sand gets in.\n"}
{"text": "Comfortable water shoes and fit as expected. These will be great this summer for the beach and creeking.\n"}
{"text": "Great  exactly what I needed \n"}
{"text": "Go a shoe sized bigger then youre regular shoe sizes\n"}
{"text": "Great for rocky water. No slips, kept my feet protected.\n"}
{"text": "Left pair shoe was not sew properly.very uncomfortable\n"}
{"text": "I love my water shoes I love the design they are very comfortable and I would definitely buy them again\n"}
{"text": "Purchased for my grandson for our family camping trip. Fit well, have durable sole for traction on slippery and jagged rocks in the river and swim areas. Lightweight. Good quality.\n"}
{"text": "They were perfect. I ordered these for a cruise. I was able to wear them around the ship and even on excursions. I worn them on a ATV, Dune buggy and walking around while shopping. Highly highly recommend these.\n"}
{"text": "Great fitment, feel good on feet, I like they lay flat when not used. They form fit your feet and toes!\n"}
{"text": "They fit just a little larger, but not enough to worry about. First time buying shoes like this, so they feel a little odd being worn. Haven't tested their water capacity yet. Overall, not bad so far.\n"}
{"text": "Fit perfectly for my size 9 feet.\n"}
{"text": "This shoe works great with any water sport. They are very comfortable and clean up easy. The shoes are nonslip and dry quickly so your feet are not wet for the whole day.\n"}
{"text": "The first watershoe Ive ever got that fit perfect. Great for rivers and streams where hiking is the best part. Im gonna order a second pair for future uses.\n"}
{"text": "These shoes are so flexible that you almost believe you are barefoot.  Not what I was looking for in a beach shoe.\n"}
{"text": "I got a size 10, but needed a 10 1/2. They are snug, but I like the style and feel of them\n"}
{"text": "Its ok. Not extremely comfortable. Makes your feet sweaty.\n"}
{"text": "Hubby was very comfortable in them we used them at dorney park\n"}
{"text": "Great water shoes for price!\n"}
{"text": "Extremely comfortable right out of the box.  I'd say they run a half size bigger than typical US sizes.\n"}
{"text": "I love these shoes I wear a 9.5 mens they fit perfect\n"}
{"text": "for the price paid its a very good quality. Best than all water shoes i have ever bought\n"}
{"text": "I was very pleased with the product! They were very comfortable and I had them on for 9hrs at a water park!\n"}
{"text": "Will be returning: Received WET and and appeared to be used Disappointed!\n"}
{"text": "Love'em; would reorder.\n"}
{"text": "Broken first day... the stitching holding the laces came up after 2 hours in ocean. Luckily it doesnt matter as the water shoes still stay on. But to come apart on day one is crappy.\n"}
{"text": "Super!\n"}
{"text": "Purchased for fishing off the rocks at the beach and they work great.  Fit and quality are better than expected.\n"}
{"text": "Great shoes for the money. Wore them all day at the inlet and they were way more comfortable than expected walking the jetty all day. Bought to use for the kayak and will definitely be useful on those all day trips.\n"}
{"text": "Size is too big, by at least a full shoe size. Ordered US 10, but its 281 MM or eur 44, which, Also says XXL.\n"}
{"text": "Perfectly sized and greatly comfortable. Hell, I even wear them around the house and outdoors doing chores!\n"}
{"text": "The shoe looks good, great fit. The only problem was that ink came out while it got wet. I would suggest washing it before wearing it first.\n"}
{"text": "I ordered a size 9.5.  Received today and could barely get the shoe on.  Inside the shoe has size as: 43, and bag label shows size XXL.  No, I do not have fat feet.\n"}
{"text": "My husband wears it all the time...even when its not to the mountains...\n"}
{"text": "Perfect fit, true to size and well made ...my son absolutely loves them!\n"}
{"text": "Seem really great shoes fit perfect definitely going to need to wear socks with them\n"}
{"text": "I got the pink ones, very cool looking, can't wait to wear them on my honeymoon when we go snorkeling and stuff. I walked around in them and they are very comfortable with great support.\n"}
{"text": "Very happy! Best water shoes I've ever had. I swim around a lot of zebra mussels, no problem at all and I know I've stood on them. Great traction. They look cool too.\n"}
{"text": "Feel great looks great!!\n"}
{"text": "best\n"}
{"text": "These water shoes fit very comfortablly on your foot. The water drains easily and they dried very quick. I was a little worried about how much water would drain out but there was nothing in there when I took my shoes off. I've worn them twice so far, once at the beach and the other time to go walking when it was raining out. Both times my feet felt comfortable and did not cause any blisters or irritation.\n"}
{"text": "Everyone has pretty much nailed it with these kayaking, hiking, fishing, and what other other adventure you can imagine. These aqua shoes are absolutely amazing and this is my second pair. I figured I'd post a picture with the rainbow since everything else has been pretty much covered. LOL. Don't second-guess these shoes. Just buy them. I just ordered my son his own pair because he got sick of listening to me talk about how comfortable they are.\n"}
{"text": "These shoes saved my hiking & camping trip. My hiking boots were a bad fit and busted up my feet to the point of being unwalkable. I switched to these and they carried me home. I added a layer of socks to be safe and they stretched enough to support. 15+ miles hiking with 45lb pack. Completely comfortable, while rugged enough for the terrain and weight. If I lost these I'd buy them again immediately. Very impressed and grateful.\n"}
{"text": "I am a kayaker and always have trouble with gravel in my shoes. This shoe keeps gravel out. Some sand gets in but can wear all day and no rocks. Only con is your feet are wet all day in these shoes. They dont dry when on your feet. If you take them off they dry fast.\n"}
{"text": "I am a size 11 and the 44 XXLG fits perfect! These are really nice water shoes, its like a glove for your feet. I was hoping they would be ok, but these really are better than expected, theyre super flexible and have great tread and traction, theyre fun just wearing around the house, super light weight and comfortable.\n"}
{"text": "These shoes are extremely comfortable, but after using them for two days at the river the shoelace and rubber fell off my right foot. It's not a real big deal because my shoe still never came off in the water. Definitely more comfortable than the other pair I had. They just need to use better waterproof thread for shoestring. My son also has a pair and his held up just fine. So maybe it's a hit or miss with these shoes\n"}
{"text": "Bought these to a trip to DR. Wore them for a solid 8hrs while zip lining, jumping in the Hoyo Azul and a bunch of other water sports and they were comfy and held up well. Wore them to the beach the next day because Im a princess and I cant step in seaweed bec its gross and again, zero problems. Still seem functional for the next beach trip.\n"}
{"text": "Great water shoes for a day at the waterpark. Wore all day at Holiday world. Feet got sore after a while but thats expected for walking on concrete all day in thin soles shoes. Held up great. More comfortable than others Ive tried in the past.\n"}
{"text": "I got these for my trip to Hawaii (Oahu and Maui) so I made sure to walk in them a little prior to the trip. They fit really well and are completely comfortable. Make sure your foot is completely inside, with your heal fully seated. (Why risk heal blisters).\n"}
{"text": "Husband loves! He's an arborist, and when he's not in work boots these are his go to every day shoes. These were bought for a camping trip... Oddly we have bought Merrill barefoot shoes and they were not as comdortable... HOWEVER one thing that I'm not impressed by is, these do NOT have holes to drain water like they state... A big plus, is that they are real rubber with great traction.\n"}
{"text": "The husband did not complain so all is good\n"}
{"text": "Very great river shoes\n"}
{"text": "Use them every day at the gym for showering good quality I would buy another pair.\n"}
{"text": "Fit and feel good\n"}
{"text": "Estn cmodos para caminar y andar en el agua\n"}
{"text": "Very comfy, stylish and sturdy. Highly recommend\n"}
{"text": "Product was good we bought them for Cancun only issue We had with them was the back kept cutting back of the ankle.\n"}
{"text": "Love them, use them kyaking and swimming in lakes. They fit me pretty accurate for sizing.\n"}
{"text": "Very comfortable. I,m 12 1/2 so got a 13.  Seem to be well made.\n"}
{"text": "Yes\n"}
{"text": "Perfect for fishing\n"}
{"text": "Order this product got the next size bigger from my original size and fit like a glove comfortably lite worth it\n"}
{"text": "Nice for the price\n"}
{"text": "Excelente producto\n"}
{"text": "AMAZING AND SUPER CUTE! Used these to go floating. I didnt feel any rocks from the river. Super comfortable and durable. HIGH RECOMMENDED!\n"}
{"text": "Decent water shoe for warm days\n"}
{"text": "didn't last a week at the beach\n"}
{"text": "Great shoes for the water park.  But dont expect to walk in these things.\n"}
{"text": "So far I like them. Very comfortable.\n"}
{"text": "SEEMS TO FIT SMALL.  i ORDERED 1 SIZE LARGER AND STILL THEY ARE TIGHT\n"}
{"text": "Bought these for work on a research boat in the Gulf of Mexico. Very comfortable and hold up on the boat, the only downside is that they dye my feet blue every time I wear them.\n"}
{"text": "Love this shoe.  Use it at the beach\n"}
{"text": "Used these at Slide Rock State Park near Sedona, AZ.  They definitely help protect your feet from gravel & the heat while climbing/hiking to each level of Slide Rock.\n"}
{"text": "Bought for my husband for camoimg on the lake. He seldom takes them off. So comfortable!\n"}
{"text": "It feels great in your feet. It is Extremely comfortable and looks like it has a durable quality. To be honest, this product runs a little big, but that isn't a big deal. I'm very happy with these shoes and I strongly recommended.\n"}
{"text": "Very comfortable!  Look forward to using them on a cruise excursions (snorkeling, kayaking and hiking\n"}
{"text": "Love these for vacation and beaches\n"}
{"text": "The product arrived early, and fits as expected. The material is comfortable and soft. This is a good deal!\n"}
{"text": "Bought for a trip to Oahu, Hawaii and they worked great on the rocky beaches!! Held up great and protected my feet very well!!\n"}
{"text": "Fit true to size and shoes work as advertised\n"}
{"text": "I just got this pair and out of the bag they look like they are going to tear up at the toe. They are put together by a bunch of glue and the mesh looks like its ripping apart and I haven't even used them. Look at my pick they are already falling apart with out a single wear.Guess you get what you pay for.\n"}
{"text": "Bought for my fianc to wear at the lake. He loves them and I didnt think that he was going to take them off.\n"}
{"text": "My mother absolutely loves these! She said they fit perfect and look amazing\n"}
{"text": "These water shoes are well made but a bit too small and tight for me...\n"}
{"text": "Love my new shoes for the lake will keep my feet from getting cut up the size 8 was slightly to big on my foot but shouldnt be a problem .  The look is nice with any suits may wear.\n"}
{"text": "Nice water shoes I like it a lot!\n"}
{"text": "Very comfortable and not only for water shoes, still great to wear as an everyday shoe, as well.\n"}
{"text": "These shoes are comfortable and do the job...\n"}
{"text": "A bit too small,  but very cool and comfortable this summer.\n"}
{"text": "Works as described and pretty comfy\n"}
{"text": "Si, muy bueno\n"}
{"text": "Very comfortable, fit true to size.\n"}
{"text": "I was really happy with the comfort and they fit great. Looking to buy a pair for my whole family.\n"}
{"text": "Casual cute comfy\n"}
{"text": "Comfortable, well built, removable innersole and good fit.\n"}
{"text": "Fits good great fishing shoes\n"}
{"text": "Fits good\n"}
{"text": "Fit great went to Aruba they were great in the ocean. Very comfortable\n"}
{"text": "i like the shoe alot, after the summer ill be able to see how durable the soles are. they fit snug which is good because i will be in the water with them at times\n"}
{"text": "Good Fit and comfortable on my feet.\n"}
{"text": "Just what I need it for Lake shoes in river shoes will buy another pair once these wear out.\n"}
{"text": "Hubby didn't try them on as soon as the order arrived. Unfortunately when he needed to use them the right shoe fit just fine, but the left was difficult to get on, and it was cramped and scrunched the whole day. it wasn't until they were washed and dried and my daughter tried them on, with the same issue. Turns out they're two different sizes!!\n"}
{"text": "i love these shoes! i wear a size 8 and ordered a size 8 and they fit perfectly! they are so comfortable and are perfect for walking in water.\n"}
{"text": "The water shoe fits very well and is light on the feet. The pull-string also makes it easy to get the shoe on and off.\n"}
{"text": "Maybe its just my feet but they feel scratchy to the tops of my feet. So that makes me not want to wear them but I need some protection on my feet when I use them to kayak.\n"}
{"text": "It fits well. Looking forward to wearing when I go to Galapagos in June\n"}
{"text": "My boyfriend loves these shoes while on the river.  There are a lot of rocks and rough terrain.  They dont slip & fit as expected.\n"}
{"text": "Very lightweight and comfortable. Good for travel too.  I like these so much Im buying a second pair.  Theyre not just water shoes I wear then all day\n"}
{"text": "If you get the right size, these shoes are like having form fitting gloves for your feet.  You wouldn't want to wear these in a hard-hat zone, but where appropriate the are exceptionally comfy.\n"}
{"text": "My boyfriend wore on our cruise to Mexico numerous times. They were SO comfortable. The company told the truth. Great I and out of water. I will get my boyfriend another pair.\n"}
{"text": "The shoes are awesome but for the first time ever, shoes that I ordered online are too big. I always wear a 14 so that's what I ordered and they are definitely the size of a 15. Had to return and order a smaller size. Just make sure if you are buying this product you buy one size smaller than you normally wear\n"}
{"text": "UBFEN water shoe really fit my wife well and we used it for boating\n"}
{"text": "Purchased these for surfing to protect my feet. Only thing that sucked was the San which lets face it. . . Nothing can help the places sand finds its way into. .\n"}
{"text": "Sole was thick enough to walk on gravel.  Cinch up tight to keep out debris.\n"}
{"text": "Fits on the smaller side these were perfect for water hiking. Recommended to anyone who needs this weird looking shoe!\n"}
{"text": "I have only tried on these water shoes and walked around the house. They fit good and seem comfortable enough for what they are.\n"}
{"text": "These are great.  I was looking for a shoe which would not accumulate sand around my foot.  These are the ones! Addendum: I have now had these for a year and still love them. No problems and they are holding up well in intense sun and ocean salt exposure.\n"}
{"text": "I am a size 10 ordered a size 10. They fit snug all around but I dont want them sloppy in the rough river water. Ive seen to many shoes floating down stream. Next time I might get a 1/2 size up.\n"}
{"text": "The manufacture size 6 online says is US size 8 but is not. At arrival, lable on shoe says US size was 6. Returned time was excellent, quick refund. Re-ordered in size 8 to see how it fits.\n"}
{"text": "I bought this 1size bigger and it fits perfectly. I bought the one my size and bc 2ns toe is a little bit longer it was very uncomfortable-the bigger size is perfect and really comfortable to wear.\n"}
{"text": "I needed shoes for stand up paddleboarding, getting on and off the board. These fit fine but the insole wasn't very comfortable. And you can see the glue near top of toes. Haven't tried them at the beach yet.\n"}
{"text": "I bought these for the beach and let me tell you they were wonderful. I wore them on beach in water and around the rental house we had. They are great for the price and I am going to buy another pair for a backup.\n"}
{"text": "First time wear the shoes my ankle got injured due to tightness of the shoes around ankle. and It is not easy to put it on.\n"}
{"text": "Caregiver shower assistance, I like these because they don't slip when I'm lifting on a slick surface... but the insoles smelled right away, so I threw them out. Now I have two pairs so one set can dry.\n"}
{"text": "True to size Im a 7 in Nike / adidas / puma / vans and ordered 7 dont know how the hold up on water but pretty good for price . Im sure they wont last years but definitely a good buy z\n"}
{"text": "I bought two pair for my son and myself. Both fit well and looked great. Seems fairly well made and feels comfortable.\n"}
{"text": "Minus 1 star because they are 1 size too big and minus 1 star because the drain holes in the bottom of the shoe are not drilled out.  I'll keep them but only because I really need them in a few days for vacation.  even though they are 1 size too big I can still wear them ok. I'll also drill the holes out myself.... hoping I don't damage them doing this.\n"}
{"text": "So cute even with a swimsuit. Very comfortable like being barefoot almost. The only thing I didnt like was the inside top by the heel was uncomfortable and will probably rub a blister when wearing for a longer period of time. Planning on putting a bandaid on for that.\n"}
{"text": "Love the shoes itself, fit is exactly what I usually wear and extremely comfortable. Very good quality and breathable. The only reason I gave 4 stars is because the triangle tab above the laces (used to pull shoe on) cuts into my leg a bit. Also I love that they have so many colors and styles to choose from. Definitely recommend purchasing this item.\n"}
{"text": "It's very good water shoes. It works what it suppose to do. Also, it is very stylish and comfortable.  I recommend this product.\n"}
{"text": "Great\n"}
{"text": "Bought size 14 (XXXXL) and it barely fits. My sons toes were touching the tip. Unfortunately theres no larger size. Otherwise, its lightweight and seems sturdy enough for walking in the water.\n"}
{"text": "Great water shoe for gym Promt delivery\n"}
{"text": "Bueno\n"}
{"text": "A little tight to get on, but felt great\n"}
{"text": "Product is as expected\n"}
{"text": "I'm currently at the water park and within the first hour they broke. It has not been a good experience. I threw them right in the garbage and had to buy an expensive pair at the park to get me through the day. Extremely disappointed\n"}
{"text": "Comfortable\n"}
{"text": "I ordered these to take on a trip where I plan to wade in water. The fit is good. They feel good. I'm hoping they hold up well. They look like they will.\n"}
{"text": "These water shoes are amazing. Theyre so comfortable you could wear them all the time. They do feel a bit snug, but still wearable. If i buy again i might size up. Otherwise theyre awesome.\n"}
{"text": "Got these for husband for our vacation,  he said they are extremely comfortable.\n"}
{"text": "Great quality and super cute!\n"}
{"text": "I bought them for a cruise, but haven't used them yet. The fit is perfect, very comfortable. Would reccomend.\n"}
{"text": "They look good\n"}
{"text": "Super comfortable and cute. For just right better than I expected\n"}
{"text": "Great for kayaking\n"}
{"text": "This water shoes were great, they hold on tight and they dont fall off. They have good grip, feel comfortable and look great. Totally recommend.\n"}
{"text": "Wish it covered my ankle more but other than that they're pretty good\n"}
{"text": "Buen producto; sirve para los fines esperados.\n"}
{"text": "Great water shoes! Soles are thick enough that rocks dont affect your feet. Quick drying as well\n"}
{"text": "Perfect fit amazing comfort and able to withstand hiking conditions\n"}
{"text": "Nice but European sizes.... Ordered the 10 for my husband and they were huge on him!\n"}
{"text": "Worked really well in rugged terrain,  I definitely recommend this item.\n"}
{"text": "good so far\n"}
{"text": "They are light, flexible, and comfortable. I'll buy again.\n"}
{"text": "Its good. Especially if youre on location of sea side or water side.\n"}
{"text": "Pretty good\n"}
{"text": "Great water shoes. I would definitely recommend them. I took them on my vacation trip to Cabo and they were perfect. They did not rip or tear like other water shoes I bought in the past and they are really comfortable\n"}
{"text": "Great water shoe\n"}
{"text": "wear them for 5m power walking on the beach with no socks. Real comfortable! The arthritis in my toes feels much better than in sneakers.\n"}
