{"text": "Better than expected.  I needed an inexpensive grow light that would bring light to all the plants in my plant stand. This light does just that! What I found even more remarkable is that a few days later one of my rare plants put out a leaf (third picture). This is a plant that had not  pushed out any leaves for months since i purchased it. One of my other rare plants a Philodendron has had great growth. This plant had also barely grown in spite of getting natural light and fertilizer. I am happy with this light overall for the price. I leave it on all night and turn it off in the morning.\n"}
{"text": "This plant grow light has exceeded my expectations!! Perfect growing light. My indoor plants have been thriving. Its so easy to install & it doesnt take up much space at all. You can adjust it to your plant sizes, tall or short, as well as adjust the necks of the lights! Your plants will love this light & you! Its a must buy!!\n"}
{"text": "This is a great light . It is awesome for growing some herbs indoor or smaller plants like lettuce leaves. You can't grow a full gargen or large veggies very well indoors but since I didin't do a fall garden I was missing my fresh herbs and this has really helped.\n"}
{"text": "Love, love, love. I can't believe I waited so long to get a plant light. It came really fast first if all! It's so easy to assemble. As you see in the pictures you can put quite a few plants under the lights at the same time. It's adjustable in height which I love. The colors are red or blue or red and blue simultaneously. Trust me you won't regret this purchase.\n"}
{"text": "Your browser does not support HTML5 video. I LOVVEEE IT!!!!!!!SUPERR EASY TO ASSEMBLE! VERY STURDY! Ive been using their brand for awhile and i tried this and upgrade with the one with long stand! The bottom part is very sturdy, the light is sooo bright And you can change the set up to solid blue, red or mix! I use the mix lights for my plants. It also has timer of Up to 12hrs! I love it so much!! I will buy more in the future!\n"}
{"text": "This light is pretty nice for the cost. It's tall, stable and adjustable, and my plant seems to like it. The timer doesn't seem to work very well on the 12 hour setting - I often notice that it's on at different times of the day, even though I tried to set it to come on at 7 pm. Still, not entirely displeased.\n"}
{"text": "My plants are thriving with this light.  The look beautiful.  This is a great product\n"}
{"text": "This light seemed to be of pretty good quality. It was easy for my husband to put together. The lights seemed to make my plants happy the two times that I used the light. The third time so went to turn it on, it would not turn on at all. Im not very happy with the product, but Amazon was very accommodating with the return.\n"}
{"text": "The light was not big enough for my plant. The seller was very good about my returning the light.\n"}
{"text": "We have multiple indoor plants and have always had difficulty getting them to grow, i.e. not die. Plants have been grouped under this light and seem to be looking better.\n"}
{"text": "Easy to set up, and light weight.  Does the job for a good price.\n"}
{"text": "The assembly is extremely simple but the only thing is that, the base is a bit on the small side. If youre not careful with it, youll accidentally knock it over. The color saturation and warmth is great. LED for low electric consumption. Having the timer really is convenient.\n"}
{"text": "look nice made well. does its job covers a good area\n"}
{"text": "Great product overall. Easy to assemble, easy to adjust levels (height & brightness) to various plants, love the multiple bulbs and my plants seem to love the lighting as well. \n"}
{"text": "The four lamps are easy to position and the stand is very light weight but surprisingly stable. I would have liked a longer cord, but that doesn't take away from how much I like this light.  I will be buying more, and my friends and  mother  will likely get one for themselves.\n"}
{"text": "Adjustable arms and light choices. Also like timer\n"}
{"text": "love it for my flowers\n"}
{"text": "I am glad that it works.\n"}
{"text": "Not very bright at all.\n"}
{"text": "This is a great LED light for my  hybrid grows, I bought this thinking that I would not like it but I was wrong and I will definitely be buying more, maybe the manufacturer will let me test their products \n"}
{"text": "I like this grow light a lot. I thought it would be cheaper to get a regular lamp, grow light bulb and timer extension cord. Dont waste your time with all that, this light is more cost effective and its awesome. Theres numerous setting for a timer, brightness and even color. I also appreciate how you can adjust the lamp height and lights themselves.\n"}
{"text": "I use this daily for my house plants. It is lite weight and flexible. They are growing well-I am happy.\n"}
{"text": "Excellent lights! Came packaged very safely. The lights are high quality with 3 light colors. Has an automatic timer which is supper convenient. I have seen a major difference on my plants are using the lights.  10/10 would recommend.\n"}
{"text": "The lamp is amazing! I set it for 12 hours. After one month of work,  look at my picture.. I was surprised to find out my Sansevieria  has a little baby))\n"}
{"text": "Love the lighting it gives out never know there was light out there for plants love it\n"}
{"text": "Only poor judgement on the tripod stand is weak ... need more support\n"}
{"text": "Works perfect. Height adjustable. great for the price.\n"}
{"text": "This was soo easy to set up.! And my babies are loving it!\n"}
{"text": "Noi enough light. Good for outdoor prep.\n"}
{"text": "Quite versatile for plants of differing heights and sizes. Easy to adjust.\n"}
{"text": "Easy to use\n"}
{"text": "Working good\n"}
{"text": "Way better than fluorescent gro lights\n"}
{"text": "Everything I expected! Good value for the money.\n"}
{"text": "Good\n"}
{"text": "Like\n"}
{"text": "I ordered the Plant Grow Light as a temporizing measure for my Lettuce Grow stand that I have indoors.  I wanted to see if my seedlings growth problems were due to a lack of sunlight or if another issue was involved, for instance, the hydroponic water solution.  Lettuce Grow offers a lighting system that attaches to the but it is a bit costly and I wanted to make sure it would be effective before I ordered it.  The Grow Light came nicely packaged.  It was very easy to set up and to use.  The base is stable.  It did help with the seedling growth and it is helping keep my pineapple plant growing as well.\n"}
{"text": "I purchased this in September and it is already burnout out. The timer no longer works. And only the red light is functional. and of course the bulbs are not replaceable and since the last frost has not hit yet I am not finished winterizing my plants. this light didn't even last the whole season. And there is no way to contact the seller. Or return the product or get replacement bulbs. So no it is not a value for the money. It was easy to use when I first got it. But now that its not working that is a mute .And now I see it's on sale probably because it last such a short time and you have to replace it. So don't waste your money . I will have to by a different brand to replace this one.\n"}
{"text": "I ordered this light for my indoor plants. The description says that there are 3 different operating modes: Green, Red and Blue light. The lights I received don't emit Green light at all. I tried all different buttons available.  Mine only switches between Red and Blue LEDs.\n"}
{"text": "I love my plant light!!!  It has a range of color spectrums to use and you can control the brightness.  It fits my entire table which I love and was super tall, I didnt have to use it all the way up I had plenty of room.  I really love it more than my table lights I bought earlier this year!  Id buy another set!!!  Great purchase!!!  Only thing I had an issue with is the chord is short.  Its really tight where I have it so you might have to use an extension chord!  Other than that no issues!!!  Love it!!!\n"}
{"text": "They were so easy to assemble- my little seedlings are popping right up  TY \n"}
{"text": "I bought these lights for my night blooming cereus plants and they absolutely love it. They have grown a phenomenal amount since getting these lights. It's incredible\n"}
{"text": "The light was kinda hard to clip on to my plant shelf, but I worked with it and finally got it clipped on and it works great.\n"}
{"text": "Its only been a week and it already stopped working.\n"}
{"text": "Not effective\n"}
{"text": "its work with my plants\n"}
{"text": "Item works well and timer feature is useful. After it is setup it will come on automatically everyday.\n"}
{"text": "I like it because, it expands across all my succulent plants.\n"}
{"text": "this is amazing and my cactus is thriving\n"}
{"text": "Its very easy to use and set up. Seems to be working fine.\n"}
{"text": "Works great and love the lighting ambience!\n"}
{"text": "This grow light has really helped my window sill herbs grow like crazy.  The only down side is the 24 hours timer runs a bit fast (about 23 hours 38 minutes), so each day the lights turn on 22 minutes earlier.  It took me a few months to figure this out.  I just reset it every couple week.  Minus 1-2 stars for an inaccurate 24-timer, otherwise would recommend.\n"}
{"text": "Product is great but the USB wall plug stopped working and I can't return it. All I need is a new plug.\n"}
{"text": "Love the product  does  the job, great price! I will just wish that the color changing would it be something  that it could do on its own like an automatic set up!\n"}
{"text": "User friendly. I was skeptical about this light due to some negative reviews. Ive only had it a few days and I love it already. The timer is working perfectly and it was easy to set up.\n"}
{"text": "Im so disappointed with this grow light. I had to return the first one because it didnt work due to defective adaptor and controller. The merchant sent a replacement but it only worked for less than a month. Can I still return it?\n"}
{"text": "Order arrived early. Very satisfied w/ this purchase. Using it for my succulents when I have to live it inside.\n"}
{"text": "My plants love me for it. Great for the winter months.  Great value for the product and super slim and adjustable.\n"}
{"text": "I bought these to help keep my plants alive over the winter but they looks so interesting that I'll be using them for mood lighting when I take the plants  back outside.\n"}
{"text": "timer could use a battery backup for settings. we had a one hour power outage during a storm and all settings were lost. besides that, its a great product. tomato sprouts in 4 days from planting.\n"}
{"text": "Automatic options is very helpful. I was away from home for month and my plants are healthy\n"}
{"text": "This light actually almost killed the plants. Took them outside to recover. In 2 days the leaves came back. This tells me all I want to know about this so-called \"Grow Light\".\n"}
{"text": "I really like this stand but I dont think it covers a lot of space I am a novice plant grower and thought this would cover all my plants but it was only sufficient for a smaller area so I did order another light board but I love this one for my pots of uneven sizes on the ground as the arms are very easy to bend and adjust or angle to hit multiple different pots\n"}
{"text": "I have two sets of these for my plants. Ive had them for a few months and just the other day I went to move one of the lights arms and the blue lights popped. So now if I want the purple light, one arm shines red. Im sad about that! But overall I enjoy the diversity of uses for these lights.\n"}
{"text": "Ok this is a real problem solver because you can focus light on the plants that need it and give the type of light needed.  Great timer features and super bendy arms make it easy to get light just where you need it.\n"}
{"text": "This is a wonderful lamp. I have another I paid much more for and this one works better. It's really adjustable and my seedlings came up in no time. It's also not hot at all and doesn't draw much power.\n"}
{"text": "This is very easy to use! 3 different timer settings and 3 different light modes (I just use the dual light mode exclusively). No issues growing plants in my basement in February here on Long Island.\n"}
{"text": "I wanted to wait to write the review, this lamp barely increased my electric bill & I am super excited to see how vibrant my plants are getting (specifically the Lemon Tree) Lemons are doing fantastic!\n"}
{"text": "I really started out loving this light.. My plants really perked up. The stand was steady  & the timer functioned well for the first week... then I started noticing the light coming  on 1/2 hour earlier every day. I had to return it but I would still recommend it. I will reorder & keep my fingers crossed.l\n"}
{"text": "Had to bring in all my plants in the garage due to few days of freezing temps.  This kept my plants happy and blooming.\n"}
{"text": "The stand is super cool. My plants will do well this winter in the house.\n"}
{"text": "It wont stay programmed. It is blue or red light or both. No clear or white light.\n"}
