{"text": "A little bulky but amazing!\n"}
{"text": "Son got them for Christmas and loves them. He can listen nice and loud and I cant hear a thing even sitting right next to him\n"}
{"text": "Just to listen to music\n"}
{"text": "My family couldn't hear my music.\n"}
{"text": "I love this product! Battery life is amazing!\n"}
{"text": "Sound quality is good for the price.  Bluetooth range and Battery life are much better than expected.\n"}
{"text": "really like this deal\n"}
{"text": "Muy buenos audfonos, estn excelentes y la pila buenicima\n"}
{"text": "Great headphone for the price\n"}
{"text": "Im pretty sure I got a returned and/or repaired headset. Both ear pieces have scratches. Also, I searched for Anker Headphones because of the quality Ive gotten from them in the past. I thought thats the brand I was purchasing. These are not the quality of Anker and theyre more expensive. Wish Id given more attention to the products name. I though SuperEQ was an Anker line. Nope, not at all equivalent quality. Not even MPOW quality which run around $30-40. Im not happy with these headphones at all. Pretty sure Ill return them.\n"}
{"text": "I've been enjoying these headphones often. I wasn't quite sure what I would get at the $60 range, but I've been pleasantly surprised. In a quirky bit of uniqueness, you're greeted by the voice of a fancy sounding British lady when you turn the power on. She says, \"Power on...pairing.\" As you'd expect, the headphones are easy to pair to either your phone or computer. The main purposes I use them for are to listen to music, make phone calls, and for talking and listening on Zoom webcam sessions. Music sounds nice and full on these. I especially enjoy the bass response and smoothness it gives to my music. They seem especially good for electronic music, hip-hop, downtempo, and anything else of the like. If you'd prefer a different sound than the default though, you just double press a button on the headphone. I enjoy this design simplicity, The active noise cancelling is another helpful addition, helping me to listen to more of my music and less of my neighbors!\n"}
{"text": "This headphone is well designed with excellent sound quality. Fits well for youth and adults. The advantage is you can connect two devices using bluetooth with latest bluetooth technology given in the headset. One more thing which I found good is you can use either with bluetooth wireless mode or with wire plugged into any device. BASS is really deep what they claim with external noise reduction/cancelling. Sound quality and design is better compare to other in the similar price range.\n"}
{"text": "Have bought a few over the past few months and have been disappointed with them due to not having good noise cancellation. Used these last night with a very good outcome. My husband is a loud snorer and I watch TV in the evening on my tablet and i was able to block out his snoring. Thank goodness. Now that ive found a good pair i can by anothet for my Daughter so i dont disturb het listening to her music as i work from home. Great buy.\n"}
{"text": "I have looked at several brands of noise canceling headphones, and finally decided to give these a try, based on other reviews. They are not wrong! These are AWESOME! I love them! The noise canceling settings are fantastic! The battery lasts a very long time- several hours, nonstop! They charge quickly. The earcups are comfortable and large enough to cover your ears, without squeezing too tight. I would definitely buy them, again!\n"}
{"text": "This headset are a must buy. I got for my third grader who is doing remote School as well as my other son who is in K2. As you can imagine having two kids in the house and me working from home, my son will get very distracted so after his old headset broke I decided to give this one a try and I have not regret it all. My son says it truly cancels the noise. He is able to hear his classmates and teacher perfectly and they are able to hear him perfectly as well. No lagging and stays put even when he is doing PE with them on !\n"}
{"text": "With a noisy kid around the house, my old regular headphones werent cutting it and I needed an upgrade. These noise canceling headphones work well! They definitely block out ambient noise better than my old headphones, and the muffs around the ear are very comfortable - so much so that my toddler loves to put them on for fun. I like the color of it as well, which is a sleek black with a red underside for some personality. I also like that these can easily be folded for travel or storage. It comes with a nice bag to put them in. The sound is clear. To be honest, as this is my first pair of noise canceling headphones, I cant judge how well it blocks out sound compared to other brands, but I can only say this is a big improvement for me from my regular headphones that Id been using. I can still hear my toddler screaming when I have these on, but I think something that would completely turn off that noise would be borderline magic ;) Im enjoying these and havent had issues so far.\n"}
{"text": "I have been using this new bluetooth headphone for two weeks, and I have to say Im impressed and satisfied with them. The design and presentation are excellent with high quality put into the product. Wearing the headphones on my ears comforted me because even after listening for a long time, I don't feel pain or discomfort at all! There is quite a noticeable noise reduction with noise cancelling mode, and I couldnt really hear anything outside of my music in this mode. I would recommend this product to my friends for sure, as they are amazing and affordable!\n"}
{"text": "Receive these today and I look nice plus they sound decent but the noise cancellation is nonexistent. I compared them with another brand that I purchased that arrived today as well and why you think I'm in a close bathroom with the exhaust fan on, to simulate an airplane noise, I could not tell any difference what is the noise cancellation on or off with this brand. The other brand has a very noticeable difference.\n"}
{"text": "I needed a pair of over-the-ear headphones to wear while traveling and decided to give these a shot. As soon as you try on the headphones, you notice how well it cancels out noise. Then you try the active noise-cancellation feature and realize how well it eliminates outside noise even when music isnt playing. The sound quality and comfort is great for the price point. Im happy with my purchase\n"}
{"text": "My ears don't do well with the type that go IN the ear so I thought I'd try these and I'm glad I did. I don't get earaches with these and they cancel sound much better than the in-ear ones I've had in the past. I mostly use these for listening to podcasts and audiobooks when I clean or do projects around the house. Battery lasts the whole time, several hours and still has strong power.\n"}
{"text": "The headphones built quality is good. The quality is mediocre lacking a solid deep bass. The noise cancellation is below my expectation as compared to the low end Sony model 710. Overall, it is a good value headphones if ANC is not the highest priority.\n"}
{"text": "Really nice and light headphones. The headphone fits snug and comfortable. The sound quality is good and battery life lasts long. Its not as loud as other brands but loud enough for indoor use and not too heavy on the head.  I like it for my children when they watch their tablets.\n"}
{"text": "Very nice headphones got them for my nephew because he spends a lot of time listening to music he loves the bass of these earphones and it also has an excellent battery life great sound quality he wears them all the time he loves the color and likes how they fit over his head highly recommended\n"}
{"text": "Had these for about 3 months now and the charging port is already malfunctioning. When you plug it in you have to bend the cord around just right and hope it doesn't move for the connection to persist. Its not the cable because I have tried multiple cables and have same problem. Sound quality isn't bad and they are fairly comfortable but that doesn't matter if they aren't going to last more than 3 months.\n"}
{"text": "The headphone pads fully encase your ear and are comfortable. It isn't a tight \"circle\" fit like some other models that give you a headache. Very impressive sound quality and bluetooth connectivity distance. They look, feel, and sound like something 3x their price and have excellent noise cancelation as well!\n"}
{"text": "I ordered these after much research and they were not at all as described. The logo on the ear piece is cheap and just looks like a random sticker. They would not pair with my MacBook Pro and this was the main reason I bought them. I cannot speak to their battery life because they arrived fully charged and I returned them in the first 24 hours of use. They are very heavy in comparison to their competitors. I would not purchase these again nor would I recommend them.  The head band bears most of the weight so that means the top of your head will feel pressure during use.  The noise cancellation left much to be desired but it does cancel some of the outside noise, just not everything.  For an adult working from home looking for true noise cancelling, I would keep looking.  With the heaviness of the head band, and the mid quality of the speakers, I would not buy these again. Good luck !! Good noise canceling headphones under $100 are hard to find.\n"}
{"text": "For the price of these headphones I would say the quality and how comfortable they are is definitely there. I could see myself definitely buying these again/ as a gift for relatives etc. I would say the sound quality is not as good as a $300 pair of headphones but that is definitely expected, but also its not that far off in terms of the quality\n"}
{"text": "I just got the headphone three days ago .The  design is what I like. Wearing them for two or three hours wont hurt my ears , and that is very important to me. Second, its perfect noise cancellation function gives me a good experience. But the sound is not as bright as the AirPods. Third, it is easy to carry . In general, its worth the price. I will give five stars.\n"}
{"text": "Great sound. They look great. I have small ears but they still sort of sit on my lobes uncomfortably after a while. Could be that I don't put them in enough!?\n"}
{"text": "Awesome battery life - I go by several days without charging it. Noise cancelling option works great. I turn it on along with some music and outside noises are cancelled out. Sound quality is good but not perfect. Lots of bass so I enjoy it very much with chill-heavy-bass beats. Overall quality is GOOD. Looks high-end but is definitely made of quality materials. However, this does not compromise comfort - still feels great when wearing them.\n"}
{"text": "Great! Its helping me at home and at the office. And its beautiful!\n"}
{"text": "I love the deep bass. This is an important quality I look for in any headphone I buy. The only tiny thing I would change is I wish when the gets turned up louder I don't want everyone else hearing the sound. Other than that these headphones are amazing.\n"}
{"text": "Very good product. Love these headphones. My whole family uses them even my young son. The noise cancelling works really well. They are comfortable to wear and dont hurt my head or ears. The sound quality is very good its very clear. Overall a very good purchase.\n"}
{"text": "Nice headphones. I hate having my ears smushed, so I'm really happy with how comfortable these are. And they're very easy to connect via bluetooth which is always a relief.\n"}
{"text": "You can understand me better if you are taught in a language other than your native language. Especially in online education, you definitely need a headset. I bought this headset to get the sound more clearly in online meetings and I think it works. Previously, I had a hard time understanding the professor because the sound was streamed from the computer. The same is true for phone calls. I have been trying this product for 2 days and I am very satisfied for now. I hope there is no battery problem.\n"}
{"text": "Wonderful noise cancellation considering the price. Base side of the sound is more clear. Treble could be i little better. But at this price, its a wow product.\n"}
{"text": "I got this for my girlfriend as a Christmas Gift and she loved it. She enjoys listening to music while working and she says she doesn't even feel like the headphones weigh anything. The noise cancelling was so good that she could not even hear the what was going on in the room. She says these headphones have really nice sound quality along with a long battery life. I would recommend this as a gift for someone who really enjoys listening to music and focusing.\n"}
{"text": "I was looking for mainly for over the ear (no sweating in ears) headphones, battery life, Noise Cancellation. I think my decision in buying this headphones is correct. I charged for 2-4 hrs and I am using for last 3 days for all my office meetings almost 6+ hrs a day. Buttons for noise cancellation, volume, call management are very handy.\n"}
{"text": "Product delivered with foldable/adjustable Headset(wired/wireless Bluetooth), travel on plane(adapter plug) , quality headset pouch. Headset has volume buttons, power button, and ANC buttons for calls/media/ambient/anti noise cancellation mode operations. Very comfortable ear pads over ear. It has good sound clarity while travelling outside with ANC feature on. Battery lasting for 30 hrs if used continuously. Good for long office calls or movie watch.\n"}
{"text": "Very poor quality,  they make a humming noise in the background and Bluetooth does not work reliably.  There are better options for the money.  Don't buy!\n"}
{"text": "Comes with a nice soft leather drawstring bag. The battery didnt need to be charged, and right out of the case, we got about 4 hours of listening.  I charged it before it was needed.  My husband turned On the noise canceling, and fell asleep in a room of loud children while listening to music. My son was able to relax while wearing them. It was easy to pair with two devices, and also with the wired connection to Nintendo switch.  We are happy with our purchase.  They adjusted easily for both adult and child. They fold to store easily.\n"}
{"text": "Absolutely worth the money. My wife works at home and I use these to watch tv while she works. Comfortable and great sound quality for the price. Im not an expert but I can imagine there might be better ones if money isnt a concern but if your ears are not fine tuned for very small intricacies, these are absolutely wonderful for the price. Good bass, sound clarity, battery life, and all. Highly recommend.\n"}
{"text": "Incredibly comfortable on the head, not too much pressure but feels secure enough to go run with.  The sound quality is great, a little heavy on the bass but not terribly so.  These are for sure not Bose headphones, but they're also not $300.  Great bang for the buck, noise cancellation works fine in every situation I've tested them in, though I haven't tried them on a plane yet.  The only thing I don't love is the words on the cups and the headstrap, but it's not a deal breaker.  Battery life is incredible!\n"}
{"text": "Great Sound, long lasting batteries.. Headphones feel premium I am in love with white color in particular. They can adjust to fit head very well and are very comfortable to use... I love hearing my audibles for hours on it, it has got amazing noise cancelling which helps me to be in my zone and enjoy every bit of what I am listening. It was extremely to easy to pair with my desktop, laptop and my phone. It is well built and made of good quality. Really happy with the purchase...\n"}
{"text": "I've been able to test these headphones for some time now, and I have to say that its a well built pair of headphones. They're very comfortable so my ears don't get tired, and the sound quality is good too. Overall, I would say these are a great bang for your buck, might purchase another for my mother.\n"}
{"text": "Won't pair. I asked to return and get a refund. This isn't an Amazon return, so no easy QR code. I have to print three labels, which I can't because my printer just died. I emailed the labels to the local UPS store. They don't go through. I finally had to purchase the labels at a cost of $1. DO NOT BUY. RETURNING IS A HUGE HASSLE.\n"}
{"text": "Have them for about 4 weeks use them with my IPad to watch shows and some you tube videos Usually have them on for about 3/4 hours a day battery usually last at least 7 days sound is good and good at canceling out TV my wife has on if I have any complaint it the ear pieces are a shade on the small side or my ears are a little to long happy with purchase\n"}
{"text": "Utter garbage.  I may have been spoiled after using pricier ANC headphones for so long.  I guess you do get what you pay for. The sound quality is awful, and ANC is non-existent, just some white noise that comes in an attempt unsuccessfully drown out noise.\n"}
{"text": "So, bought these because my other headset broke and I am very happy to date with the quality of the sound. Now I know these are not Boces but for my simple purposes of listening to podcasts and clearing up the speech on some videos it works just fine. I think the average person will be happy with this purchase.\n"}
{"text": "Your browser does not support HTML5 video. Built-in wireless headphones with professional feedback and noise reduction technology.  Do not interfere with meetings.  The sound can be adjusted to hear your surroundings.  Ear cups are designed to fit comfortably by the head.  Vivid sound, suitable for use at all times.\n"}
{"text": "I don't  like this headphone bcz price is high and sound quality is not good.battery life just 3 hours ...\n"}
{"text": "Amazing battery life\n"}
{"text": "My daughter uses it for her distance learning. It is very comfortable to wear for long hours and the battery lasts a pretty long time. This headphone is of good quality and very lightweight. The sound quality and noise cancellation are very good. She doesn't get distracted by loud noises.\n"}
{"text": "I was very pleased with the sound quality of these headphones. They really do block out the sounds around you. I like the color and the feel of them. It's awesome that it has controls on the outer ear part. It was easy to get them connected and start listening to my music. I like to use them at the gym and when I'm trying to just focus on the music imlaitening in a noisy place. These truly are the best headphones I have ever used.\n"}
{"text": "I bought this as a new year gift for my friend.She loves it a lot!It is sound quality .\n"}
{"text": "Realmente eliminan el ruido ambiental. Son buensimos\n"}
{"text": "Excellent product\n"}
{"text": "Good\n"}
{"text": "Needed noise canceling headphones for class, and this was an awesome choice. It fits very comfortably and does not hurt my ears. The sound quality is great, and also you can activate or deactivate the noice canceling stimulation. I also really liked the color, it was not too extraordinary just nice and classy. These headsets are affordable and the result is undeniably satisfying. Was very pleased with the headset, its definitely worth a purchase.\n"}
{"text": "Great noise cancellation, quality is excellent. I bought it for my son and he enjoys it really well. He likes the color as well. He uses it to do school work, gaming and music.\n"}
{"text": "I would really recommend this headphones. This sounds strong, powerful and clean. Noise cancellation is good enough. Not heavy at all. Comfortable. For this price, totally worth it.\n"}
{"text": "I love this headphones! The noise cancellation is on point, the battery last extremely long, I charged them full the first day and I have been using them on daily baisis for 3 days and still at 80%. They are great! 100% recommended very comfortable and adjustable.\n"}
{"text": "This headphone is not what I had expected from a $60 pair of headphone. The quality of sound, the weight, the ability of noise cancellation, and the color style is all something way better than my expectation. If you are looking for a noise cancellation, nice sound quality pair of headphone for a small price, SuperEQ S1 could be the best choice. The first item to note is that they have bluetooth 5.0 which means the connection range is pretty far. Since the bluetooth 5.0, the data transfer requests very low energy which means this headphone can pack a 30+ hour battery cruising life with all possible features on. If you want to have longer running time, then you can choose to turn off a couple of features. The noise cancellation functionality is the best part of this headphone. It has light weight and performs great sound. The bass is the most impressive part of it. People that do not want bass may want to stay clear of these, but from my testing I really enjoyed the sound. It comes with a charging cable, and a carry pouch. The SuperEq S1 is a great pair of headphone. In my opinion it provides a great sound quality and the noise cancellation ability with an affordable price. It is comfortable and has a great battery life. I would suggest this pair of headphone to anyone who is looking for an inexpensive, nice sounding, and noise cancellation headphone.\n"}
{"text": "These headphones were amazing! I got these for my nephews 12th birthday. He is really into gaming and animating and he really wanted a pair of beats but they were a little on the pricey side so I went with these and they are great! He loved the headphones. They delivered in a nice package, on time, and he loves them! I cant tell if the noise cancelling is so good that he cant hear me when I say its time to stop playing or if he is just ignoring me lol I will definitely be ordering these again.  Great price for a great quality headphone!\n"}
{"text": "My daughter loves to listen to music, but doesnt like using earbuds. So my wife and I decided to get her some headphones. We dont have a huge budget for these kinds of gifts so we went on a limb with this brand. I was actually blown away with the sound quality and functionality of these headphones. I own an old pair of Bose noise canceling headphones and these ones remind me of them. I tested them with a variety of songs and they all sound great. The controls on the headphones are easy to use as well. My daughter loves them, which is the most important part. Im very impressed with the Super EQ headphones\n"}
{"text": "Just does not fit right. Was real sick and did not return properly.\n"}
{"text": "I bought this headphones because its wireless and good price, but turned out much better than I expected. Its light weight and very comfortable to wear all day. The sounds quality is great because its completely noise cancellation. Battery life is also long enough to last me about 8 hrs at work. I also like how it folds up so easy to pack for travel. I take it with me to work everyday.\n"}
{"text": "I was impressed with the sound quality of these headphones. I bought them for my son for our trip, and they worked perfectly. We had a long car ride, and I was worried they wouldnt hold a charge long enough, but they lasted the whole way there, and most of the way back. Great battery life! And the sound is really good. I feel like for the price these are a great buy!! I would definitely recommend these to anyone looking.\n"}
{"text": "I always take the class online. My kid always noise and make me don't pay attention. My brother tell me about this product. I tried and feel good with it. The sound is good and quality. The battery is also good enough for my session online study. I also love the color that is great and the rim can bend to make small after use.\n"}
{"text": "Bought this headset as a gift for my nephew and he was very happy with it. Its very well built and the sound quality is pretty impressive for the price of the headset. Love the red and black design; very soft padding and the wireless is a must have! Easy to connect without any problems so far Can't complain for the price, these are great headsets\n"}
{"text": "I am a huge fan of Bass. I start my day with Bass music to boost up through the day. I used to use a different High-range brand before, but these headphones have definitely overdone them when it comes to the bass and treble. However, my head's a little smaller in size and I have to adjust it a little sometimes. Other than that, I'm really happy.\n"}
{"text": "NC ist in Ordnung, allgemein ist mir der Sound zu dumpf, der Sitz zu eng und die Polster bringen meine Ohren zum glhen. Ich habe noch nie so unter Kopfhrern geschwitzt. Fr mich nur ein Fazit: Wer billig kauft, kauft zweimal. Der Kopfhrer wird als Notbehelf da bleiben, aber nicht fr den tglichen Gebrauch.\n"}
{"text": "Ich habe diese Kopfhrer bestellt, da sie eine sehr gute Bewertung haben. Zunchst war ich skeptisch, muss allerdings sagen, dass diese Kopfhrer in jedem Punkt mit meinen alten Beats Studio mithalten knnen und das auch noch zu einem sehr fairen Preis. Die Klangqualitt ist wunderbar und hat auch mit hohen Bssen keinerlei Probleme. Die Akkulaufzeit beluft sich bei tglicher Nutzung auf ungefhr zwei Wochen. Am positivsten berrascht war ich jedoch von der integrierten Noise-Canceling-Technologie. Selbst in lautem Umfeld hrt man nichts von diesem, bis man das Noise-Canceling wieder deaktiviert. Alles in allem super Kopfhrer mit klasse Sound fr einen geringen Preis im Vergleich zu anderen Herstellern! Definitiv eine Kaufempfehlung wenn man nach Spitzenqualitt im Mittelpreissegment sucht.\n"}
{"text": "Der Klang ist sehr gut und auch beim Telefonieren hrt es sich gut an. Meine Gesprchspartner konnten ebenfalls keinen negativen Einfluss feststellen. Die Bedienung und Handhabung ist einfach und fast selbsterklrend. Erst nach mehreren Stunden fingen die Kopfhrer etwas an zu drcken, aber das ist kein Vergleich mit meinen sonstigen Erfahrungen. Fazit: Leicht, gute Qualitt und guter komfort zu einem guten Preis. Dadurch ist dieses Produkt eine echte Empfehlung.\n"}
{"text": "Ich habe mir die Kopfhrer gekauft da ich die Ohrstecker nicht mag. Die Kopfhrer sehen super aus sind auch sehr bequem. Die Qualitt ist sehr hochwertig. Das koppeln mit meinem Huawei Handy war ganz einfach und ging auch sehr schnell. Der Klang ist sehr gut. Ich wrde die Kopfhrer jederzeit wieder kaufen. Preis-Leistungsverhltnis top.\n"}
{"text": "Zuerst wollte ich zurckkehren, aber dann habe ich meine Meinung wegen des hochwertigen Soundeffekts und der aktiven Geruschunterdrckungsfunktion gendert.  Sehr schlankes Design, einfach zu tragen und perfekte Qualitt.  Es ist zwar etwas schwer, macht aber einen schnen Eindruck.  Insgesamt zufrieden mit dem Kauf.\n"}
{"text": "Nach Jahren mit meinen relativ alten Kopfhrern, entschied ich mich fr etwas neues, die ANC Funktion hat mich besonders interessiert, diese kommt mir beim tglichen Joggen sehr zugute also hab ich es gekauft. Angekommen war ich ber die nette Verpackung schon froh und ich muss sagen meine Erwartungen wurden bertroffen. Beim Joggen hatte ich trotz bassigem Sound kein Druckgefhl auf den Ohren und die Geruschreduzierung ist hervorragend. Klare Empfehlung meinerseits!\n"}
{"text": "Sehr angenehm zu tragen. Tolle Tonqualitt!! Gute Verarbeitung unser lange Akuleistung. Preis- Leistungsverhltnis super. Wrde ich mir jederzeit wieder holen. Absolut zu empfehlen.\n"}
{"text": "Die Kopfhrer sind echt gut. Ich hre so ziemlich jeden Tag Musik oder schaue mir Videos, Serien usw. an bzw. trage jeden Tag Kopfhrer und bin echt super zufrieden. Die Kopfhrer sind aus guten Materialien, der Tragekomfort ist super, sie fhlen sich sehr wertig an und sehen dabei auch noch gut aus. Die Bedienung ist kinderleicht. Ich kann die Kopfhrer mit gutem Gewissen weiter empfehlen. Viel Spa damit\n"}
{"text": "1. Das Design der Kopfhrer ist wirklich gut und passt sehr gut. Es hat ein schnes Kissen. 2. Es wird auch mit einem AUX-Kabel geliefert, was gut ist, wenn Sie Ihren Akku nicht verschwenden mchten. 3. das Geld wert 4. Die Klangqualitt ist kristallklar.\n"}
{"text": "Meiner Persnlichen Meinung nach super Kopfhrer das einzige Problem ist das wenn man einen breiten aber recht flachen Kopf hat wie ich drckt es nach ca 1h ganz schon an den Ohren, da ntzt leider auch nicht die Verstellmglichkeit, aber ich wrde sie mir immer wieder kaufen da die Tonqualitt und das Preis-Leistungsverhltnis absolut top sind.\n"}
{"text": "Qualitt nicht empfehlenswert. Habe die Kopfhrer nun 2 Wochen getestet, kann man nicht empfehlen. Dafr ist der Preis zu hoch.\n"}
{"text": "Tolle Kopfhrer mit sehr guten Klang. Der Bass ist optimal. Die Kopfhrer sind sehr angenehm zu tragen und die Verarbeitung ist auch in Ordnung. Einfach Inbetriebnahme und Bedienung.\n"}
{"text": "Klasse Kopfhhrer mit angenehmen Tragekomfort, langer Akkulaufzeit und gutem Klangbild.\n"}
{"text": "Sehr bequem und sieht wertvoll aus. Gut Soundqualitt und drckt die Hintergrundgerusche gut ab.\n"}
{"text": "Entspricht den Funktionen. Eine Deutsche Anleitung wre hilfreich. Vor Allem die Kopplung msste besser beschrieben werden.\n"}
{"text": "Die Kopfhrer sind sehr angenehm zu tragen, haben ein sehr gute Akku Laufzeit, und lassen sich sehr einfach mit dem Handy/Computer verbinden. Das integrierte Mikrofon ist auch top, und erzeugt nicht wie andere Kopfhrer, irgendwelche nervigen Nebengerusche.\n"}
{"text": "Fr den Preis unzufrieden. Ton- und Mikrofonqualitt nicht gut.\n"}
{"text": "Dreimal in der Woche beim nach Training benutzt, bereits nach 3 Wochen defekt.\n"}
{"text": "Sehr gute Qualitt, tolle Kopfhrer\n"}
{"text": "Kopfhrer von guter Qualitt mit guter Akkulaufzeit. Die Geruschunterdrckungsfunktion ist sehr gut.\n"}
{"text": "Die Kopfhrer sind nach einem Tag geliefert worden. Einfach zu verbinden. Sitzt sehr gut und ist angenehm zu tragen. Die Tonqualitt ist hervorragend. Fr den Preis super Kopfhrer!!!!!!\n"}
{"text": "billige Verarbeitung, bleibt beim Sound hinter den 5 Sterne Bewertungen klar zurck\n"}
{"text": "Lieferung einwandfrei. Sehr gut Verarbeitung und Qualitt. Das Noisecanceling sehr gut. Super Targekomfort. Empfehlenswert!\n"}
{"text": "Sehr gute Ton Quali. Mann kann es praktisch zusammen klappen. Die mit gelieferte Tragetasche ist auch sehr vorteilhaft und nice to have.\n"}
{"text": "Ich besitze Kopfhrer fr die Hlfte des Preises, die besser sind.  Kaum Bass. Sehr enttuschend.\n"}
{"text": "trs facile a prendre en main ; le rducteur de bruit est trs efficace ; rapport de prix intressant ; a conseiller\n"}
{"text": "Buen sonido y cancelacin ruidos\n"}
{"text": "Bin einfach nur zufrieden!\n"}
{"text": "Es passt alles...\n"}
{"text": "The headphones has a some great features, its noise canceling is incredible and perfect for a flight, the ambient sounds really gives a natural feel and its also just comfortable to wear! This is a warm sounding headphone, bass-head would likely to favor it. For the price, this is a value buy. A good starter headphone if you are on a budget.\n"}
{"text": "quality made with nice noise cancellation, premium sound quality, and pretty good battery.  I charged when arrived and used it almost every day but haven't need charge yet.  Prime headphone with reasonable price.\n"}
{"text": "This headphones has an amazing battery life, the charge stays for days, I have been used it four days in row for hours a day and Im still on the first charge!, The sound is clear , great crisp , its very comfortable on ears, I like noise cancellation feature, automatically pair to my cell phone once I turn it on. A little nice carry bag comes with it to put it, highly recommend\n"}
{"text": "After a couple of weeks of the tryout, this is a great headphone I got from amazon. Battery life more than three days, noise cancellation works great!\n"}
{"text": "These are a perfect product who wants to have there work from home office setup complete... I loved the battery life and noise cancellation feature...its super easy to connect and absoultely perfect for those who need noise cancellation to have quiet meeting hours.\n"}
{"text": "I can use the headphones for a few days before I need to charge them! The only problem is that they are a bit uncomfortable and could use some sort of padding.\n"}
{"text": "Great headphones and very good price for that good of a quality. The sound quality of these headphones is very good, the battery life is great and the wireless connectivity is a nice feature. I strongly recommend this headphones for whoever listens to music for long period of time, they are very comfortable and the noise canceling feature is a perfect bonus!!\n"}
{"text": "Really nice headphones. Noise cancellation works well, sound quality is amazing.\n"}
{"text": "I m purchased these as a christmas gift for my girl. She very like it with them. The material and fit are very good. The controls on the side also work quite well. For my usage these are perfect\n"}
{"text": "Wow, this headset is good. It came exactly as described in the description and it was very lightweight and the sound was very clear but its a bit heavy to wear for a long time. Bluetooth connection was ok and the noise cancelling feature was also good.\n"}
{"text": "A truly excellent headset at a great price. Pros: - the sound clarity and quality is excellent. - the bass is great! - the microphone works well. - charges quickly and lasts as long as stated. - foldable design makes it easy to carry in my backpack without taking much space. - the black and red colour ensemble is elegant. - Bluetooth set up was quick and easy. - ANC works well  doesnt completely block background but significantly reduced it. - ambient setting works a treat and performs as expected. - comfortable to wear but does begin to become slight uncomfortable after wearing continuously for about 3 hours. - come with a PU leather-like storage pouch (though I would have preferred a hard case for ultimate protection). Cons: none whatsoever! Would be happy to recommend this headset as its price-value ratio is outstanding. Great for working from home, as an extra set or replacement, for casual use and perfect for adults and teens alike. Feels very robust and delivers excellent battery life and quality sound. A real example of not sacrificing quality for price. If this review helped, please click on the helpful button to let others know! Thanks \n"}
{"text": "These are nice looking headphones and the design will appeal to a younger audience  I would say teens to twenties. They are light and comfortable to wear and fold down well with a nice looking plastic leather carry bag. The headphones connect straightaway to my iPhone and have a pretty good Bluetooth range  I can leave my phone in the kitchen and walk around adjoining rooms without losing connection. They also seem to charge quickly and hold their charge for the times Ive been using them  probably two hour sessions at the longest. I tend to listen to podcasts and pop and light rock music. I think the sound on these headphones for those is OK. I also have a set of Jabra headphones which at time of writing are 10 more expensive than these and the sound quality is so much clearer and crisper. Similarly, my wife has a set of Panasonic headphones which are 10 cheaper  and again I think they sound better. So for the price point I would shop around - especially if your music tastes are in the pop and guitar based rock genres.\n"}
{"text": "I did not expect these headphones to be as good as they are, I own really cheap headphones and more expensive ones and for the price of these (59.99) I thought they would not sound good, but I was wrong the sound on these is really good I like my music to have abit of bass and you can definitely hear it with these. The build quality is fantastic they come presented in a nice box with a lovely draw string bag, these also fold down making them perfect for when you are out. The button's where abit hard to work out at first, but I now have got the hang of them. These also have noise cancelling which for the price range work pretty well and ambient mode so you can still hear what's going on around you. I wore these for around 4 hours and they where really comfortable and did not hurt my head or ears, the charge also seems to be lasting well. Overall if your looking for decent headphones at a great price then these are great would make a lovely present as the sound, build and quality is amazing.\n"}
{"text": "My oldest son just cant get on with earbuds and prefers over head headphones, he has so many different pairs (Reminds me of a women with a shoe or bag addiction) they range from cheap ones to really expensive ones and they all have their pros and cons. They are very stylish, comes complete with carry bag, have amazing sound / bass to them, so easy to connect via Bluetooth, fantastic battery life and such good quality for the retail price. My son said they are very comfortable with memory foam earbuds but he did say that the L & R inside the ear pieces was a bit OTT as everyone should know there left and right - lol. Comes complete with charging cable, 3.5mm audio cable, airplane adaptor, carry and overall a great pair of headphones.\n"}
{"text": "Let's just say that we have been testing these at the same time as a bunch of uber-branded headphones that would be 4-5 times the price! So, the bar was set VEEEERY high from the start! Used them now ( well...delegated to my daughter) for 3 weeks and she uses it for hours at a time, in fact, they have become part of her head, I suspect LOL! She is using them interchangeably with certain turtles that she was absolutely amazed by, but now says there is no difference in sound and she finds these more comfortable! The best bit is that they last for days on one charge! Look great - very modern and funky, they are sturdy and robust and the sound is crisp, deep and velvety rich! Pricewise - absolutely excellent value for money! Definitely recommend!\n"}
{"text": "My 14 year old used to have a pair of Beats which were much loved and cherished but the plastic snapped on them despite great care and she didnt want to spend all that money on another pair for them to break again. These have been a well received replacement. The sound is good and they are comfy, if a little heavier. I find them a bit tight but they fit her fine. They connect pretty easily and the the range is pretty good. The battery life is excellent which is important for her as shes rubbish at remembering to charge. They dont have the wow factor of her beats but shes settled into them nicely. They come with a pouch, shame not a hard case.\n"}
{"text": "Those are really nice headphones. The build is ergonomically consistent and compact. Most of the material is plastic, but the plates on the earcups have a nice metallic finish. I would say they have quite a sophisticated look. Very comfortable memory foam earpads sit firmly on the ear. Connects to phone via bluetooth without issues. They feature a multipoint connection that lets you connect to two devices at once. Amazing battery life - I am well impressed with it! Considering their low price and really good performance, those are excellent headphones worth recommending!\n"}
{"text": "I am really pleasantly surprised by these. SuperEQ is not a brand I had heard of before and going by the price I thought these would be very average. I find the sound quality good and the noise cancellation excellent. They are Bluetooth and connected to my phone quickly and easily. They have up to 45 hours run time, I use them for maybe an hour or so a day and I can go a few weeks before needing to charge them up. They are really comfortable, the over ear bits are large enough to go right over the ears and I feel like I could wear these for long periods of time without any problems. They come in a nice faux leather drawstring bag. I would recommend these.\n"}
{"text": "I like these, they are comfortable and compact and I find nicer to wear on longer journeys than the ear buds. They do block out the majority of sounds as well. Sound wise they are really good and have great bass which is what I mainly look for in a headphone and they sound great across all my music tastes and have a good battery life, so far I've been using them for 6 hours at a go without issue. They come with a handy drawstring bag to keep them clean while floating about in my bag, and they look great too, not too big like some are. For this price range these are great, nothing no to like about them at all.\n"}
{"text": "I wasn't expecting these to be as good as they are, especially at this price (59.99). The noise cancelling aspect works exceptionally well and the noise masking is really good. The sound quality is excellent, with a wonderful rich bass. These are fantastic for making phone calls. Battery life is really good Very comfortable to wear even for long periods of time. They feel really well made I really like the fact that there's a button to skip tracks. I also like the fact that they can also be used corded These are overall some of the best headphones I've tried at this price point.\n"}
{"text": "So glad that I bought this great headphones. Look expensive compared to its price. Amazing battery life once fully charged no need to worry couple of days. Like to use them listening to music and podcasts when I walk every day for 2 hours.\n"}
{"text": "First off, these headphones are BEAUTIFUL! I love the red/white ones. Very high quality and nice packaging. I love that it comes with a two year warranty thats pretty easy to set up. The sound is fantastic and the noise canceling feature works very well. Ear pads are soft, making it comfortable to wear. Overall, great pair of headphones and would definitely recommend!\n"}
{"text": "WORTH EVERY DOLLAR! First of all, I was impressed by how quickly this was shipped. Love the design and feel of this headset. The sound quality is almost as good as high end headsets. Ive used this for a week now and have no complaints. The noise cancellation is great - when you turn up the volume youll feel like youre in a sound proof bubble. The battery life is quite decent too! Would definitely recommend!!!\n"}
{"text": "This is the first time I own a noise cancellation head set, the sound quality is very decent, battery also lasts very long. Noise cancelling works best in bluetooth mode. What I do like about it is not only a good bluetooth headset but it also has a 3.5 jack hole to hook on with a cable to connect with either pc, phone, etc  and I use it to replace my old studio head set. It works so well with my Focusrite audio interface so far. I would say its worth all the money investing in this device, happy purchase\n"}
{"text": "Your browser does not support HTML5 video. SO COMFY ON MY EARS. They sit perfectly so that it hasnt caused any pain on my ears like others Ive tried. So far Ive only charged the day I got them and havent needed to since. Music and my podcasts both sound great coming through.\n"}
{"text": "I loved this headphones. They are amazing!!! The sound is great and clear. It is really easy to connect to kinda devices. Also connects really fast. Noise cancellation system is also awesome. They are comfortable and I can keep it on for longer time without any difficulties. The battery life is really long and best among all my headphones. Great headphones, I am happy with my purchase and definitely recommend this product.\n"}
{"text": "purchased this just weeks ago and excited because this was my first into wireless headsets. the quality of the speakers is good, i the two tone  luxery matterial maked, not that heavy  on the head\n"}
{"text": "Lightweight and fast charging Bluetooth headset. I like it more than the headphones that go in your ears since they dont fall off easily and are a lot more comfortable. It takes a bit to learn how to use the 4 buttons that it has but is definitely worth it and simpler than you think. The mic has been giving me a bit of trouble but I havent used it as much.\n"}
{"text": "Your browser does not support HTML5 video. Great item, battery life is great, very comfortable. Bought it for my son, he uses it for his school and gaming. Noise cancelling is great and it helps him to keep his focus on his study. Charged it only once, and he has been using it for awhile since he got it every single day, never had to charge again. Worth every penny. Definetely recommended!!!\n"}
{"text": "Every noise canceling Bluetooth headphones i want are always so expensive. This one is half the cost but in my opinion almost as good. The headphones are comfortable. The sound is really good. They help canceled the noise around you so you don't need to play the sound so high. Worth it. Will probably get a second pair for my dad for Christmas.\n"}
{"text": "Really lovely set that comes beautifully presented in a leather style drawstring bag and a hard cardboard box. Lovely size and not too heavy. Sometimes similar products can give me a headache but these are super. Expand easily on my head and charge up nice and quickly. A good price for a quality product.\n"}
{"text": "What a brilliant headphones sound quality is superb wireless and chic you can not hear any loud noice it blocks all the noice so noice cancellation is just amazing and best thing is the battery life is very good i am really pleased by this gorgeous looking headphones\n"}
{"text": "The cushions in on the headphones are so soft and comfortable, its like there memory foam (not sure if they are). Very adjustable and fits over ear perfectly. Controls are easy to use and nice button clicks. The active noise cancelling is very good and the ambient noise is also very good. Very nice packaging.\n"}
{"text": "I bought this for my son, but I wasn't sure if it was popular enough, so I wanted to test it out.Bass, mix, good range, I think it's good.I want a device with good distance, they already have it, and they don't disconnect when I move.Black and red make it look fashionable.My son's last one is broken.I hope it lasts longer and saves my family money\n"}
{"text": "Very pleased with this product.  Delivery was delayed for a few hours due to adverse weather.  The guy who delivered it was very apologetic.  They felt comfortable on my ears.  The noise reduction works well.  Sound quality is excellent.  Great value for money.\n"}
{"text": "Very comfortable to wear, ear fits easily inside cups. Good quality sound with nice bass which is better when noise cancelling is off. Secure active fit for running or cycling. Battery life is amazing, charged when first recieved and used most days for an hour commute, still have 60%after over 2 months. Crazy!\n"}
{"text": "Love these headphone. Very good sound quality very clear and cancel out all the noise.  You can plug it in or use it wirelessly. I love the fact that they fold so easily and are not taking too much solace in the bag. They are perfect for travelling too as long as you charge it for a few hrs too. Definitely recommend.\n"}
{"text": "Excellent quality and battery life very good. Noise cancellation works well too tho I prefer to keep it off so I can hear doorbell etc.\n"}
{"text": "The headphones are really Good i haven't had any connection problems and the battery last for a really long time its a must buy! Easy to pair with phone.\n"}
{"text": "Very comfortable, excellent sound quality and easy to connect to Bluetooth. Am very impressed with this product\n"}
{"text": "For the price point these do a great job.  Decent sound quality, best with bass and ok with mids and highs.  My teenage daughter is using them and she's delighted with the sound quality listening to K-pop! The active noise cancellation (ANC) is pretty good too, again considering the price.  The sound quality slightly dips with ANC on, but my undiscerning daughter didn't notice that at all! The build quality is good and they adjust easily.  They're comfy to wear for fairly long periods. The fold tidily too. Bluetooth connection is strong. Battery life is excellent.\n"}
{"text": "Good budget headphones, I can't wear earphones/headphones for long as they hurt my ears so tend to alternate between them both. These are comfortable to wear and offer good music quality, the cusps are marked clearly so you know which way to wear them and they fold away nicely when not in use. The charge is quick and comes with all the necessary leads and instructions of how to use. Overall a decent set of headphones.\n"}
{"text": "All good about them. Amaizing powerfull bass, great hd sound quality. And its do have a michrophone. Works with the bluetooth, easy to pair it. The playback time is about 35-40 hours and they are USB rechargable. Very light weigh, foldable, fits well to any head and have lovely soft earpads. Also the headphones comes with the nice storage bag. The price is great for such perfect headphones, they definetly worth to buy them.\n"}
{"text": "Great quality headphones for a great price. These are soft, comfortable, well made and durable. The cancel exterior noise well and are easy to set up and pair to your phone by pressing and holding down the connector button. The battery life is great,  we've had then a few weeks now and not had to charge. There got a good size down and fit my husband as well as my 3 year old. These would make a great Christmas gift.\n"}
{"text": "Not being a brand with which I'm familiar, I wasn't sure what to expect from these headphones; they are surprisingly good for the price bracket. They look like premium headphones and are well made, are comfortable to wear (although the band won't suit people with larger heads, I think), and the sound quality is pretty good, only losing clarity at higher volumes. Four stars.\n"}
{"text": "These produce reasonable sound quality, particularly when their relatively low rrp is considered. They feel comfortable when worn, with some good padding just where needed and have decent noise cancelling properties as well. They fold neatly into a small pouch, so are easy to take in a bag without bulking you out. They are supplied in a box for ease of gifting.\n"}
{"text": "Bon casque avec qualit de son correcte, convient aux personnes qui ne sont pas vraiment exigeantes et qui souhaite avoir un bon casque qui fait le job. Bonne a une une batterie honorable (environ 40h d'autonomie, et 3h pour une recharge complte), tient bien sur la tte, ne glisse pas pendant les activits sportives, pas de transpiration ressentie sur les oreilles. Du coup le rapport qualit-prix plutt intressant. Points moins convaincants : la fonction rduction active du bruit n'est pas aussi performante qu'espr, l'ergonomie des boutons n'est pas vidente (les boutons on/off, baisser et augmenter le volume, ne sont pas pratiques lorsqu'on porte le casque, car trop proches et pas franchement distincts au touchs), les coussinets oreilles sont un peu rigides  mon got et pas trs confortables  la longue. Le casque est livr avec un cble de chargement USB, un cble audio 3.5mm, un petit sac de transport, un adaptateur avion, et un manuel d'utilisation qui comprend l'anglais, l'allemand, et le chinois (mais pas de franais). Pour rsumer, on peut dire qu'au vu du prix le casque va  l'essentiel et il s'en contente.\n"}
{"text": "Pendant que je rdige ce commentaire  un assainisseur d'air  diffuse de l'huile essentielle  2 mtres de mon bureau . Lorsque les oreilles sont encore fraiches du matin , a va , je n'y fais pas trop attention , mais aprs 3 ou 4 heures  c'est aprs l'avoir teint que je me rends compte  quel point ce bruit tait pesant  . Du coup cest une excellente configuration pour tester les performances  de ce  casque  Super EQ  rducteur de  bruit . Quelques mots d'abord sur  sa forme et son apparence . Son arceau est quip de deux charnires , tres pratique pour le plier et lui faire prendre un minimum de place . Comme il est en plus fourni avec un petit sac noir en ska , il ne prendra que peu de d'espace , dans un petit  sac  dos par exemple . Ses deux coussins circum-auriculaires  manquent un peu de consistance , il est encore neuf donc pour l'instant a va . L'espace pour les oreilles est un peu limit , pour les petites oreilles c'est OK , mais si comme le mchant loup vous en avez de grandes elles risquent de se retrouver un peu recroquevilles ,  avec risque d'inconfort . Le casque est noir , l'intrieur de l'arceau est rouge . De ce mme rouge que les fauteuils des vieilles salles de thtre .Trs beau contraste lui donnant de la personnalit . La connectivit Bluetooth avec mon smartphone est  parfaite et il peut galement tre branch par jack 3.5mm. Pas vident  tester mais  je dis bravo pour ses 40 heures d'autonomie . Sur les commandes maintenant , jaurai quelques  rserves sur le fait qu'il faille appuyer 2 secondes pour avancer ou reculer , si il s'agit d'une fois a va mais lorsqu'on cherche un morceau sur un album c'est tout de suite beaucoup moins drle . Rserve  galement sur l'accessibilit des boutons que je ne trouve pas tres bonne .Mais avec un peu de pratique a devrait le faire . Pour ce qui est de la  qualit du spectre sonore je la trouve  tres bonne ,  riche avec des basses profondes  , moi j'aime beaucoup. Voil , maintenant la question , le mode rducteur de son efficace  ou pas ? Mon assainisseur d'air a trois vitesses , je le laisse toujours  la vitesse la plus faible , et donc avec le casque le bruit disparait compltement ,   la vitesse trois (tres bruyant )je l'entend mais le bruit est quand mme pas mal attnu . tant en possession du dernier casque Sony XM4   rducteur de bruit j'en ai profit pour comparer avec ce fleuron .  Le rsultat est qu'il n'a vraiment pas  rougir du tout de ses performances ! Par contre je pense avoir lev un livre , ou un lapinou  chacun de juger: A faible voir tres faible  volume , le Super EQ met un bruit rptitif , comme un grsillement  et uniquement du cot des commandes ,  droite , des que l'on monte le son on ne le peroit plus . J'ai pens au dpart qu'il s'agissait dinterfrences avec le moteur du ventilateur  de mon assainisseur d'air , mais j'ai t m'enfermer ou vous savez  , non ce n'est pas a . J'ai galement chang d'album de musique , rien n'y fait , ce bruit vient bien de l'intrieur de  l'oreillette droite . Il reste  savoir si c'est inhrent  mon exemplaire... Je ne peux videment pas valuer ce casque  sans tenir compte de son  prix de vente de qui est tout de mme plus de 6 fois moins onreux que le Sony . A moins de 60  on peut donc lui pardonner ses menus dfauts .\n"}
{"text": "Les casques cachent souvent des dsillusions, pourtant ce Super EQ S1 se la joue dans la cour des grands. D'abord par sa prsentation noire, larges coquilles noires entourant bien les pavillons d'oreilles et sa mousse amortissante rouge rellement efficace. La casque serre un peu le crne, mais le confort est bon. Je l'ai test longuement d'abord en filaire sur l'ordinateur. Ce n'est pas son point fort, son frre S2 s'en mieux  moins cher, de plus le cordon est trop court.  Mais en Bluetooth sur le smartphone, le S2 prend un avantage indniable. On atteint le sublime sur le saxo de Candy Dulfer avec Lily was here, la guitare lectrique y est aussi extraordinaire de beaut, on touche l'anthologie. Je recommande fort ce morceau  tous les amateurs du genre. Je me suis aussi rgaler en coutant Hauser  Zagreb, ou David Bowie en duo avec Freddie Mercury . Que dire de la guitare de Mark Knopfler, et de sa voix qui se superpose en crant un espace sonore de bon aloi, trs raliste. L'ANC, rduction du bruit ambiant n'entame pratiquement pas le caractre volontaire de ce petit casque. Cela mrite d'tre soulign car c'est loin d'une gnralit. La qualit des sons est remarquable, basses solides et propres, mdium excellent et un aigu raisonnablement coup vers 20 kHz pour obtenir une performance honorable. J'ai test et cout des centaines de casques et d'enceintes de tous les prix un peu partout en France. Ce que je peux vous assurer,  ce tarif, le S2 est imbattable. Musique et spatialisation sont trs rares  ce niveau de gamme. Bilan extrmement positif pour le S2\n"}
{"text": "Jadore lesthtisme de ce casque, il est  la fois discret et moderne avec sa couleur noire et rouge. Sa simplicit dutilisation, son confort (car il est bien rembourr), sa maniabilit (rglable et pliable mais du coup plus fragile), sa qualit dcoute et de rendu sonore, sa praticit de transport (pochette souple) sont des atouts qui font de ce produit un indispensable pour tous ceux qui aiment voyager et couter de la musique (un connecteur double jack est fourni pour connecter dans les avions). Sa fonction Bluetooth permet davoir une totale libert de ses mains et cest vraiment trs apprciable de ne plus avoir de fil qui se ballade mais possibilit galement de connecter le casque avec le cble jack 3,5mm fourni. Son tui de rangement est souple, il peut renfermer le casque pli avec ses diverses connectiques pour permettre de le transporter tout en le protgeant de la poussire dommage quil ne soit pas rigide pour protger aussi des chocs ventuels. Lutilisation est simple, avant de lutiliser il faut le charger avec son cble, ensuite avec le Bluetooth, le casque est reconnu rapidement par lappareil source et lorsquon coute de la musique via son tlphone, on entend si il y a un appel et on peut choisir de dcrocher ou non, le micro est intgr au casque et nest pas visible. Il faudra un petit temps pour matriser les commandes au niveau du casque car la notice est en Anglais mais elles sont assez simples, on peut rgler le volume, dcrocher un appel ou pas, activer la rduction de bruit Jutilise ce casque souvent en ce moment car avec cette priode de tltravail forc, mon mari est juste  ct de moi dans le bureau, ce qui nest pas simple pour se concentrer lorsquil est au tlphone en runion, du coup, avec la rduction de bruit de ce casque, je me mets de la musique pour bosser et lui, je ne lentends plus hihihi ! La pression du casque sur les oreilles se fait ressentir au bout dun moment et larceau na pas de bande lastique pour assouplir du coup cest un peu raide sur le crne mais le casque insonorise bien les bruits extrieurs si on active la rduction de bruit. Le son est net, on est dans sa bulle et le son du micro lors de la prise dappel est galement performant cest apprciable mais attention, tant donn qu'on entend pas les sons extrieurs on a tendance  parler fort sans s'en rendre compte et il faudra galement faire attention pour une utilisation en mode piton car la rduction de bruit peut savrer dangereuse dans la rue car on entend plus lenvironnement sonore et les avertissements en cas de danger. Un casque avec un son de qualit et une rduction de bruit assez efficace qui propose un prix trs abordable pour une fois (59,99 euros) compar  ses concurrents de grandes marques plus performants sur la rduction de bruit mais qui arborent des prix  trois chiffres... Un produit accessible et de qualit, je recommande pour ceux qui ont des petits budgets et qui ne peuvent pas se payer les autres de style Jabra et Cie.\n"}
{"text": "Its easy to switch modes from noise cancelling to ambient. I like battery life and sound also.\n"}
{"text": "The way my desk is structured for work, I need a bluetooth headset that work well. This headset is awesome because i am connected to my computer even though i am pretty far away from the computer.\n"}
{"text": "This headphone really worth its price. Its comfortable for wearing a long time and covers noise at a great level, and the sound quality is excellent! Me and my boyfriend both love this product so much. Plus, it looks good and is easy to bring with!\n"}
{"text": "This is one of the best product I have ever bought from Amazon. I got this as a gift for my daughter and she loved it tons. Sure will buy it again as a gift for the cousin.\n"}
{"text": "I bought these headphones for my son. Ive been surprised by high quality when I got them. The design looks very similar to my Beats Studio 3 which are way more expensive. The material seems to be durable. Clear sound, good mic, holds charge for a long time.\n"}
{"text": "Great sound. Great noise cancelation. Much better than 'in ear' ear phones.\n"}
{"text": "I like them a lot! Long lasting battery, great sound, nice design... definitely recommended. Get them you wont regret it!\n"}
{"text": "Absolute noise elimination! The effect is very good! The texture and the feel are very good and I like it very much\n"}
{"text": "I love them, they have a very clear sound and the load lasts a long time, they are my favorites I recommend them 100%\n"}
{"text": "Bought it for my teenager daughter  sounds quality is great . Long Battery hold it for so long she loves it thank you\n"}
{"text": "These are a good pair of headphones and feature a build quality that is very good given the price. I found these very comfortable when on the head.  There is a reasonably good padded silicone inner headband which doesn't slide around and the speakers are also padded well and when I wore them with my glasses I didn't experience any discomfort.  I have small ears so they fitted nicely over them but if you are larger eared, you may find that instead of going over they kind of sit on and that may be a bit uncomfortable.  For me the buttons are the weak point.  They are functional but I found them to be rather \"plasticky\" and \"clicky\" and that scratchiness is transferred through the ear cup. Design-wise these look great and I love the black and red design with the flash of chrome/steel.  However if I could change anything, I would get rid of the phrases found on either side of the headband (I know, I know, I sound so old).  It's just as a middle aged family man, the \"Be Young\" and \"Be Free\" messaging falls rather flat... as I am neither. Lifting my spirits somewhat from that mid-life crisis realisation, I'm pleased to say that the sound quality on these is very good.  You get a good bass heavy soundscape.  Mids and Trebles are of course there, but I feel it definitely leans more to the bass. These also come with two sound modes.  First is ambient sound mode which lets in background noise and this works well.  When activated you can hear other people talking to you without having to remove the headphones. The second mode is the noise cancellation and I can report that this is good.  I tested it out with our bathroom's extractor fan running and when enabled, the rattly fan silenced to a quiet murmur.  On a plane these would definitely reduce that persistent hum. The speakers fold to make a smaller profile and there is a faux leather bag included to carry these around.  Also included are a 3.5 mm jack headphone cable and 2 prong 3.5 mm adaptor so that when on a plane these can be plugged into your phone or planes entertainment system. So for just under 60 (at the time of writing) these are a pretty decent pair of headphones that are great for working or travel.\n"}
{"text": "Really nicely made headphones, especially because they are bluetooth, have Active Noise Cancellation and they also last for absolutely ages on battery, even with ANC enabled. They have decent built in controls using the buttons on the side of the headphones. They are super easy to pair and really convenient to just have in your bag. The accessories that it comes with are also pretty incredible for the money, you get an Aux cable, an airline adapter, charging cable and a nice little carrying bag which just makes them feel even more premium than they are. The only thing that I don't really love is the fact that sometimes when making calls it makes a strange background noise, this goes away as soon as the call ends but it is still strange. And also the fact that the power button does many things depending on how long you hold it for. This means that sometimes it is a guessing game as to whether they will turn off or whether they will go into bluetooth pairing mode. Overall for the money they are a really solid pair of headphones and the ANC isn't even too horrible. Obviously not up to the level of Bose or Sony but they don't have to be when they are only 60 and built really nicely.\n"}
{"text": "For their mid-range price point, these Hybrid Active Noise Cancelling Headphones from SuperEQ have a decent quality to the sound. Bass is good if you like it loud and heavy over hearing some of the detail and, yes, treble is present though a little weaker but it most definitely loses a little in the middle that prevents the music from coming alive if you're used to much more expensive sets.  That said, with these 3 to 5 times cheaper, they're perfectly good for a daily commute or just to sit around and listen to music. The build quality, however, is good with a nice drawstring bag and decent folding action these headphones are ideal to carry around.  The battery seems to last ages, too, on a single charge and the noise cancelling isn't bad for the price (just don't expect miracles), it's a little fiddly with a single button turning on and off the noise cancelling and the ambient sound.  Standard forward/backward buttons double as volume up/down with a power and pairing button in the centre of them.  There's an AUX in for wired connections (cable included) and charging is via Micro USB, sadly not USB C. The only negative about the build is for those with larger heads as these feel fairly tight, though perhaps better suited for teenagers wanting their first pair of decent wireless headphones. So, yes, they're pretty good for the price, it seems that these new cheaper brands have found a way to vastly improve quality over the last few years so most people will be happy with the quality of a set headphones like this without having to pay a fortune for it.\n"}
{"text": "I'm actually very impressed with these headphones. Seeing the price I was a little sceptical about the ANC in them and assumed the sound would be bad or the ANC not too strong. I was very wrong. Sound quality is balanced and has really good stereo separation between L & R channels and the bass is clean and not too overpowering. A little more low end would be nice but generally it's a pleasant listen. The mods and highs are well balanced and overall you get a fairly rich sound at this price point and even at some headphones much higher priced. Sound wise the only negative is overall volume, its not too low but a little boost higher would be better. The ANC has three modes. On, Off and Ambient. The difference between On & Off is subtle but it's there. The cups do a good job of blocking external noise anyway but you can hear the ANC working when there's no music playing and when it's on, you get very good isolation. The ambient mode works great to allow you to hear what is happening through the music and it works well. There's a very small delay on sounds but its only very slight. The headphones themselves are a little smaller than expected so they're quite tight on my head or around the neck, but not uncomfortably so and the ear cups are soft so do a good job of cushioning your ears when on The only annoying thing here is that they use micro USB to charge! Come on, it's 2020, just use USB C!!! All around I'm very impressed and they do a much better job than I anticipated. A great price point for a very capable product!\n"}
{"text": "Materials: Plastic headband with memory foam cushion on the inside. Memory foam earpads with leather cover. Impressions: Battery lasts me over a week, it's amazing! Built in Mic Works fine with my iPhone 11 Can connect to two devices simultaneously. The headband is very flexible and doesn't break easily. Earpads keep my ears warm on the inside, but don't steam me when indoors. Remarks: The bass levels aren't high at all! Ambient sound is ok, but active noise cancelling gives me a headache because i can almost hear a very high pitch tone blocking it. When outside or running you can hear a serious wind howl, which means the aerodynamics on the sides of each earphone needs to be improved. It's actually so loud that it begins to interfere with whatever I'm listening. My first impression with these SuperEQ S1 headphones was to the roof, however after using them for a month i noticed a few things began troubling me over time! The materials used are good quality, plastic headband has a long elastic region or i.e. they can be bent/deformed a lot without breaking and still return to the original shape. There is also a hinge on each earphone which allows it to move around 20 for better fit. The leather on the earphones is impressive the least as it's very soft and fully protects my ears ( i have big ears) from sound & cold weather. But when indoors my ears don't get steamed up. Battery is amazing, one charge takes around 90 minutes and then it lasts me over a week! Very impressive. Microphone isn't bad either, people say they can hear clear & loud when I'm connected to my iPhone 11, without hearing too much of the background noise. Music quality: Standard music and podcasts can be heard sharp and clean, however i listen to a lot off deep bass songs and unfortunately these headphones just aren't meant for it. The bass isn't deep at all and there is no treble whatsoever. Active noise cancellation: It does the job surprisingly well, when in metro or noise streets and turned on i can't hear any of that. I decided to give it a go and try while playing on my computer but after an hour or so I get a headache because of the sound that's phase-inverted by 180 degrees, it's weird but i can almost feel a very low noise pitch when its ON. Ambient sound: This is a new thing for me, never tried it before but its a great addition as I can wear the headphones and still talk to people or listen to announcements at the station/airport. However there is a bit of static noise that can be heard and unfortunately it lowers the sound quality. Bluetooth: Range is high, it definitely covers 10 meters and the V5.0 is used. What surprised me is that the headphones can be connected to several devices at once! I really wished that i could give them 5 stars but um there are just too many discrepancies that need fixing, but these are definitely good budget noise cancellation headphones that will do the job.\n"}
{"text": "These over-ear headphones come with a drawstring bag, charging cable, aux cable. They come pre-folded to keep the packaging small. The headphones themselves are black, with a red textured band that runs along the inside of the headphones; this textured band adds my grip to your head; The headband is adjustable. The earpiece has a thick soft cushion, to cover your ears; each side has an \"L\" or \"R\", you know which is the left and right. On the right has the onboard controls, \".\", \"o\" & \"..\" ( \"-\", \"OK\" & \"+\" to you and me) see below functions. The button on its own is the Ambient button. \".\"  :  Volume down & (long press ) previous track \"o\"  :  Play/ Pause music  for calls Pick up/ end call & (long press ) reject call \"..\"  :  Volume Up & (long press ) next track The headphones have 3 mics; one on the left, and two on the right; These mics are inconspicuous, and just looks like a design for the headset. The topmost mics are for measuring outside noise and bringing the ambient noise into the earpiece. The second mic on the right is for phone calls. I found pairing these with my computer and mobile a doodle; (maybe I am used to pressing and holding the \"O\" button to enter pairing mode, and I did that instinctively) find the headphone and pair; that is it. I found these headphones, have a good sound, a deep bass, and high tweets. The pairing is super easy. I like that these headphones support dual concurrent Bluetooth connections; so you can link to a phone and computer and watch a movie on your computer and switch to mobile when necessary. The ambient mode allows outside sounds into the headphones; this can be very helpful for example when cycling, with headphones, this lets traffic noise in. At 49.99 at the time of review, I would recommend these headphones, they have a good sound, good styling, good price, and dual connectivity. Pros - Good styling - Good sound - Dual concurrent connectivity - Easy pairing - Good price Cons - Even folded, is still bulky, but that the nature of over-ear headphones.\n"}
{"text": "Ive been left really impressed with the headphones, they are perfect in nearly everyway and the ANC technology in these is excellent! They came delivered nicely packaged in a well-presented retail box and along with the headphones you get a travel pouch, charge cable, 3.5mm AUX cable, airplane adapter, and the user guide. Im pleased with the quality of them, the plastic feels strong and durable, they arent too lightweight that they feel cheap, the ear cups and headband are very soft and comfortable, and they generally look nice when your wearing them. The headphones are comfortable to wear and grip your head quite tightly, so they wont be falling off if you decide to go for a run with them. Pairing them with my Galaxy S20+ was simple and they were up and running in seconds. The sound quality is very good and Im quite impressed with them to be honest, the sound is clear, well-balanced and you get a nice amount of bass from them. I would like them to be a bit louder when in Bluetooth mode, but the max volume is fine when using the wired connection and it seems to be an issue most BT headphones suffer with anyway. Call quality while using them is good, I can hear the person clearly and they can hear me with no issues. Without them even being switched on they do a great job of insulating sound from the outside and when you turn the ANC on you can barely hear any external noise at all. Im working from home at the moment but I have a fan heater which you can still hear while wearing the headphones until the moment you turn ANC on and the noise disappears, very impressive to be honest! The ambient mode also works well as it uses the mic to let you hear external sounds and you get a slight amplification so you can actually hear a bit better while wearing them. Overall, for around 60 I think these headphones are a great purchase and good value for money. The sound quality is great, battery life excellent, they are comfortable, and you get a good quality travel pouch with them which is a nice addition. Im very happy to recommend this item and I feel theyre worth the full five stars, I just wish they would go a little bit louder!\n"}
{"text": "Your browser does not support HTML5 video. The only time Ive used noise-cancelling / wireless headphones before was when I worked for a game company and they didnt belong to me but it gives me a bit of an idea as to what these are like. These are really easy to set up  they even tell you when theyre on. You can charge them via a usb plug which is handy for me as I dont actually have a computer of my own. There's no indication that they're charging though. These look great  the finish isnt 100% perfect around the ear cushions / buttons but its not bad! They look very similar to a well-known brand and theyre really stylish  I actually like headphones over buds these days as they remind me of the 90's! The sound quality from these headphones is much better than my buds (I buy a mid-range brand)  it actually feels like surround sound and because of the noise-cancellation, I can easily get lost in my own little world. Theyre quite comfortable to wear but I have quite a small head and you can adjust the size, it's a bit stiff though. The cushions even keep my ears warm. Importantly you can still use these wired (the supplied cable isnt very long)  so I can plug them straight into a device without bluetooth if need be. They are collapsing and come in a nice little bag to keep them safe. They also come with a warranty that you can activate.\n"}
{"text": "I ordered this product as love to listen to music, whether this being whilst working out or going on a walk. Came in a nice box fit for the headphones. Could definitely be given as a gift. What I liked when opening the product was the fact it comes with a wire connection if bluetooth isn't your sort of thing. Although personally I use bluetooth I liked that there was this for the option. Many other bluetooth headphones/earphones don't offer this. The product design is superb, very comfortable and look good! Could wear every day doing different things whilst still looking good. The headphones are of a high sound quality. Can also reach a very loud volume. These two things are key for me with headphones, and for both meet my expectations. The price I think is reasonable. Better sound quality than cheaper alternatives, also with a more luxury feel. Overall these headphones are impressive, they fold for a nice fit into the carry bag which is included. It has cool features like noise cancelling which is nice for zoning into work forgetting the outside world. They also play high quality music with a long lasting battery meaning more time of use without needing to be charged. I would recommend this product.\n"}
{"text": "I must admit my expectations were low, when you see things like \"hybrid Active\" and \"Super EQ\" it reminds me of cheap rubbish with poor quality drivers, terrible bluetooth audio and awful software but these are far from that. Although they remind me a little of Dre Beats in style they are very comfortable, more comfortable than some Beats, the cup completely surrounds my ears so I get a good seal on my head, which not only helps with noise reduction but also keeps the bass nice & tight. They can be used wired or wirelessly, but you will need to keep the battery topped up to be able to use them in either mode. They come with a cable as well as a 3.5mm doubler, I assume that is for a games console, I don't know. It comes with a nice leatherette much to keep them in and a very short micro usb cable. Sound quality is pretty good, nice bass, crisp highs and clear mids for vocals Pairing was a cinch, initial power up found them and powered them on in pairing mode The noise cancelling effect can be disabled and enabled using the button on the bottom, the headphone voice announces the mode when the button is pressed. It works pretty well especially for low frequency noise...I live right beat to a main road and it gets rid of the majority of the noise from the road, I could fall asleep wearing them it that quiet, all I can hear is my tinnitus.\n"}
{"text": "Your browser does not support HTML5 video. I was looking for an economic wireless headphone and I am glad I found SuperEQ S1. It was very easy to setup and operate. The sound quality and noise cancelling feature work great as well. I mostly wirelessly connect these headphones with my laptop while doing the treadmill. The battery seems to be working efficiently, I have only charged it once and it is still going after a week of use. The only improvement I would like to see is being a little lighter. I would highly recommend this product if you are not looking to spend extravagant amount on a wireless headphone.\n"}
{"text": "Due to this covid, I have to attained lots of online meetings and sometimes difficult to hear the clear voice over the speakers. I  always wated to have something like these headsets to have clear sound. This headset did pretty good job in the sound quality it offers. The noise cancelling feature  adds more advantage to it.  Got deep bass and built in microphone helps me to get my calls easily. Another feature I loved about this headset is that it can be fold and makes it more protable to carry. I am amazed with its battery life. I must say it last long enough. Due to soft memory foam, you can hold it for long in your ears without much pressure. I can recommend this product :)\n"}
{"text": "The white headphone is very beautiful, which completely meets my demand for appearance. It's very easy to operate and connect. Of course, the sound quality  can't be compared with that kind of very expensive earphone. But I think the noise reduction effect is very good. The surprise is that the battery life is really durable.\n"}
{"text": "This Bluetooth headset is sturdy and effective for a use in the plane or in a metro. Im an introvert and dont really like talking to people at work or in local transport. These headphones save me the trouble of talking to anybody as well as listening to quality music. The feel of these headphones in your hand is premium and sturdy. Also well built for use during exercise without worrying for them to drop as they have a strong grip over my head. I hope they last a year then I will be happy with my purchase.\n"}
{"text": "I couldnt be happier with these headphones. The sound quality is amazing. I am very impressed with the noise cancellation. I dont know what would be considered typical battery life, as these are my first wireless pair, but I have been wearing them for two solid days on a single charge and they are still going strong.\n"}
{"text": "OMG! Ive never tried this kind of headphones before, but Im pretty sure I gonna wear them everyday from now, theyre awesome! The quality is really good, the sound is amazing so far, I cant tell about the ANC cause I didnt use that function yet, but I was wearing the headphones the whole day and they were working perfectly with no battery issues. The only thing is after wearing the headphones for a while my ears start to bothering me a little bit, so I cannot wear them for long periods, u should rest in between, but I guess that happen to me too cause I used to wear the other type of headphones (the regular ones) but the Bluetooth connection is just the best thing ever if u dont wanna wear cables anymore lol  so happy with the purchase!\n"}
{"text": "This has been my favorite wireless headphones so far! Specially the color it has like red and white is not everyone have. It helps me keep distractions away and on meetings I am easily able to hear everyone properly. This has foam padded ear pads which are comfortable for wearing for long meetings. Unlike my older headphones these ones do not hurt at all. I liked the size as well as my head is a bit big so I feel this is right choice for me .\n"}
{"text": "Really appreciated the snug fit (Spring loaded). Really cool sound, good bass, and the noise cancellation feature helps the effect. The Bluetooth feature is really cool. once you pair your wanted device. (my phone in my case). I have to investigate further, but my firestick kept saying it might be out of range. All in all, a good experience for the money spent. (affordable and within reason). I would highly recommend this product to others.\n"}
{"text": "Update: 04/28/2021 After longer use with the headphones, I can safely say that it is a bit uncomfortable to wear. The main thing going for it is the noise cancellation it has, however, I'd advise going for something comfortable for long term use. This doesn't pair with PS5 as well if you're using it for gaming use, and its microphone isn't usable even when wired to the controller. All and all, look for another product for a more practical experience, and comfortable use.\n"}
{"text": "I bought this headphone for my son online class, because he is always getting distracted by the sound of his surrounding, and he is prety much satisfy with it. And if you are looking for super bass headphone, this is not it,  but for the price and your not looking for something that vibrate in your ear this one is perfect.\n"}
{"text": "Sound quality really good for the price, lightweight, great battery life, nice packaging,  \"superEQ\" name on each headphone ( would be prefer it blank\n"}
{"text": "The product is good especially allowing 2 device connection but overall comfortability and quality not much different from the average headphone.\n"}
{"text": "Great sound and extreamly comfortable to wear. Very happy with them all round A++\n"}
{"text": "I absolutely love the packaging it came on and the headsets are perfect size , not too big not too small !! Very comfortable to use and battery lasts long ! The sound is perfect !\n"}
{"text": "I am so pleased with the wireless headphone battery last long for 7 hour and the noise cancellation system is awesome and the sound system quality is fabulous.\n"}
{"text": "Bought these for my son when his rather more expensive Beats headset failed after 14 months. Theae are great value for money great sound and my son is really happy...\n"}
{"text": "Exactly as described, sound quality is great, volume is loud, battery life and noise cancelling are both excellent. No negatives in my 2 months use\n"}
{"text": "They was for my grandson and now it is Peaceful and my grandson loves them\n"}
{"text": "Brilliant value and great sound\n"}
{"text": "Gute Kopfhrer, da kommen meine alten nicht mehr mit.....Ordentlich verarbeitet und wiegen ca. 280 Gramm. Die Muscheln liegen gut und bequem bei mir und meinen Durchschnittsohren an. Die Bedienungselemente sind wie blich an der recht Ohrmuschel und schnell ohne hinsehen zu bedienen. Zwar sind diese klassischen Kopfhrer den kleinen Earbuds unterlegen was Flexibilitt und Mobilitt angeht, nix fr die Jackentasche, aber das gleichen sie durch Tragekomfort und gutem Klang aus. Der Kopfhrer wird ber Bluetooth schnell von meinem Smartphone und Tablet erkannt ( SuperEQ S1 ). Wer kein Bluetooth mag, der findet ein klassisches Kabel in der Verpackung.  Wenn  ich mit Tasche unterwegs bin oder zuhause dann ziehe diese Kopfhrer vor. Da ist man ungestrt und strt auch andere nicht. Die sind dicht, wenn man es nicht bertreibt, dann muss nicht die ganze S-Bahn mithren. Kleiner Nachteil: man hrt keine Durchsagen, also darauf achten, wenn alle aussteigen oder entnervt diskutieren, man knnte in seiner Klangoase Umleitung, Gleisstrung oder Zugende verpassen ;-) ....\n"}
{"text": "Nice treat for myself :) Works great with phone, pc also it comes with connecting wire for non bluetooth devices like electric piano. Enjoy hands free phone call with great noise cancellation function\n"}
{"text": "but can be better, bluetooth and nc are good, connection and pairing is fast. Construction and sound is quite correct for this price range. The headset is not really comfortable for a long session. White color is pretty nice\n"}
{"text": "Muy bonito y cmodo; funcionaron bien por dos dias, pero luego ya no. ya sea con cable o Bluetooth funciona por aproximadamente 3 minutos y luego no se escucha nada. Me sent muy decepcionada\n"}
{"text": "The headphones were great.I am not used to wear headphones like this, but these were comfortable and i got used to them quick.The instruction booklet was also straightforward about pairing and how to use them.\n"}
{"text": "I bought for my daughter online school.Everything works perfect!\n"}
{"text": "These headphones have wonderful features and noise canceling for the price. Love the bluetooth capabilities and the buttons on headphones.\n"}
{"text": "Aesthetically & acoustically pleasing, nice packaging and top notch customer support! Feels and sounds like a $300 pair of similar phones. Probably more comfortable to be honest.\n"}
{"text": "Quality head phones, noise cancelling, great sound!\n"}
{"text": "I used many headphones but that headphones are too good for listening and very comfortable to wear .The sound is very clear.In this price the quality is very good.\n"}
{"text": "The fit was nice and the sound pure. I liked the light weight and the blue tooth connection was pretty seemless. The battery life is long and recharges quickly.\n"}
{"text": "Kopfhrer die einfach sind fr unterwegs sind nicht mehr so leicht zu finden aufgrund der groen auswahl, hier haben wir jedoch ein Exemplar das einfach super ist - sowohl fr den mp3 player als auch fr das Handy - die Kopplung mit dem Handy ist einfach und die Bedienungsanleitung ist sehr gut verstndlich. Fr den Gebrauch am MP3-Player ist ein Kabel dabei welches mit den Kopfhrern verbunden wird. Die Tonqualitt berzeugt mich vollkommen - es kommen keine Auengerusche mehr durch und ich kann mich ganz auf den Text fokussieren Sie sind auch nicht sonderlich schwer so dass man sie ber einen lngeren Zeitraum tragen kann. Also ich kann da nur sagen super - dabei auch noch sehr bequem. Durch die Polsterung entstehen auch keine unerwnschten Druckstellen .\n"}
{"text": "Ich habe die Kopfhrer mit dem iPhone ber Bluetooth gekoppelt, das ging problemlos. Die Kopfhrer haben einen guten Klag und sitzen bequem. Aufgrund der zuschaltbaren Noise Cancelling Funktion gehen Sie komplett ber die Ohren schlieen dicht am Kopf ab. Insgesamt machen die Kopfhrer einen hochwertigen Eindruck. Sie sind sehr gut verarbeitet. Die Noise Cancelling Funktion senkt Auengerusche stark ab. Ideal frs Bro, wenn man ungestrt arbeiten mchte! Trotz des eingebauten Akkus sind sie noch angenehm leicht. Mann kann den Kopfhrer auch ohne Bluetooth verwenden, dann steckt man einfach das mitgelieferte Kabel an. Kleiner Nachteil: es war kein Steckernetzteil zum Laden dabei, man hat ja meist einige ungenutzte Ladegerte herumliegen.\n"}
{"text": "Handlich (obwohl on-ear), praktisch, funktioniert super. Akkulaufzeit ist auch recht gut. Klang ist toll, Bsse sind super und Lautstrke lt sich richtig gut hoch drehen. Die Bluetooth-Verbindung wird immer sehr schnell gefunden, da gibts nix zu mkeln. Am meisten hat mich aber das Noise-Cancelling berrascht. Das funktioniert wirklich, man merkt einen deutlichen Unterschied. Natrlich wird nicht alles komplett berdeckt, aber jede Menge Nebengerusche werden wirklich gut weggefiltert. Auerdem deutlich billiger als viele Markenprodukte. Kaufempfehlung!\n"}
{"text": "Mir gefallen diese Kopfhrer richtig gut. Ich habe sie innerhalb weniger Sekunden mit meinem Smartphone und TV verbunden. Die Bluetooth Verbindung hlt bis in alle Rume in meiner 75m2 Wohnung. Die Kopfhrer kommen zwar in keiner schicken Box, jedoch finde ich den Aufbewahrungsbeutel viel praktischer und platzsparender. Ich bin mit dem Ton sehr zufrieden und finde die Preisleistung sehr gut.\n"}
{"text": "Auswertung nach Erhalt des Headsets und Nutzung fr 1 Woche.Dieser Ohrhrer ist hervorragend, hat ein wunderschnes schwarzes mit rot Aussehen und ist sehr angenehm zu tragen. Ich bin sehr zufrieden mit dem Bluetooth Headset und nutze es tglich. Es liegt nicht zu eng an und kann daher lange getragen werden. Die Bedienung ist einfach. \"Das Headset gibt Laut, sowohl wenn es Verbindung aufnimmt - als auch wenn es getrennt worden ist. Aufladezeit ist akzeptabel. Beide Ohren sind gut geschtzt. Das Tragen dieses Ohrhrers im Winter kann das Ohr vor kaltem Wind und Wrme schtzen. Sehr gut gerne wieder Klasse einfach\n"}
{"text": "Die Kopfhrer kamen am nchsten Tag an,alles war sehr gut Verpackt. Man erhlt die Kopfhhrer ein Akkuladekabel sowie ein Kabel um die Kopfhrer per Kabel zu verbinden.,dies finde ich sehr gut da ich sie dann auch benutzen kann wenn ich Sie mal vergessen habe aufzuladen oder einfach der Akku mal leer geht.Auf den Kopfhrern ist ein Symbol wo R und L auf der jeweiligen Ohrmuschel angebracht ist. So wei man wie herum man sie anziehen soll. Der Klang ist wirklich sehr gut. Kein Rauschen oder sonstiges. Der Klang ist gestochen scharf. Wirklich sehr gut,beim Bass den Hhen und Tiefen. Zu meiner groen Freude und berraschung ist die Bluetooth Reichweite wirklich sehr gro. Ich kann vom 3 Stockwerk runter gehen in den Keller und habe immer noch die Verbindung. Absolut Klasse! Die Kopfhrer sehen vom Design her wirklich sehr schn aus. Obendrein finde ich sie auch hervorragend verarbeitet. Nichts wirkt billig. Auerdem haben sie einen sehr angenehmen Tragekomfort und sind an den Ohrmuscheln schn weich gepolstert. Fr mich eine ganz klare Kaufempfehlung!\n"}
{"text": "Ich habe mir diese Kopfhrer gekauft, weil meine Anforderungen an Tonqualitt und Umgebungsunterdrckung gestiegen sind. Ich bin Musiker und brauche auch meine Ruhe beim ben um mich besser konzentrieren zu knnen. In Sachen Klangqualitt gibt es ganz andere Gerte die sind allerdings auch hher preisiger. Von daher bin ich fr das Geld sehr zufrieden, die Kopfhrer klingen viel besser als meine Alten. Die Active noise cancelling Technologie kannte ich noch nicht und ich bin nach dem Testen begeistert. Es tritt eine deutliche Unterdrckung der peripheren Geruschkulisse ein. Der Tragekomfort kommt nahe an meine beyerdynamics rann. Was ich schn finde ist das ansprechende Design und die Farben der Kopfhrer. Der Akku hlt ebenfalls mega lang und das ist ein wahrer Segen. Das Preisleistungsverhltnis ist top wrde ich sagen. Das war eine lohnende Investition.\n"}
{"text": "Ich htte das ja nie gedacht aber die sind echt Mega. Ich nutze seit jeher JBL aber die hier halten da locker mit. Das lsst mich ein wenig an JBL zweifeln, um ehrlich zu sein. Der Sound ist echt top, ich habe diverse Genres getestet und bin begeistert. Ordentlich Bass und die Tasten funktionieren einwandfrei. Ich habe sie meiner Frau aufgesetzt und sogar sie war berrascht, weil man es von einem \"NoName\" Produkt nicht erwartet htte. Geliefertes Zubehr ist dazu noch klasse!\n"}
{"text": "Dieser Kopfhrer wurde so herbeigesehnt. Mein Mann hrt unfassbar gerne Musik, und wollte schon lange einen Kopfhrer der gute Tonqualitt hat, gut \"sitzt\" und active Noise Control (Anc) hat. Und jipieh wir haben ihn gefunden. Dieser Kopfhrer ist, so finden wir, mit seinem Preis-Leistungsverhltnix ganz weit vorne. Er wird geliefert in einem Karton. An sich ist der Kopfhrer nochmal in einem netten Sckchen verpackt.  Die Bedienungsanleitung ist auf englisch -nur teilweise auf Deutsch, aber mit reichlich Bildern versehen, so dass man auch problemlos den Kopfhrer koppeln und die Funktionen verstehen kann. Von uns eine klare Kaufempfehlung!\n"}
{"text": "Ich finde die Kopfhrer sehr gut, die sind bequem. Ich habe schon in-ear Kopfhrer allerdings nach einige Zeit tut Ohren bisschen weh, deswegen ich habe nach alternativen gesucht. Diese sind sehr funktionell und praktisch fr eine lngere Arbeitstag, und jetzt in HomeOffice es ist viel einfacher mit mein Mann in gleiche Raum Meetings zu haben, ohne einandere zu stren. Ich wurde die weiter empfehlen.\n"}
{"text": "Good sound quality. Battery life is great. Been wanting to replace my broken headphones for a while now. This turned to be a good purchase. I would recommend it.\n"}
{"text": "So far this headphone has been a great companion for my WFH. It has a nice over the ear cup with soft and light memory foam which allows me to ear wear it all day long without a problem. Since it has Bluetooth 5.0 with multiple device connections I don't have to switch around my devices for an audio connection. I like this headphone so far.\n"}
{"text": "This is not sound canceling, the volume is very low. I had to download a volume boost and it still isn't loud enough, plus I can't connect to the Bluetooth at all. Very bad quality!\n"}
{"text": "Love them, great sound and bass, thanks\n"}
{"text": "Very good product. Fits comfortably and the noise cancellation is excellent. The battery life is good and as much as I use the headphones I would expect the battery to run out quicker. Overall, they are well worth the money.\n"}
{"text": "i like them FINE\n"}
{"text": "It broke when I folded it. Great. Awesome quality(Notice my sarcasm). Edit: I would like to say even though it broke, I never noticed that they gave me a 2 year warranty. Awesome service and I would like to say that the headphones are great quality.\n"}
{"text": "Very comfortable headphones, fits really well. The sound quality is awesome! And the best part about it is it folds up in a very compact space which is easy to carry around.\n"}
{"text": "These headphones have been really great for the price. Noise cancelling has worked really well and sound is really good. They aren't sony or some of the other top headphone brands but do a good job with the drivers they have.\n"}
{"text": "Works great. It is used for working on racks in a dc\n"}
{"text": "The sound is great! Wore these to the gym a few times and they stayed on throughout all my workouts and are super comfortable. Battery life is also great! No complaints\n"}
{"text": "I ordered these headphones based on some of the other reviews. The headphones look and feel good though they were little tight on my head. They sound decent but not very clear and the base was mediocre. I tried listening to some music in my office with others talking and on phone calls,  I scrolled through the hybrid noise cancelling settings which didn't really seem to work very well. I had to pretty much turn the volume all the way up just to hear. Maybe it was just the pair I received. I also noticed in a quiet room that the headphones were actually quite noisy on the outside. Opposite of what you would think. I listened to the headphones for a few hours. In the end I decided to return them.\n"}
{"text": "I love the battery life last longer than my 15.99 pair of headphones.\n"}
{"text": "The noise canceling is amazing!! And the quality and sounds is so loud and good. My daughter says it cured her from her depression\n"}
{"text": "Great headset but the noise canceling feature needs some work.\n"}
{"text": "Nice\n"}
{"text": "My only complaint is that the headphones lack in volume. Other than that good battery life and fit snug.\n"}
{"text": "Didn't expect these to be as good as they are. Love em.\n"}
{"text": "poor bass, and sound\n"}
{"text": "I watched 4 movies and three hours of the YouTube  and the head set doesn't need to be changed yet\n"}
{"text": "If out in public, wouldnt use in areas where you NEED to be aware of your surroundings (walking near traffic etc) they are awesome, especially while I workout in the gym!!!!!! The battery also does absolutely well!\n"}
{"text": "My son used these for about a week before they stopped working. Didn't think to keep the box to make return on them.\n"}
{"text": "they comply with the guarantee\n"}
{"text": "New fav totally worth buying\n"}
{"text": "I'm not an audiophile, so this review is entirely subjective, but I'm really impressed with these headphones. The packaging is pretty plain, but the headphones themselves feel premium. They fold down into a compact size, I have a large head, but they adjust to fit my head really well and are very comfortable to wear. They come with a soft travel case and an adapter to use with in-flight entertainment systems if you so choose. Pairing the headphones with my Galaxy S10 was ridiculously easy. Press the \"pair\" button for a few seconds and scan for the headphones. They show up as \"SuperEQ S1\". Done. Sound quality is deceptively good. I'm comparing this against a Bludio Turbine headset I use in the gym. These don't get as loud, and the bass isn't as punchy as my Bludio headset, but the clarity of the sound is MUCH better. Coupled with the noise cancelling feature, I'm much more immersed when listening to something with this headset. I have kids, and noticed when I wear these headphones I literally don't notice outside noise.  (Makes focusing on my work much easier) These headphones punch way above their price tag. I'm very happy.\n"}
{"text": "Didn't want to spend a high dollar for noise cancelling when working in the workshop, so I got these.  Charged them up when they arrived which didn't take very long right out of the box, then popped them on and it synced with my phone right away when turning them on and selecting it on my phone. The sound when starting up discouraged me on what to expect, as it sounded weak and toneless.  Turned on the music to see how terrible it was going to be, to find out I was shocked at how GREAT it sounded.  It's not deep bass as I know some like, but its a great balance.  Running saws and equipment inside the workshop, the Noise Cancelling did a great job in dampening the noise so I can hear the music clearly.  Obviously you won't block ALL noise out, but I wore them for a few hours with music going and no issues what so ever. Overall, this is a great product to get without spending $300 for a set that does pretty much the same thing.\n"}
{"text": "Your browser does not support HTML5 video. I am in maintenance of a production plant that is very loud out on the production floor. My hearing is not very good and sometimes I have to talk to OEM reps to help repair some of the equipment on the production floor. I have tried the ear buds and they were better than nothing, but these headphones are the trick. I can hear the tech on the other end of the line with no problem and even better if I use the noise cancel switch. I no longer have to strain to hear the tech on the other end and hope I heard correctly of what he said. I have also used them to listen to music or you tube videos and they work good there too, but they work fantastic for what I purchased them for.\n"}
{"text": "I`ve been using them fully for two days already and must say that they are very good for the price! First of all, they came with like an eco-leather bag inside what makes it feel more premium quality at the first time. Then, I liked their design very much (got black/red color). It is cool to go out with them in a park, a street or a subway/bus, feels very enthusiastic. I did not expect the sound to be that good quality to be honest. I have AirPods Pro in my collection, so can tell from personal experience when comparing to higher end product. Of course they are not Airpods Pro or other expensive products, but they do their job fairly and are close to high-end items on the market. And the active noise cancellation works well too, so you can go out and have fun with them. Outer sound won't bother your activity. The battery life is outstanding! As I said, I`ve been using them for 2 full days already (about 12-14 hours in total of gaming, Discord, phone calls and music) and they are still active. I did not even charge them up when they came in. Forgot to mention the fit. They fit my head and ears perfectly what also is a good sign for me when choosing the headphones. For comfortability a huge plus as well!\n"}
{"text": "These headphones are amazing. My boyfriend had just ordered a name brand pair of noise canceling headphones and when I received these and turned on the noise canceling option and said WOAH. My boyfriend grabbed his and compared and these we're actually better. The microphone is also great quality as well. The battery life is fairly long. I use them on and off all day and for several hours straight at night and just plug them in before I go to sleep. They haven't died on me yet. I would 100% recommend these to anyone looking for noise canceling headphones. They're better then a name brand pair and 1/2 the price!\n"}
{"text": "The girlfriend wanted name brand headphones for Christmas, which I knew were expensive mostly for the name. I decided to risk it and go for a brand that's not well known but appears to be high quality. I tested these out before gifting them and I was very pleasantly surprised! The noise cancelation and sound quality was great and, in my opinion, better than the brand name headphones that were double the price. The girlfriend was also very happy and impressed with them.\n"}
{"text": "Nice sound quality and comes with a nice pouch with drawstring which makes it easier to carry. Its much better quality than my cheaper one I previously purchased.  Great value!\n"}
{"text": "Really Great bang for buck I really enjoyed the ANC pretty great feature for only 70$. I also like that they included ambient noise listening too. I can walk home and still hear without taking off my headphones. Definitely recommend.\n"}
{"text": "Noise cancellation is good, the sound has more stereo feeling then normal earphone. Did not know battery life yet, but I really like the design!\n"}
{"text": "Really good sound quality. The noise canceling is very good. Plenty of battery life.\n"}
{"text": "The headphones are comfortable to wear especially if you're one to wear them for long periods of time. The noise cancelling feature worked very well and there were two modes!\n"}
{"text": "The headphones came in a bag which was very convenient. Great noise cancellation, and I loved the color of the headphones! Overall great quality! \n"}
{"text": "I absolutely love this headphones, the sound quality and the noise canceling 10/10, long lasting battery and comfortable to use.\n"}
{"text": "Horrible quality Im not recommend it to anyone. If you want to buy it have to be careful!!\n"}
{"text": "This headset was bought for children to use for online lessons. Its OK, and the built-in microphone speaks clearly.\n"}
{"text": "Very bad product. Very disappointed with the headset and quality. Not worth price.\n"}
{"text": "The sound is poor. Activating noise cancelling cuts so much of the music sound that the volume has to be turned up a lot. It's like a lot of the frequencies have been stripped too so the full sound does not appear to be there. As a headphone just for cutting out background noise the noise cancelling is good enough and the good fit over the ears helps. The bar over your head though is really uncomfortable. Perhaps if I had hair rather than short clipped they'd be comfortable. The adjustment to fit is poor too. The final trivial thing that makes them dreadful however is having no visible light to inform what mode they are in (except when charging). So it's really easy to leave them on. Which I've done after short uses (as much as I can bare). The activation/deactivation and other status voice is also hideously annoying. My Electrotops ones are much better, lighter and more comfortable. Some Philips ones I bought at Christmas as a gift are also vastly superior.\n"}
{"text": "Your browser does not support HTML5 video. I bought these headphones as I wanted to upgrade to a set that had  ANC. This set arrived quickly thanks to Amazon Prime and well packaged. I managed to connect these up to my phone in about 30 seconds and was playing music through them in about a minute. Truly amazing. The headphones are comfortable to wear even for long periods of time and the battery life is fantastic too. The sound quality is excellent even at high levels with a good mix of bass and Hi-Fi Stereo sound. The ambient mode is great to, a simple push of the button and you can let in the outside sounds and hear people and talk freely without having to remove the headset. I have also been using these for gaming on my laptop at home when I wanted to drown out the noise of my son shouting on while playing fortnight and the dogs barking. All in all I am very happy with this Bluetooth headset. They seem to be well built and made of good quality materials with some great technology inside.\n"}
{"text": "Im not an audiophile so i can only give an average persons view of these when it comes to sound, i have big head and big ears and they fit fine and are a soft and comfy fit. They were really easy to pair, you just hold down the middle button for 5 seconds and it will say pairing and then its as simple as finding them on your device and pairing from there. I would say these are very heavy in the bass, on the edge of being too heavy for my taste so if you dont like base then i would give these a skip, But the sound is good and i use them mainly for watching movies while not disturbing anyone and these are great. Sound is good and they are light and comfy.\n"}
{"text": "These are very comfortable to wear, they are adjustable and they come with a charger and a little pouch for storage. I used them for jogging twice so far and I am very happy. To connect them to my phone was very easy. They have an on/ off button and also volume buttons, so you dont have to adjust the volume using tour phone .They fit me and cover all around my ear. The fabric is very soft and the padding too. They seem well made so far and the sound quality is very good. They have a good base and loud sound. They look much more expensive then they are as well.\n"}
{"text": "Nothing to dislike about these headphones. I was looking around for some new headphones as my old ones; with wires attached were starting to crackle. I was looking for Bluetooth and came across these ones on the Amazon site. I purchased a white pair and was so impressed with the sound quality and the fact that whilst wearing them, apart from how comfortable they were, I was able to listen to my music without any ambient noises interrupting my pleasure. In fact I have now bought a pair in black, which I have given to my wife. I have no hesitation in recommending these to any one who is looking for replacement headphones.\n"}
{"text": "My collection of headphones is increasing all the time, especially in lockdown. I'm enjoying listen actively and patiently, rather than in hurry during a commute. This budget brand is such good quality for the asking price. Firstly, the sound is great; bass, treble, mids and volume. The design is modern and it feels very comfortable to wear for long periods. The controls are as easy as possible to manipulate too. I also own Skullcandy brands, and this one is a respectable budget alternative. The noise cancellation capability is another reason for me to be happy.\n"}
{"text": "The SuperEQ S1 headphone is well worth considering. I wanted over ear headphones with good ingress protection for water, and these are rated IPX5. The hybrid active noise options are handy, especially when out and about. The headphones sound good, and do not distort. The multi-point dual connection worked well for me to connect to phone and notebook computer. The buttons are reasonably sized and have raised elements to indicate the function, which is good. The battery life is good, even with ANC on. There is some room for improvement. It has micro-USB rather for charging rather than USB type C. The earcups do not rotate, which can be useful. However, they feel sturdy, and I am confident that they would travel well.  I have only used them on a couple of calls, but the quality seemed fine. Overall, I am very happy with them, and at this price point, I think they deserve a 5-star rating.\n"}
{"text": "Bought to replace my old set of headphones. This is a great set, noise cancellation and sound quality is great, charged quickly and battery lasts about 5 days for me with about 2-3h usage with noise cancellation always on. Can be used with wired connection as well. Comfortable and not too heavy, my ears don't hurt at all after 3 hours of continuous usage, unlike others I had before. Very pleased with them and can recommend.\n"}
{"text": "Purchased for sons Birthday present for his tablet/computer. Overall very good sound quality, seem better than my own more expensive ones which was surprising!  The noise cancelling feature is very good, obviously it doesnt eliminate 100% but does exactly as you would expect and welcome for my boy with his noisy Brother and Sisters! It comes boxed with a cool hold bag which was a noise touch for when we're out and about. The battery life also has been very good, they've barely been off his head since his Birthday! Overall extremely satisfied and very good value for money for the quality, will be purchasing my own pair!\n"}
{"text": "I am not expert on this stuff but I know what I like!!  These look the part and sound great.  My main delight is with the noise cancellation element.  I don't expect not to hear a single thing - my daughter has a LOUD voice - but it does have a great softening effect that only has a minimal impact on sound quality.  It's a good set of phones for a good price.  I'm happy!\n"}
{"text": "Very good pair of headphones. Sound is great and the noise cancellation system works perfectly!\n"}
{"text": "Been using these for a few months now and I'm very happy with the quality, they are super comfortable and blocks out 90% of my surroundings noise\n"}
{"text": "Sound clarity is excellent for films etc.  I think really good value, they do what it says on the tin.\n"}
{"text": "Ich habe mir diese Bluetooth Kopfhrer bestellt, da ich mit den In-Ear immer Probleme habe und mir die Ohren nach lngerem Tragen weh tun. Diese Kopfhrer sind in der gre wunderbar einzustellen. sowohl meiner 3-jhrigen Tochter als auch mir (ich habe wirklich einen groen Kopf ;-) ) passen diese perfekt. Die Verbindung via Bluetooth und Klinke funktioniert tadellos. Lediglich den Airplane-Stecker konnte ich noch nicht testen. Nun zum Klang: Ich bin richtig zufrieden mit dem Ergebnis. Es klingt nicht blechern oder Stumpf sondern schn satt. Klar, es gibt sicherlich bessere Produkte auf dem Markt aber fr den Preis bin ich super zufrieden. Noise-Canceling: Das ist das erste mal, dass ich so eine Funktion berhaupt benutzt habe. Was soll ich sagen. Ich schaue YouTube und meine Tochter gleichzeitig Kika und ich hre null komma nichts vom Fernseher. Einziger Nachteil daran ist. Wenn meine Kleine die Kopfhrer auf hat und die Funktion ist an, hrt sie mich natrlich auch nicht. Das kann schon mal etwas nervig sein :-D Alles in Allem bin ich super zufrieden und kann eine uneingeschrnkte Empfehlung aussprechen!!!\n"}
{"text": "Very good headphones sturdy long battery\n"}
{"text": "Leider wurde der Artikel defekt geliefert, der Kopfhrer lies sich nicht einschalten oder reagierte bei Anschluss des Ladekabels. Aber schlimmer war der technische Support! Fhlte mich ehrlich gesagt etwas verar...!  Das Gert kann nicht ausgetauscht werden, das Amazon nur liefert - Warum kaufe ich dann bei Amazon wenn die keinen Support geben knnen oder wollen? Und das als Prime-Kunde, wofr Zahle ich denn fr den Service wenn man KEINEN Service bekommt, Bin sehr Enttuscht!\n"}
{"text": "Your browser does not support HTML5 video. Die OverEar-Kopfhrer tragen sich sehr angenehm, nicht nur aufgrund ihres geringes Gewichtes, auch die Ohrmuscheln bestehen aus einem weichen, gepolstertem Material. Im Lieferumfang ist noch eine Tasche fr die Kopfhrer enthalten, so knnen diese nach Gebrauch sicher verstaut werden, gerade durch den Faltmechanismus sogar recht platzsparend. Die Kopplung per Bluetooth mit Smartphone/Tablet/PC funktioniert einfach und unkompliziert. Besonders praktisch, dass sich zwei Gerte gleichzeitig mit den Kopfhrern koppeln lassen. Der Klang ist gut und fr die Preisklasse mehr als ausreichend. Weiterhin verfgen die Kopfhrer ber verschiedene Modi, wie ANC-Mode und Ambient-Mode, die sich per Knopfdruck an der rechten Kopfhrermuschel einstellen lassen. Ebenfalls lassen sich hier Lautstrke sowie das Ein- und Ausschalten fast intuitiv am Kopfhrer selbst bedienen. Fazit: Man sollte keine Highend-Kopfhrer mit allen Facetten erwarten, aber das sollte jedem bei dem recht geringen Preis bewusst sein. Dennoch bieten die Kopfhrer einen guten Klang mit vielen zustzlichen Features.\n"}
{"text": "Ich vertrage leider keine In Ear Kopfhrer, da ich dann immer eine Gehrgangsentzndung bekomme. Zudem wei ich die Stille mit steigendem Alter immer mehr zu schtzen. Sprich - ich nutze die Kopfhrer auch gerne mit sehr leiser Musik oder auch mal mit white noise - also monotonen Alltagsgeruschen - und ich mu sagen, sie sind phantastisch zum abschalten. Ich kann den Alltag damit weit hinter mir lassen und gerade jetzt zu Corona Zeiten ist das fr mich sehr wichtig. Ansonsten macht der Kopfhrer einen sehr wertigen und stabilen Eindruck. Genaugenommen knnte er sogar ein bichen leichter sein, was jedoch jammern auf hohem Niveau ist. Der Ton und die Bsse sind sehr gut. Telefonieren tue ich damit nicht, dafr habe ich einen leichten Kopfhrer mit Mikro. Denke dafr ist der Kopfhrer auch nicht primr geschaffen. Sobald man wieder fliegen darf, werde ich den auf jeden Fall auch mit ins Flugzeug nehmen. Da der Akku wirklich lange hlt - mehrere Tage - je nach Nutzung bis zu 5 Tage, drfte auch ein lngerer Flug kein Problem sein. Die Verbindung via Bluetooth funktioniert perfekt. Also mir gefllt er sehr. Und ich knnte mir durchaus vorstellen, dass dieser Kopfhrer die Basis eines Markenprodukts ist. Die lassen ja ohnehin alle in China herstellen mittlerweile. Ich bin also sehr zufrieden und jetzt gehts in den Langzeittest.\n"}
{"text": "Your browser does not support HTML5 video. WOW ! Wirklich, ich bin ziemlich geflasht von diesen Onear-Kopfhrern. Zuerst einmal zum Klang: Dieser ist hervorragend. Die Hhen sind sehr klar und die Bsse satt, ohne zu bersteuern. Einfach herrlich. So sollten Kopfhrer klingen ! Die Lautstrke lsst sich am rechten Hrer regulieren. Hier befindet sich auch der An/Ausschalter und der Knopf frs Noise-Cancelling, das finde ich persnlich sehr angenehm, dann damit werden Umgebungsgerusche sehr wirksam herausgefiltert, sodass man sich auf die gerade laufende Musik oder das Hrspiel konzentrieren kann. Mchte man sich unterhalten, wenn man z.B. gerade angesprochen wird, schaltet man den Transparenz-Modus ein. Dann kann man sich trotz Musik sehr gut unterhalten, ohne die Kopfhrer abnehmen zu mssen. Wirklich eine sehr gute Lsung. Der akku ist sehr schnell geladen. Ca 2 Stunden und das Gert ist wieder einsatzbereit. Ca 45 Stunden soll die Laufzeit betragen. So lange habe ich allerdings noch nicht gehrt. Bei mir kam der Kopfhrer an und ich habe ihn den ganzen Abend benutzt, ohne ihn vorher zu laden. Das waren schon ca 5 Stunden am Stck. Das Koppeln mit dem PC oder Smartphone funktioniert Kinderleicht. Bluetooth einschalten ( auf dem Kopfhrer den Koppeln Knopf auf der rechten Seite ca 3 Sekunden halten und dann auf dem PC oder Smartphone koppeln. Die Reichweite ist enorm, bei mir hatte ich ber 3 Etagen im Haus vollen Musikgenuss (Kopplung mit dem PC). Die Kopfhrer lassen sich aber auch per Klinke an den PC oder die Musikanlage anschlieen, man schont dann die Akkus. Die Ohrmuscheln sind sehr, sehr weich und liegen absolut angenehm auf den Ohren, ohne zu drcken oder nerven, auch wenn man mal eine Lesebrille aufsetzt. Hervorragend. Der Kopfhrer lsst sich zusammenklappen und in der mitgelieferten Tasche transportieren. Von mir eine absolute Kaufempfehlung und 5 Sterne !\n"}
{"text": "Ich habe diese Kopfhrer als Ersatz zu meinen bisherigen Taotronics (TT-BH060 DE) bestellt. Das Design der Kopfhrer sieht ganz hbsch aus. Die rote Innenseite passt gut zum schwarzen Rest und die Oberflche ist etwas matter, somit sieht man auch nicht stndig irgendwelche Fingerabdrcke. Insgesamt also eher ein \"Standard-Design\", wie man es bei den meisten Kopfhrer findet. Der Klang ist gut. Insgesamt auf jeden Fall besser als bei meinen alten Taotronics Kopfhrern. Man darf natrlich nicht erwarten, dass man hier den gleichen Sound bekommt, wie bei 500+ Euro Studiokopfhrern. Positiv sticht fr mich die ANC-Leistung heraus. Ich nutze die Kopfhrer in der Regel beim Busfahren oder auch mal auf der Arbeit (Langzeitbaustelle direkt vor der Tr). Es werden deutlich mehr Gerusche herausgefiltert als bisher und im Bus hre ich quasi keinerlei andere Gerusche mehr neben der Musik. Besonders positiv finde ich, dass der Klang der Musik nicht so stark verndert wird, wenn man ANC einschaltet. Die Akkulaufzeit ist auf jeden Fall auch sehr gut. Wobei es natrlich einen Unterschied macht, ob man ANC aktiviert oder nicht. Ich kam bisher auf so etwa 40 Stunden im \"Mixbetrieb\" (also mal ANC aktiviert, mal deaktiviert). Das finde ich vollkommen in Ordnung zumal die Ladung auch fix geht. Im Lieferumfang waren bei mir noch ein normales 3,5mm Klinkekabel dabei und ein Mikro USB Kabel zum aufladen (leider kein Netzteil dazu, aber dies drften die meisten Zuhause haben). Insgesamt kann ich die Kopfhrer empfehlen, wenn man auf der Suche nach einem mittelpreisigen Kopfhrer ist, der ANC mitbringt.\n"}
{"text": "Un casque qui fait le job pour ce niveau de prix et qui le fait plutt bien. La qualit de fabrication et les matriaux employs sont trs bon. L'ensemble est trs bien mont et de plus avec un look rouge et noir trs agrable  lil. On le recharge en micro usb, de l'usb-c aurait t plus au got du jour. Le casque s'utilise en filaire ou sans fil en Bluetooth. La qualit sonore est correcte avec une restitution bonne de l'ensemble du spectre. Les basses sont prsentes et mises en avant. Les aigus sont plus discrtes et l'utilisation d'un galiseur sur votre smartphone me semble indispensable pour rquilibrer l'ensemble. Mais vu le prix de ce casque on peut le classer dans les bonnes surprises pour la qualit sonore. Le plus produit   ce niveau de prix c'est la rduction active de bruit incluse. Elle s'active et se dsactive par un simple bouton sur le casque. Une fois activ les bruits ambiants sont bien rduits et la diffrence avec ou sans est probante. L'effet est beaucoup moins efficace sur les voix qui sont moins bien filtrs. La liaison en Bluetooth avec le tlphone se fait facilement et sans problme. Les boutons sur le casque permettent de commander la rduction de bruit, la mise en marche/arret, le volume, le passage  un morceau musicale, l'activation et dsactivation du mode transparence, le contrle de vos appels tlphoniques. Les plus + bonne qualit de fabrication et des matriaux employs + qualit sonore au rendez-vous + utilisable en Bluetooth ou filaire + pliable pour le rangement + tiens bien sur la tte + mode ambiance pour entendre l'extrieur + bonne autonomie de plus de 40 heures + adaptateur avion inclus + ne sature pas mme  haut volume + bonne qualit sonore des appels tlphoniques Les moins - un peu trop de basses  mon got - rduction de bruit pas au niveau des meilleurs mais ces derniers cotent beaucoup plus chre - compresse un peu les oreilles et le crane sur le long terme - sacoche de transport souple qui ne protge pas suffisamment le casque - charge en micro-usb\n"}
{"text": "Bon casque SuperEQ Bluetooth 5.0. Le son est de bonne qualit pour le prix (de bonnes basses comme j'aime) et il est confortable. Les plastiques ne font pas \"cheap\"'. Une jolie housse souple est fournie pour les ranger. La suppression active du bruit (ANC) est efficace (mais beaucoup moins que sur des casques de grandes marques), dj que passivement la mousse attnue aussi le bruit ambiant. La disposition des boutons est bien pense : on reconnait facilement au toucher le bouton pour rgler le volume des autres boutons. L'appairage est facile et rapide, cependant, mme si on peut jumeler plusieurs appareils, un seul appareil peut tre connect  la fois : si on veut changer de source, Il faut dconnecter l'appareil en cours, puis connecter l'autre appareil. Du coup, si on jongle entre plusieurs appareils (tlphone, tablette...) ce n'est pas trs commode. Le contenu de la boite :  Un cble micro USB pour la recharge du casque, obsolte de nos jours !!   Un cble jack 3,5mm pour la connexion cble, mais fonctionne si batterie charge  Un connecteur double jack pour l'utilisation du casque dans les avions  Une notice qui ne propose pas le Franais Mon fils qui utilise le casque pour regarder des sries sur de multiples supports est trs satisfait du son et de la qualit de ce produit. L'autonomie annonce de plus de 40 heures est trs bonne. C'est un bon rapport qualit/prix, mais trs du que l'USB C ne soit pas de la partie... Jespre que mon commentaire sera utile  votre dcision \n"}
{"text": "Your browser does not support HTML5 video. Ce casque est vraiment excellent.  J'ai aim : - le son : trs bon, les basses sont profondes et au maximum il n'y a pas de saturation - la rduction de bruit active : impressionnant,  le casque sur les oreilles sans musique on entend les bruits extrieur, et une fois la rduction de bruit active (par un bouton trs accessible) ces bruis sattnue... on est dans notre monde. Il est ainsi possible de passer la tondeuse et d'couter la musique. Attention, celle-ci ne sera pas aussi efficace qu'un jabra  400 euros.. mais elle reste trs bonne quand mme. - le micro : de trs bonne qualit, on m'attend parfaitement lorsque je suis au tlphone - les finitions : sont bonnes, les matriaux sont nobles, - le look :  sobre mais une touche rouge  d'originalit - la pochette : pratique, il est inscrit dessus l'adresse mail du SAV.... c'est malin surtout pour une garantie de 2 ans - son cot hybride : fonctionne enbluetooth mais peut se connecter par cble au tlphone et un adaptateur permet de la brancher   un ordinateur  j'ai moins aim : - le fil un peu court : c'est parfait pour un ordi portable mais se sera trop court pour un poste fixe au sol. ce fil ne respire pas le haut de gamme. - a tendance  donner chaud, comme tous ces types de casques - les boutons : mis  part celui de rduction de bruis (celui qui sera le plus utilis) les autres sont top prt les uns des autres... une fois sur les oreilles, on cherchera ces boutons... - l'orientation des couteurs : il aurait fallut pouvoir les plier verticalement, car une fois le casque autour du coup, les couteurs prennent de la place et drangent.  Bilan : Trs bon casque pour la musique  la trs bonne autonomie et au son trs bon. J'ai fait essay la rduction de bruis  ma femme, elle s'est rendue compte que l'on entend rien lorsque l'on porte porte ce casque, du coup, elle ne me parle plus lorsque je l'ai sur les oreilles. C'est tentant de toujours le garder sur la tte.. Super ide cadeau !!!\n"}
{"text": "Ce casque,  la premire vue, de petite taille offre une trs bonne qualit du son. Jaime bien couter de la musique avec elle et couter nimporte quel style de musique. Elle sadapte facilement sur tous les genres. En mme temps, au volume maximal il ny a pas de distorsion du son, il reste toujours de bonne qualit. Le casque peut tre connect  lordinateur ou au smartphone par fil ou par Bluetooth. La connexion est rapide et il ny a pas de problme de frquence. Lisolement est assez bon et il y a galement la possibilit dentendre les bruits de lextrieur quon peut activer  laide dun bouton. Lautonomie est assez impressionnante, le casque pouvant rsister jusqu 40 heures. On oublie mme de le recharger. On peut aussi observer que le casque peut tre pli, donc a peut rentrer facilement dans la poche dune veste dhiver par exemple ou dans une poche extrieure dun sac. Le matriel de fabrication est de bonne qualit et les finitions sont belles. Jaime bien son design avec les couleurs rouge et noir. Au niveau des conversations, le microphone marche trs bien et on entend aussi bien linterlocuteur. Je trouve que le prix nest pas du tout cher, pour cette bonne qualit du son le cout est assez correct.\n"}
{"text": "Test avec un iPad, un iPhone et un Zenforce 4 Casque Bluetooth ou filaire (un fil amovible est inclus). Latout principal de ce casque est la rduction de bruit active  un prix raisonnable. Aucun problme pour faire lappairage, il suffit de rester quelques secondes sur un bouton et on dtecte les couteurs sur le tlphone. Une fois appairs, la connexion se fait trs rapidement avec le tlphone.  La recharge se fait avec un cble USB fourni. Inconvnients :  Le son pas extraornidaire (manque de basse et de dfinition)  arceau un peu rigide et donc pas trs confortable  Finitions un peu cheap Avantages :  la rduction de bruit active fait le boulot (tester avec un aspirateur dans la pice)  lger  Bon look  Possibilit de lutiliser en filaire  Le son nest pas top, mais a reste coutable   conclusions    Entre de gamme pour un casque avec rduction de bruit active. La bonne surprise est que la rduction de bruit est efficace. Evidemment, cela se fait un peu en dpit du reste et il ne faut pas sattendre  un son de grande qualit. Cela dit le casque  des arguments et un bon rapport qualit prix.\n"}
{"text": "Bonjour, Ce casque m'a laiss de bonnes impressions mais a quelques dfauts, assez comprhensibles au regard du prix. Les + du produit : - Bonne rduction de bruit, assez impressionnant a ce niveau de prix. - Son correct au regard de la prestation gnrale et du prix. Ce n'est pas de la Gifi, basses assez prsentes. - Confortables, modle circum auriculaire qui englobe bien les oreilles. - 4 boutons pour diverses actions : volume, play pause, anc on ou off. - Design plutt sympa. - Peut fonctionner en filaire avec anc. Cble fourni. - Grosse autonomie annonce, jusqu' 50 en filaire dans anc, 49 heures en bluetooth avec anc. - Sacoche fournie. Les - du prix : - L'anc est tonnamment performant, mais il gnre un bruit de fond pas trs agrable, vraiment dommage. - Suivant votre tte, vous pourriez peut-tre le sentir vous serrer un peu. Bref, pour le prix, la prestation est plutt bonne avec un anc performant mais avec un bruit de fond. Le son est correct sans plus, suffisant pour un usage basique. Le design et la sacoche indiqu une volont de faire bien, en amliorant un peu le son  il serait trs bon.   LoloSasa  \n"}
{"text": "Ce casque est d'une qualit surprenante  laquelle on ne s'attend pas vu le prix. Les points cls: Qualit sonore: le point le plus important, c'est le point le plus surprenant de ce casque, les amateurs de basses ne seront pas du, pour ma part elles sont un peu trop prsente mais c'est galement facilement ajustable avec une application avec qualiseur. . Ergonomie: C'est le point ou je mettrais un bmol il sert un peu la tte moi qui n'est pourtant pas une grosse tte, heureusement les coussinets d'oreilles sont confortables, l'avantage c'est qu'il tient sur la tte dans toutes les situations. Isolation: La encore une trs bonne impression l'isolation du bruit passive, comme active ce montre efficace, a ce niveau de prix c'est mme excellent. Design: C'est trs russi, l'alliance du rouge et du noir en font casque moderne. En conclusion ce casque mrite amplement ses 5 toiles, c'est un excellent rapport qualit prix.\n"}
{"text": "Ce casque est une bonne alternative aux oreillettes Bluetooth. En effet, avec cette priode bizarre et folle je dois porter des couteurs plus souvent pour travailler et j'avais mal aux oreilles avec mes oreillettes que je mettais. Du coup j'ai tent avec ce casque. Je dois crire qu'en fin de journe je me sens largement mieux : plus de douleurs  mes oreilles, un confort de travail accru. La rduction de bruit active est bluffante, c'est trs efficace. Bien sr, certains casques haut de gamme font mieux (Bose Quiet Confort II par exemple) mais leurs tarifs n'ont  rien voir. Franchement, pour le prix de celui-ci, vous ne serez pas du. Bref, j'y gagne en srnit pour un casque lger, agrable  porter, qui me permet de rester dans ma bulle.\n"}
{"text": "Il s'agit d'un casque sans fil avec rduction de bruit active. La connexion se fait via technologie Bluetooth. Il est sans fil mais on peut tout de mme l'utiliser avec un cordon Jack (cble fourni). C'est un produit de bonne facture, solide, et bien fini. Il a un design plutt sympa, et assez discret. Il est assez confortable, et on peut le porter plusieurs heures sans ressentir de vritable gne. Le son est juste bon, je trouve les basses trop prsentes pour ma part. La rduction de bruit est fonctionnelle. Bref, c'est un produit pas trop mauvais, mais pas exceptionnel. Le prix reste raisonnable mais je m'orienterais pour ma part, pour obtenir une meilleure qualit sonore, vers un casque un peu plus haut de gamme.\n"}
{"text": "Le casque S1 de Super EQ est livr avec un pochette, un cable jack et un adaptateur avion. Le son haute dfinition est agrable surtout quand on regarde un film, dautant plus quil diminue les bruits extrieur je peux donc faire tourner ma machine  laver et regarder mon programme sans tre drang. Plus besoin de quitter le casque pour rpondre au tlphone lorsque je regarde un programme car il est connect sur les 2 appareils en mme temps. Il est fourni avec son cble et une pochette ce qui est pratique pour les dplacements et vu quil se plie il prend peut de place dans mon sac  main. La technologie de reduction de bruit active nest pas optimale, mais  ce prix je trouve que cest trs correcte.\n"}
{"text": "Im in love with these headphones.  I will be purchasing more for my kids.  I use them in my theater room, to work out, at work and while gaming!!! They even cancel out my husbands snoring so I can sleep well!!! Perfect all around\n"}
{"text": "Good quality sound, really got it for the look but they are working very well too. Easy to pair and looks nice, great sound quality and good for noise blocking.\n"}
{"text": "These headphones are great! They sound amazing and the 3 settings for noise cancellation make these better than most. The ambient sound setting is perfect for when you still want to be partially aware of your surroundings. The battery is als long lasting. They can be used for a long time before needing charged.\n"}
{"text": "For the price I was actually surprised. Well built and sound quality is great. I usually use headphones at work and wanted something to drown out sound better. Tried them today and they did the trick.\n"}
{"text": "Iv used them all day and battery still lasts they're way better than this other pair I got and comfortable too. Wish they had cooler colors tho\n"}
{"text": "Great for the money ! The sound and quality will blow you away ! Dont waste your money on expensive Beats headphones. These rival the sound quality of Beats at a much lower price.\n"}
{"text": "They look really nice and the sound is great!  I like that they fit over my ear completely and don't move while I'm on the treadmill.  Great buy!\n"}
{"text": "Sound quality not that good. Has a weird default equalizer that must makes everything sound low bass.\n"}
{"text": "Love these more than expected! Got these for my younger brother and kept them for myself! Super comfortable and great quality\n"}
{"text": "Very amazing product love to use at work.my old one was drain battery too fast and this one I is e2 days in a row with no problem at all\n"}
{"text": "This headphone is sturdy and comfortable.  The build quality really good and the style is attractive. The active noise canceling does a good job of muffling outside noise.  It is perfect to use for people who work at home with many kids running around. The sound quality is fantastic,  it never fell claustrophobic. highly recommend!\n"}
{"text": "I love that I can hear and feel the beats in music where it is meant to be felt. It is covers my ears and when I start to play music, I can't even hear myself when I sing. It is really good and the battery life is long. I had it connected to my device for over 6 hours and it still was playing music. I like the design and material used to make this headset because it doesn't feel cheap and actually makes me enjoy the product.\n"}
{"text": "Headphones looks stylish and sound quality is very good...noise cancellation really works well and dialogues/songs can be heard clearly in lower volumes....pairing with devices is easy and voice calls are pretty clearly audible...only con i see is little bit heavy...overall i am happy with the quality of product\n"}
{"text": "After charging it, I was literally using it for two days and it was still running. The noice cancellation is hybrid not full but its still great. My first noice cancelling headphone and headphones which I spend more than 25 and honestly the best investment so far in headphones.\n"}
{"text": "I love this pair of headphones, they stay on my head really nice not like other headphones that are too tight or too big, these ones adjust nicely, the sound is amazing, the battery life is incredible and they are super stylish. I recommend this headphones to anyone, I am super happy with this purchase.\n"}
{"text": "I bought these head phones to help me concentrate more while I work from home. It does the job quite well. I am happy with the noise cancellation, it is almost impossible to hear anything. Battery life is also sufficient, it goes up to 4-5 hours. The only problem I have is I cannot control where it connects. Sometimes it disconnects while I am using and connects to my phone. But I am not very concerned about this because it is very easy to connect back to my computer. Overall, I think this is a good buy and I would recommend it\n"}
{"text": "I was like looking for nice quality Bluetooth headphones when I came across these. I didnt want to spend hundreds of dollars for the headphone and given its price, I wasnt expecting too much. But these really surprised me. First of all white and red color looks really nice and trendy. Second, the different buttons on the headphone allows you to pair this up with phone / laptop and you can move in between the sounds tracks, answer the phone call, disconnect etc. Third, the quality of the sound is also very nice. All in all, a great purchase!\n"}
{"text": "Great headphones sound quality is really good I have a pair of Sonys  thats was a lot more expensive and these sound better then then I would highly recommend getting these if your looking for a good pair of headphones and dont want to spend a lot of money\n"}
{"text": "The noise cancelling aspect is my favorite part hands down. We watch movies at home occasionally while my kids are watching their own and I barely notice the background noise. Still testing battery life.\n"}
{"text": "I purchased this for my spouse because she was not comfortable with airpods while doing running. She is very happy and found this the best and that matters for me. Sound quality and noise cancellation make this Headphone amazing. Even i tried and found great performance during conversation via phone. Also it is comfort on my head, and  amazing sound processing. I am planning to order another piece for myself too but in Black color.\n"}
{"text": "Un petit casque Bluetooth, facile  transporter avec sa pochette. La rduction de bruit fonctionne correctement, c'est toujours surprenant. L'autonomie est vraiment impressionnante, c'est parfait pour la journe ! Agrable  porter il ne fait pas mal aux oreilles... sauf si vous avez des lunettes, mais le problme se pose tout le temps !\n"}
{"text": "Le son est correct, les basses sont bien prsentes, ainsi que les mdiums aiges ! PAs de dcalage notable entre dialogue et image dans les films, un excellent point ! La fonction ambiant noise est  dconseiller, le son qu'elle produit est vraiment cheap, autant dcaler un couteur d'une oreille... Le noise cancelling est gadget pour moi\n"}
{"text": "Bonne qualit gnrale. Bon confort. Qualit sonore agrable sans tre extraordinaire mais plus que correcte au vu du tarif. Pas de problmes de connectivit. Existe en plusieurs couleurs. Dans la moyenne ct tarif (60  la rdaction de ce commentaire). Bon produit.\n"}
{"text": "Ce casque est assez petit, nanmoins il englobe les oreilles sans problme. La rduction de bruit Active est impressionnante, elle permet de me faire oublier le bruit du mtro sans problme. Le son est assez clair et les basses sont bien prsentes. Pour le prix, il s'agit ici d'un trs bon casque.\n"}
{"text": "Le casque est bien conu, il fait propre, la qualit des matriaux sont trs corrects, le poids en revanche est un peu plus lourd que certains casque mais inspire confiance au niveau de la qualit des matriaux employs. Ce que je regrette dans ce casque c'est le fait qu'il appuie un peu trop aux oreilles, au bout d'un certain temps il devient un peu dsagrable  le porter, peut tre que ma tte n'est pas adapt au casque. Le son est propre, l'appairage se fait trs rapidement et facilement, je n'ai pas rencontr de problme avec l'autonomie, je peux l'utiliser plus de 4h non stop, au del je le recharge systmatiquement (mais il est prvu pour durer plus longtemps que a) Trs beau produit, mais son poids doit tre allg.\n"}
{"text": "Les coussinets sont enveloppants et confortables, on peut le garder un certain temps sur la tte sans trop de gne mais pour moi au bout d'1h30 j'ai d le retirer. Le son est bon, pas de saturation, la rduction de bruit est bien l, un peu de basses. Globalement, l'exprience musicale est bonne mme si ce n'est pas exceptionnelle. La finition du casque est soigne. Il peut  court terme se substituer  un casque d'une gamme au dessus. Par contre, si vous tes comme moi et que vous adorez la musique, il vaut mieux taper sur le dernier Bose ou Sony o le son est exceptionnel. Je le rpte donc pour le prix il n'est pas si mal il a toutes les fonctionnalits que l'ont demande aux casque d'aujourd'hui.\n"}
{"text": "Le modle S1 est beaucoup plus russi au niveau esthtique que le S2 de la marque. L'alliance du rouge et du noir est un savant mlange qui en gnral fonctionne trs bien, comme ici. Sa simplicit d'utilisation et son autonomie relativement gnreuse (45 heures en coute, selon le vendeur) en font un bel alli pour prendre les transports en commun ou voyager par exemple. Une fonction intressante prsente ici est la rduction du bruit ambiant. Il ne faut pas s'attendre  des miracles par rapport  des modles hauts de gamme  plus de 300  mais ici pour un la modique somme de 59,99 , au moment o j'cris ce commentaire, le rendu est vraiment trs satisfaisant, je recommande.\n"}
{"text": "Trs contente de ce casque: - trs jolie - bonne taille, ni trop gros ni trop petit ! - matriaux de bonne qualit il a l'air costaud - pliable donc extrmement pratique pour le transport avec sa petite pochette fourni - il tient trs bien sur la tte mais pour les activits sportives - rechargeable (assez rapidement) -  connexion facile - trs bonne qualit de son - le systme de rduction du bruit n'est pas exceptionnel mais c'est mieux que rien En conclusion, je recommande vivement c'est un casque bien pratique utiliser au quotidien \n"}
{"text": "Esthtiquement russi, bien conu pour tre transport , ce casque est bien comme indiqu : \" hybride\". Ses performances sont trs acceptables avec une rduction des bruits extrieurs pouvant aller jusqu' 33 dB, un son stro de qualit trs correcte, son quipement Bluetooth et une autonomie remarquable de l'ordre de 4 jours. Il est fourni avec tout son quipement ncessaire ; cble USB, cble branchement tlphone,  et une pochette pour transport et rangement. La notice d'utilisation est trs visuelle, fort heureusement, car tous les textes sont en anglais. Un bon compromis propos  un  prix trs raisonnable.\n"}
{"text": "Trs bien emball il est livr avec une pochette de rangement .  Il me convient trs bien, utilisation plutt dans les transports en commun, je n entend pas parler mon voisin sans pour autant mettre le volume au maximum. Le confort est correct, le coussinet enveloppe bien l oreille donc peut tre port un long moment. Pliable et ajustable ce qui est tres pratique, il rentre aisment dans mon sac  main et est peu encombrant. Je l utilise aussi pour faire du sport et reste bien stable. Le moins le fil est un peu court  mon gout. Un bon casque d'entre de gamme . Merci de cliquer si utile .\n"}
{"text": "Un casque filaire avec rduction de bruit d'excellente qualit Il est dot de coussinets rembourrs qui permettent une trs bonne coute et un confort trs agrable quand on le porte Une excellente autonomie de 40 h environ et se charge rapidement Un excellent son, particulirement les basses qui sont trs bonnes La rduction de bruit est plutt bonne Un excellent casque que j'utilise au quotidien depuis quelques temps et qui fonctionne parfaitement bien avec une grande qualit au niveau du son\n"}
{"text": "Bon rapport qualit-prix pour ce casque. A la rception j'ai trouv la bote trs petite... Mais une fois ouverte, j'ai t rassur, on n'est pas sur du casque trs grand, mais a va. Apparaiment simple. Niveau son, a passe aussi. Pour le prix en tous cas, il ne faut pas s'attendre  du haut de gamme, mais c'est convenable. Rduction de bruit de qualit. Je trouve que ce casque est un bon compromis pour un ado, en cas de perte ou de vol, cela fait moins au au porte feuille... Avec une qualit d'coute correcte.\n"}
{"text": "... que pour l'audio  mon avis (ou alors, techno). Les basses sont trs prsentes au dtriment du mdium aigu (les voix sont un peu en retrait). Mais rien de catastrophique  ce niveau de prix. La rduction de bruit est en retrait par rapport aux meilleurs (Sony, B&O, Bose, qui sont 5 fois plus cher), mais a le mrite d'tre propose. Plus confortable que le S2 de la marque (oreillettes plus larges), mais appuie sur les branches de lunettes quand mme.\n"}
{"text": "Super son avec des basses profondes. La connectivit n'est pas immdiate, il faut forcer la reconnaissance bluetooth en appuyant sur un bouton du casque. La rduction de bruit active n'est pas trs efficace, je ne sens pas trop de diffrence avec et sans. Son atout est plutt sur sa compacit pliable et son mode sans fil bluetooth pour un placement prix abordable compar  des grandes marques. Do mes 3 toiles. (vaut plutt 3,5 toiles )\n"}
