{"text": "Hey, it works! This makes for an incredibly easy kit to install in your car. Think of it as your typical light strip with Bluetooth connectivity. They are usually either Bluetooth or WiFi (WiFi giving you smart functions), but WiFi wouldn't quite make sense in this usage. So it's basically like taking a LED BT light strip, cut into four directions, and ran to various locations of your car (typically lighting up the floor ears from underneath the console). It works just like a strip would with your phone, using an app to switch between colors/options. The one thing to keep in mind is USB power in your vehicle. It connects as most anything does inside the car to a USB port (let it be a built-in port or an adapter). The part to keep in mind is if your USB/outlet is powered on with the car or \"always-on\". You'll know if you turn your car off and the lights stay on or not. If they stay on, that means the port/outlet is \"always-on\", which means you will have to manually unplug the kit before getting out the car else it will put a drain on the batter (like anything you would plug into that port/outlet). This is common with any device. It works well and connectivity works well as well. This makes for a user-friendly kit. **If you have found our review helpful, please vote it as helpful below so we know. This helps us to provide quality feedback in the future.\n"}
{"text": "Your browser does not support HTML5 video. Super easy to install. I did have trouble with one of the strips. I had to buy separate adhesive tape to put on the back of it for it to stick under my passenger side. Other than that one strip, all the others stuck very well. Colors are bright and vibrant in the night!\n"}
{"text": "We got these for our college aged son and he loves them. He said they were very easy to install and the app is helpful. It includes 4 light strips with adhesive and relatively long wires. The light is very bright at night and has different color options.\n"}
{"text": "I had put off on installing these car leds as it had been so cold but it's been warmer lately. The strips adhesive sticks very well and there is plenty of wire to place them as you want. They plug into the lighter plug or into the USB port if your car is equipped with that. The lights are bright and the strips are heavy duty made. You can set a single color or allow multiple. The led lights can be made to dance and jump. The light brightness can be adjusted. This is really great if you enjoy attending these quarantine car parades.  Lots of fun but also very useful to see in a dark interior.\n"}
{"text": "Pretty cool lights for the price, really  cant go wrong! Best part is easy install- hubby got a new car and wanted to dress it up a little bit. I didnt want him messing around with any of the electrical components inside of the car .. so these are a great alternative .! And as long as you have good cellphone service they work extremely well! He had them set up and hooked up in under 20 minutes, effortlessly they are really Lots of fun!! Happy with this purchase!\n"}
{"text": "I really love my lights u get 4 in total 2 for the front n 2 for the back the cables are pretty long only problem i had was one would not stick but i ended up getting it to stick over all good product\n"}
{"text": "Overall these are fine and I had a few questions I could find so wanted to leave them here for others.  I wanted one with a UDB type connector so I could still use the cig lighter/accessory port to fast charge my phone when needed as my car's USB ports are kind of slow.  2nd, if the power in your car is switched, they do turn on and off with the car which is nice.  3rd, when they do turn back on, the DO go back to the last used setting. (This was big for me). 4th - forget about the music, you need to have the app open on your phone and then the results are mediocre at best.  I wanted a dim light to add a little elegance and these fit the bill quite cheaply.\n"}
{"text": "I was just browsing stuff, bored, seeing if there wasn't anything I couldn't live without to put in to my new truck, and this light system showed up in suggested items.  I'm so glad it did! I was very wary about it at first.  I mean, hey, it's a custom LED system for only $17, and you usually get what you pay for.  However, since it's Amazon and I felt I could return it if it just wasn't gonna work out, and after reading the plethora of positive reviews on the product, I took the chance.  Even if I didn't get my money back it would break the bank, either. This thing rocks! Wait, let me say that I did go test my truck first, to see if it would kill my battery or if I would always have to unplug the thing every time I turned off my truck, and plug it back in again later, because that would just be lame.  It's important to note that this ONLY works on USB power, and that some USB power is simply always on, especially if you have a USB adapter through a cigarette lighter.  I tested my USB ports and made sure that they received power only when I opened the door to my vehicle, and that they turned off when I exited the vehicle.  And after a few minutes I found out this was true, though the USB stays on for about 30 seconds after turning off the engine or opening the door, but does indeed turn off.  This was key, as I want the lights to come on when I open the door and I want them to turn off and not bleed my battery dry. After that, I made the purchase. The only questions left were: 1) Could I install it well enough to be hidden but still show enough light, and... 2) Would the light system remember the last color I chose or would it reset every time? The item was received quickly and I tested the lights immediately inside the house.  Sure enough, after unplugging the lights and plugging them back in, it remembered the color.  Sweet! The installation was easy, with ample wiring to get to where the lights needed to go with enough extra distance to route the wires so that they'd be hidden.  At least for me.  =) I actually used small, black zip ties for three of the lights, as there really wasn't anywhere flat, smooth, and long enough to stick the lights with the adhesive, and I felt trying to use the adhesive backing wouldn't work in the long term.  I loosely looped the zip ties into circles around little metal bars under the driver's side dash and under the front seats towards the back, then pushed the stick of lights through the circled ties and pulled the ties tight after lightly positioning them to shine in the correct spots.  For the front passenger side, I did have on long flat space low enough that you can't see the underside enough unless you're nearly laying your head on the floorboard, so I used the alcohol pad that came with the light system (very key), let it air dry for a minute, then stuck the lights there firmly for 30 seconds just to be sure a good stick was achieved. These lights, after a day of use, really look fantastic!  They turn on when I open the door, look great while driving (I use either a dark blue or dark purple so it's not so bright at night, or distracting). The music feature for the lights to work with seems to only work if you're playing music from your phone, and the mic feature barely seems to do much and is an odd feature anyhow.  Most of these extra features don't really interest me. But, again, the fact that as long as your USB ports have power that turns on and off appropriately and you're prepared with some zip ties, this system is an ABSOLUTE STEAL for the money!  Super happy I took a chance on these!\n"}
{"text": "Not bad for what you pay. Im going to eventually wire it into a fuse in my car, but got them installed fairly easily and quickly otherwise. The app isnt the easiest thing to use, wish it came with a remote, but I guess thats what you miss when trying to ball on a budget. Good light throw for smaller sized LED lights, but decent 3M tape which stuck to the plastic and the fabric under my seats. Will see how they stack up over time\n"}
{"text": "These car lights are actually very beautiful to have inside your car, especially at night. The sticky adhesive on the back of the lights are sturdy enough to adhere to most flat and smooth surfaces (just not carpet or upholstery). As for the remote control it is an app you download to your phone, and even then the app is kinda weird and hard to set the lights to your specific colors of your choosing. But overall still satisfied with this product.\n"}
{"text": "I really like it so much. Great lights. I thought they were just overpriced ordinary lights, but I was wrong. These lights are super bright and great. The application is very customizable, the colors are also very bright, the product prices are reasonable, and the product prices are reasonable.\n"}
{"text": "Very bright! The double sided tape seems to be doing pretty well. But time will tell. The only thing I dont like is the yellow isnt yellow more green and the white is just all the colors on so rather blue. But you get what you pay for. I wired in a usb to my lights so they auto come on when my lights do and after a few days they work pretty well.\n"}
{"text": "I was so excited to receive these lights to install in my car. When I received the package I opened it up to try them out. I connected everything and plugged it into my usb port and they immediately lit up. This package however did not come with a remote. It comes with instructions to download an app that controls the lights. Satisfied that they work i unplug them and place them back in the box to install after work. Fast forward... I get home and beging placing the lights where I wanted them and only 3 out of 4 would stick in place. When I finally get them in place i plug them in and there's nothing. Thinking maybe I need to power them on from the app, I open the app and try to find a way to power them on but after an hour I gave up. I tried again the following day but still nothing. Needless to say I am very disapointed.\n"}
{"text": "I like to play my music loud and some of the music I like has a lot of bass in it. Somehow the lights doesnt  sync into that type of music , only if the volume is real low. Also, I would like to point something out. In the video ad, it shows that the buyer can easily play their music and go to the mic section and it automatically syncs. In my case its not that easy at all. Every time I play my music and go to the mic my music turns off. When I go to the mic section, then I try to play the music the microphone turns off. I play my music via aux so maybe its different and I understand that sound is actually captured by the Bluetooth block but what I understand the best way to use this is too have another phone playing music and have another phone connected to the lights. If Im doing something wrong please help but other than that  its alright you get what you pay for. Also why does it ask me for my permission for Apple Music yet I dont see any of my Apple Music songs on there?!? Sketchy\n"}
{"text": "The app is a total fraud, the adhesive on each light does not even stick for too long. It wasnt even worth returning, I just threw it away, so it doesnt get handed off to someone else.\n"}
{"text": "Like others was really happy with my purchase initially, everything worked and connected fine instantly. After 2 or 3 days it will no longer connect and is stuck on the last color selected. No matter what I reset or change it will no longer connect. YOU GET WHAT YOU PAY FOR! Not going to bother with a replacement or refund just going to keep the lights and make my own remote to adjust the color.\n"}
{"text": "The adhesive is okay but have to reattach every so often. When I first installed it the Bluetooth would not connect for anything. After uninstalling the app and reinstalling it worked but after a while I noticed my phone was acting weird. I couldnt make or receive phone calls at all they were just dropping. After uninstalling the app I realized that was the issue. The app is poorly made and not very good instructions. Far as going with the music you have to have downloaded music into the app and have it open while using the music feature for it to work. I would have preferred a product with a remote instead of having to download an app that is so poorly made. If all you want is to keep it on the default lights never changing it then this product is for you otherwise I would not recommend.\n"}
{"text": "I've not even pit these in my car yet, but I'm already not the biggest fan.  The colors that show up on the lights are NOT accurate to the color selected on the app. I'm 5 days past the return window, because I had them in the box in my car that was totaled and couldn't get them back in time.  Otherwise I'd be returning for something else. Wouldn't reccomend.\n"}
{"text": "COMPLETE WASTE OF MONEY!!! At first I rated this product a 4/5 but now Ive come back to rate it a 1/5. I wish I was joking when I say this product worked for a solid day or two after that it simply stopped turning on and connecting to my phone. And Im not even the type to complain on here or write bad reviews but this is by far the worst Amazon product Ive received ever. DONT WASTE YOUR TIME OR MONEY\n"}
{"text": "Super cool but they make a weird ringing noise, it's faint but I can hear it with no music on. Also, can't seem to get it to sync to my music but it plays with the weird music preloaded to the app.... overall the vibes are there but hope I can fix the music issue as this is why I bought it.\n"}
{"text": "Lights are good and work just fine. Dont buy if you want your music to play with the lights. Especially if its Bluetooth youre using to play your music. It uses outside sounds and stops your music from playing. Also lights arent that bright. Even at night its really dim. No worries though. For the price its decent.\n"}
{"text": "AMAZING! Easy to install and the adhesive backings are very sturdy! Just wish it changed color to the the sound of music. But the color options are outstanding!\n"}
{"text": "The Bluetooth app worked when it wanted too a regular remote would have been nice. After a couple of weeks somewhere inside the wires it shorted out it would only flicker on green and it became annoying\n"}
{"text": "DO NOT BUY KEEP SCROLLING!!!! DOES NOT WORK, CANT CONNECT TO BLUETOOTH, HAVE TO USE A BROKEN APP, STOPS MUSIC WHEN YOU LEAVE SCREEN, WILL ONLY PLAY ITUNES MUSIC\n"}
{"text": "Great product overall. I wish it was brighter but other than that its easy to install, just plug and play\n"}
{"text": "the adhesion worked for two of the strips, we had to glue the other two strips. the wires were very long so it gave us room to work with, but the app used to control the lights is confusing to understand. once you understand it, its got any color, pattern, gradient, brightness you could ask for\n"}
{"text": "I love the lights the only thing is idk how to hide to wires better\n"}
{"text": "Great product but you have to be close for the remote to work\n"}
{"text": "Cute, light are vibrant and works well.\n"}
{"text": "Ordered these for a birthday gift. So far there hasn't been any complaints. They were easy to hook up & the colors are pretty bright. They shipped real quick as well.\n"}
{"text": "These LED lights dont light up as advertised. Even when you have them on 100% brightness the Colors arent rich, is more like a light color and when all the brightness is up it only lights up as a light with a undertone color. For the price is ok but you can buy better quality ones.\n"}
{"text": "This led's are not reliable. Bluetooth keeps failing even at close range. Not buying these led's again\n"}
{"text": "Your browser does not support HTML5 video. Easy to install. Absolutely love my lights. Only downside is my fianc keeps pulling the wires with his feet and now theyre not sticking much. But Im greatly determined to find another way for them to stick, haha.\n"}
{"text": "Not bad, easy to install, mild color. Enhance the interior feel. Better at night. The effect is mild. The night looks especially good. I feel that driving is very emotional and atmosphere. It's really good. I really recommend it.\n"}
{"text": "Easy to install, sticks well, but not as bright. Colors are nice just could be brighter\n"}
{"text": "The lights are really good however to flash with the beat the song has to be in the app and I like to use YouTube.\n"}
{"text": "Will not stuck keeps falling off\n"}
{"text": "The lights were so easy to install along with the app installation. Everything works great and my friends and family would rather watch movies & listen to music in my car rather than in the house. Lol. Im so thankful for these Amazing LED lights\n"}
{"text": "Color lamp quality is very good, exquisite workmanship, mild light, not dazzling, very warm and beautiful at night. Upgraded to a higher level. I love it! Cool personality!\n"}
{"text": "No sirve no dura nomas me duro 10 dias i empeso a apagarse i parpadear\n"}
{"text": "Theyre nice but dont stick for long. Came off after a week . Now I have to invest in adhesive\n"}
{"text": "The provide a great amount of light, and can be used pretty much anywhere. This is a great addition to your car. Add some fun into your car for very cheap. I'm really enjoying these light strips. I would definitely recommend having these cool little lights in your vehicle!\n"}
{"text": "My daughter loves, loves these lights. I bought them as a surprise and she was thrilled. I installed them in a matter of minutes.\n"}
{"text": "Muy buen artculo todo como indica en la informacin que trae el manual\n"}
{"text": "Doesn't even work!! The app was not connecting to my phone. I couldn't do nothing. Everyone on the app hated it too. Now I have lights attached on the inside of my car that blink ridiculously.\n"}
{"text": "Wires everywhere adhesive sucks lasted 2 day s\n"}
{"text": "Thought I was going to like them more Idea was cool The 3m tape sucks and the wires are too much\n"}
{"text": "Its hard to connect to. Lights are pretty\n"}
{"text": "its not bad i really like that i can control it with an app. only two down falls, 1:its very long 2: the adhesive isnt strong, inside my car one came off within a month.  i used regular clear tape to hold it down since i dont want to waste more money buying a new one.\n"}
{"text": "Horrible not sure why it has so many good reviews. Theres no remote control a d it doesnt stick to felt, also doesnt connect to my phone only downloaded music.\n"}
{"text": "Quality was ok, but Bluetooth and functionality was horrible and cheap\n"}
{"text": "Works awesome!!\n"}
{"text": "Just got here today and put it on , and it fits and works perfect .\n"}
{"text": "Mine didnt come with a usb thing to connect to lights.\n"}
{"text": "Doesnt work with app\n"}
{"text": "Husband loves it!!!!\n"}
{"text": "Lack of instructions and ideas where to install\n"}
{"text": "Good quality, fine workmanship, easy to use and fast\n"}
{"text": "The app doesn't work with my light wtf am I supposed to do\n"}
{"text": "Daughter loves!\n"}
{"text": "love the simplicity of set-up, the brightness is great & the different color options through the phone app are plenteous\n"}
{"text": "Your browser does not support HTML5 video. This is my second time buying. I absolutely love this product. It lights up well when its dark. No battery needed. You can plus it up to your car charger. The adhesive works very well. I bought one for my car and this one is for my little sister car.\n"}
{"text": "Son bought these for his car. Super fun - everyone was impressed how awesome it was for the $$.\n"}
{"text": "Great product, if only the connection wasnt so janky. Bluetooth app controls various vibrant colors and brightness levels. Sticky tape backing to LED light looks like itll hold but couldve been better. Only negative review is the USB connection is very loose fitting and tends to disconnect from the box. Id return for another but Ill just get disappointed\n"}
{"text": "I plugged it into an outlet in my house to try it out before I install it into my car, and each time I wanted to switch the color it made a high-frequency noise... It got the job done though; it can change colors and can be controlled from your phone. If I had to buy a product like this again, I would probably try a different company or brand so it does not make noise.\n"}
{"text": "The adhesion is great however theyre not very bright. You also have to have the music downloaded on to your phone through a certain program for the lights to go with the music. Im also not a fan of the wiring. It was tricky to figure out a way to connect it while making it look clean with cross wiring and such.\n"}
{"text": "Comes in a cheap China made type box.  Incredibly cheaply made set.  Something I'd expect from the oriental trading company.  Wouldnt purchase again.\n"}
{"text": "Wouldn't pair with my phone. No other control. Sent back. Happy with Govee lights.\n"}
{"text": "Not bad to add a little fun in the car. But Im still learning how to use it.\n"}
{"text": "Super great lights. Very easy to install in my car and the apps super easy to set up and use. Lots and lots of amazing features on the app which make it so much cooler. Lights look amazing at night. Super great overall and I really enjoy them.\n"}
{"text": "Your browser does not support HTML5 video. Muy buena\n"}
{"text": "What is the app called flap I can switch the colors ?\n"}
{"text": "I dislike how you cant play the music you want on it\n"}
{"text": "Works well!\n"}
{"text": "Will not connect.\n"}
{"text": "The functions are pretty terrible. The app is worthless.\n"}
{"text": "It started to fall off two weeks after applying\n"}
{"text": "Very easy to install, great product so far\n"}
{"text": "I like it works good for me\n"}
{"text": "Easy to install. Hoping they last :)\n"}
{"text": "color is great but the app is kinda bad. hard to change colors and keep connected\n"}
{"text": "Will NOT work syncing up to audio!\n"}
{"text": "The remote doesnt really connect to my music and the instructions were very complicated\n"}
{"text": "its not very sticky\n"}
{"text": "The adhesive is really bad. Wont stick to your car at all\n"}
{"text": "They dont stick at all. Didnt have them for a month and i had to throw them out .\n"}
{"text": "Didnt stick and very unhappy\n"}
{"text": "Your browser does not support HTML5 video. I love it recommended.\n"}
{"text": "They didnt stick for longer then a week came with the wires ripped open already\n"}
{"text": "Great product. The only downside is the strips dont stay long.\n"}
{"text": "Quick and easy to install. Must try\n"}
{"text": "Gave a new look to the interiors of my car....\n"}
{"text": "So there are many pros and cons about this product: Pros: The light is bright and adjustable. There are many options and features to choose from (color, mode, type) Easy to Install, great cord length design (one USB) Bluetooth app Cons: Says the is \"music sync\" but music sync is just the app's music sync with lights. this means that you cant music sync with your own songs but songs on the app. Lights don't turn off by its self have to use the app to manually turn it off.\n"}
{"text": "Very small, with convenient, multiple patterns, bright and lovely, creating a good atmosphere effect. I like it so much. I highly recommend it! Easy to use and fun, ha ha\n"}
{"text": "Your browser does not support HTML5 video. What an amazing product, all controlled by your phone. Just a quick download in  LED app on play store. So many options in colours to choose on achieving on what you are looking for. From colour, brightness, colour patterns,  these are some of the options. Installation is a peel and stick system.  4 led lights have a adhesive on the back so you can attach anywhere.  This product has a USB power source which is exactly what I was looking for my Tesla. My kids love this and quite frankly so do I.\n"}
{"text": "its a good fit to my ram 1500. 3m adhesive at the back for the light strip which makes the installation proscess much more easier. you dont see it very bright during the day time. But its absolutely beautiful in the dark. very satisfied with the product.\n"}
{"text": "They only stuck for a while and then started to fall off, but other than that the app was super easy to set up it took like a minute and the lights were very bright. Just wish they actually stuck\n"}
{"text": "its amazing that just fit to my car. it make more fancy to my cars interior. Its 64 RGB adjustable LED light. Good product that worth to own it.\n"}
{"text": "je l apporte partout dans auto maison et bateau\n"}
{"text": "There great easy to install and use love them\n"}
{"text": "Je jours on ne voie pas la couleur mais sinon super vraiment \n"}
{"text": "Your browser does not support HTML5 video. Easy to install like plug en play\n"}
{"text": "The cable is long enough to install to backseat.\n"}
{"text": "Adhrence difficile\n"}
{"text": "Thank you so much Is amazing\n"}
{"text": "Didnt come with a remote. They dont stick very will. I had to buy Velcro to put them in the car. They also didnt stick to the felt that was in the back seat. It also doesnt connect with your phone that well; but its okay. It also only plays Apple Music and not Spotify which sucks. Theres also a lot of cord. Kinda hard to install since I had to buy Velcro. But the lights are nice and bright and I like how you can adjust the brightness.\n"}
{"text": "Well, there well made looks good but only thing is I put them in my 2017 Dodge Ram rebel an it throws off my tire monitor system, what a pos ! If it wasnt a good make I would be returning it for sure !! Very disappointed!\n"}
{"text": "Doesnt connect to Bluetooth, Bluetooth does not work also no remote. Lights just blink non-stop cant turn on/off. No Controls\n"}
{"text": "The glue was crap..it was a gift for my 3 sons car...the just couldn't make it work. .we're disappointed.\n"}
{"text": "did not have a remote and did not stick, I had to buy crazy glue ... I can only control it by the application. A little disappointed for what I paid\n"}
{"text": "This product did not work. It would not connect to Bluetooth. The app does not work. And the lights are nearly impossible to see. Not to mention the box doesnt come with any instructions or anything. Just the lights. They are not with the money. You can find better for MUCH cheaper. This is my second review as they deleted my first bad one.\n"}
{"text": "I love the idea of these. There is a ringing sound that comes from the lights. If my music is loud enough then I cannot hear the ringing sound. The lights only move to the music thats on the app. I wish it would move to the music on Apple Music for example. The USB port is very very cheap. Mine broke in less than a week. I now need to buy a new USB port. My lights are not working at the moment because of that. Oh and the lights on one strip fell out completely. I have to constantly shove them back into the plastic strip. These are cheap. So the quality is as well.\n"}
{"text": "Easy to install, uaed adhesive from a better brand bc it didn't stick well. However it's been a few months and they wont power on anymore... disappointed\n"}
{"text": "Easy to install. Cords are long enough to tuck and hide. Took 10 minutes to install. They could be a little brighter, but I guess so it does not distract.\n"}
{"text": "These work great! The brightness is perfect and adjustable. I will be purchasing more. Do use a heat gun to warm up the peel and stick adhesion. It will work and last longer!\n"}
{"text": "I like em they look good for the most part work good. If the box is hidden it womt work. Idk deff some negative things about it but for what I paid. Totally worth it.\n"}
{"text": "These are easy enough to install, however when it came to the Bluetooth I still have yet to get it to connect to be able to use all the different colors or have it play to music.\n"}
{"text": "Good lights, app takes a bit to navigate. One of the front strips was not very sticky but hoping it will seal better over time.\n"}
{"text": "Its a good product in terms of lights and being pretty in your car but you just have to know its connected via Bluetooth so you cant connect things like your music to the car as well\n"}
{"text": "Had some trouble installing but once installed it seemed to work. Didn't work for a long time and now doesn't work at all\n"}
{"text": "Good product!\n"}
{"text": "Makes too much noise.\n"}
{"text": "The remote control app doesnt work at all. Freezes crashes and doesnt work. The lights were great but theres no way to control it.\n"}
{"text": "Works good the app work too\n"}
{"text": "Nice\n"}
{"text": "Took me a second to figure it out but u got it and they work perfectly\n"}
{"text": "I love to recommend for my friends as well and it is very good and easy to install\n"}
{"text": "Very easy to install\n"}
{"text": "Horrible\n"}
{"text": "Your browser does not support HTML5 video. worked better than aunty expected.\n"}
{"text": "Two out of four didnt stick to my car. The remote is an app that mostly in Chinese.\n"}
{"text": "Im so impressed with these lights! For $12 the packaging was nice, adhesion was great, super simple to install. Ill post a picture at night so you can see the brightness, but an absolute great deal! Im thoroughly impressed!\n"}
{"text": "These are great. Easy to install. I feel good about cars. I always see cars modified with lights like this, but this is plug and play. Super easy. Recommended, good product\n"}
{"text": "The installation is particularly convenient, it can have gradual change, jump, music breathing light and other modes. It looks very beautiful at night. I feel that driving is very emotional and atmosphere, really great!\n"}
{"text": "I thought it was good, so I bought it and loaded it. As a result, the light color was very good. The effect was very good. I was satisfied with the shopping\n"}
{"text": "After receiving it, I tried it. The quality is very good. It is very good. The installation is simple. The effect is very atmospheric. The color is also good. It's better than you think. You can do what you want\n"}
{"text": "Your browser does not support HTML5 video. this is literally exactly what i want. its not so fluffy that i cant see, but its so soft i cant stop touching it. BUY THIS!\n"}
{"text": "I love it! Easy to install, only took me about 5-10 minutes. I do wish that the lights were brighter and there were better music options but overall I love this product\n"}
{"text": "Very bright and has 4 light bars decent sized strips and super bright and so many color options love love love\n"}
{"text": "The cable is not long enough to hold one side. The only way to connect the cable is in the central console, which will provide you with sufficient cable utilization. Very satisfied.\n"}
{"text": "waste of time / easy to install (so much cord tho) / lights were fine but the brighter you make them, the begin to make an annoying ringing sound / I didn't have it for 12h before i returned it\n"}
{"text": "I was very excited for this. It was working fine till the time i didn't installed. Once i fix it with my car all of a sudden it stop working. It is getting supply but LED is not working. Just do one favor please return my money.\n"}
{"text": "There is no instructions on how to make the 'custom' light setup or any instructions at all for that matter. So while it works, I can't make it work the way I would like. And I am not a newbie to these types of items. Frustrated and disappointed with lack of info.\n"}
{"text": "loud humming coming from device, the USB part would break open, and the soldering points have seperated making it unusable, this item sat it the same spot and it did t last longer then 2 months\n"}
{"text": "I was so excited about these but they lasted a week and continuously kept falling down and having them on the drivers side while driving falling is super unsafe so Im kind of disappointed that I inky got to use them a few times it needs a better stick\n"}
{"text": "It worked when I first tried it. Then it stopped working. I have been struggling get it to working again with that app. Then I realized its just a waste of money and time\n"}
{"text": "I didn't get a remote\n"}
{"text": "low quality.  only lasted a month.  I do not recommend.\n"}
{"text": "Wouldn't connect to a newer phone after three hours of messing with it I finally gave up so I used my buddies galaxy s7 and it would only connect to that none of my other buddies newer phones\n"}
{"text": "This item is pretty cool and fun. But the the adhesive could be better grade and the remote, unable to change colors. Worked a few times and now nothing.  Overall, I love it.\n"}
{"text": "Lights arent bright enough for me, and lights dont sync with music, the mic on the app isnt useful, unless you wanna play music off your radio am/GM radio, and too many wires are too long.\n"}
{"text": "Great!!!!!!\n"}
{"text": "The app works pretty well. I just wish the lights were brighter. Also, the white that is preset in the app, is more of a light turquoise color. But otherwise, theyre good for what they are.\n"}
{"text": "Easy to install but they wont contact to my phone properly so I cant change the color it stays green\n"}
{"text": "Lights up, app works some times, lights randomly start blinking fir no reason, even when the settings for it to stay on....  get what you pay for...\n"}
{"text": "Amazing and easy to install\n"}
{"text": "Love the colors and all but you have to add more file yourself Bc it wont stay up with what it came with\n"}
{"text": "Not Bright Enough For Show. Buy Another Product If You Want It to Pop My Phone Is Brighter Than This\n"}
{"text": "Don't waste your money!!! Not bright enough\n"}
{"text": "Love the lights, makes my new car even newer and awesome. Will buy more\n"}
{"text": "USB came apart. I tried gluing it back worked for about a week then lights didn't come on again.\n"}
{"text": "These are amazing! The only thing I was hoping for was the lights to go along with my actual music. But other than that so far so good!\n"}
{"text": "The lights work, but with the control it doesn't work that well. I connected it to the bluetooth, it was working but at some point I had no control of the lights.\n"}
{"text": "I thought it would bounce to my music but you can only pick a select amount of songs in app\n"}
{"text": "Easy to hide the wires and change color so perfect for sunset drives, could honestly place them anywhere and youll get good lighting.\n"}
{"text": "The adhesive is pretty weak so I recommend buying a special kind of adhesive to stick it pretty well\n"}
{"text": "Not bright at all. can barely see the lights unless it is dark outside. Brightness is all the way up and you can barely tell they are there.\n"}
{"text": "The app is kind of confusing but I still love it\n"}
{"text": "Got these for my bf to spice up his car and he is in love with them! The lights have a good brightness and changing colors is easy with the remote! It was easy to install, just a sticky adhesive! Hes had them for over a month and so far so good! Looks so cool at night!\n"}
{"text": "This regulation of the atmosphere in the car is very good, increase the fun of driving, driving the car at night will not feel so boring, driving at the same time to some music that is perfect.\n"}
{"text": "Good\n"}
{"text": "Very easy to install and the app is very helpful. It includes 4 light strips with adhesive and relatively long wires. The lights at night are very bright, and there are different color options. There is plenty of light, but not too distracting. Love these cool lights\n"}
{"text": "Se ven bien y funcionan a la perfeccion. La instalacion es facil\n"}
{"text": "These lights can change the whole atmosphere in my car.The ability to change colors through a mobile app eliminates the hassle of having to maintain a separate, late-responding remote control.\n"}
{"text": "so cool! These lights make me very satisfied with the car and they look really good. If you want to add cool features to your car, you should definitely buy this product. A very good buying experience, I will continue to recommend it to my friends!\n"}
{"text": "Husband bought a new car, and you cant go wrong with cool lights! The best part is the ease of installation-I want to dress it up a bit. These are interesting! And as long as you have a good mobile phone service, the job is very good! Satisfied with this purchase!\n"}
{"text": "The product quality is very good, and the photo is also very good, very good-looking, the installation is very simple, very like. It's a good atmosphere. I'll come back when I need to\n"}
{"text": "Very good quality product. I buy other strips leds in the past but not like this. It comes like you can see in the pictures with ties and screws. They got everything you need to brighten your car.\n"}
{"text": "The app sucks! It only plays music that come in the app not music you play.\n"}
{"text": "Product was purchased as a gift for my daughter. Was easy to install but was missing the USB power cord which plugs into the car from the back of the box. Only option is to return item back to Amazon.\n"}
{"text": "Easy to install and definitely bright enough, but I only had them plugged in and running for maybe an hour and they just went out. The power box and plug are a little wonky and cheap feeling. Definitely wont be buying them again!\n"}
{"text": "Its so much fun to drive at night now bc the leds are so bright and flashy!\n"}
{"text": "All the instructions are in Chinese I mean really! Shipping was quick and got what I ordered but now I understand why most get a remote instead of Bluetooth with phone.\n"}
{"text": "I was happy some what with these light besides the brightness ( I thought they would be brighter) until the next day they didnt work anymore!!!! So in my opinion they are trash if they only lasted 24 hours.\n"}
{"text": "When we got these set up in the car and set up the app to change colors the lights will only show greens and blues, we try to set it to reds and purples and pinks and it will only shine green or blue. Very disappointed.\n"}
{"text": "These were actually not that hard to install. Adhesion i still have yet to find out how long they will last. However the only downside is the brightness. I wish these were brighter as shown on pictures.\n"}
{"text": "Very good, easy to install, the effect is very atmospheric, color selection is also good. A very good atmosphere lamp! The effect is beautiful! Very satisfied, friends in need are worth buying!\n"}
{"text": "Thought it would be difficult, however its very easy to install and figure out\n"}
{"text": "I would have gave it a 5 star but the lights are not as bright as the video shown on here\n"}
{"text": "These lights look great in my car!These interior strip led car lights are quite awesome, not only do the blink to music but the can change various colors with remote control.\n"}
{"text": "Simple installation, mild color. The effect is mild and can change color with the sound. Multiple modes enhance the interior feel. Better at night\n"}
{"text": "Simple installation, mild color. Enhance the interior feel. It can change color with the sound. Multi mode, better effect at night.\n"}
{"text": "Not like I intended  but not to bad\n"}
{"text": "The product is good and is exactly like the picture\n"}
{"text": "It doesnt work at all ! I want a refund ! Dont not buy these lights !\n"}
{"text": "they are my grand daughter\n"}
{"text": "My son loves them! Easy to install. Wires are thin enough to hide.\n"}
{"text": "Your browser does not support HTML5 video. Well I just got them and they seem to work fine. I do unplug them since they seems to work even after my car turns off. Its still early spring weather and so far the adhesive seems to be sticking.\n"}
{"text": "the strips make a high pitched ringing/whining sound when on. You can hear it even over music and it does NOT stop with motion, different colors, changing of where/how the device is plugged in. I'll see if it goes away with time but currently.. 1 Star because it's just blatantly obnoxious and annoying.\n"}
{"text": "Lights look amazing awesome colors great response and all from your phone and easy to install didnt give me a app name to install but gave me a photo and was still able to find it easily only problem is the music sync so the lights can match the beat of your music, you arent able to play music and listen to the music at the same time if your playing the music from your phone then the mic will turn off and the sync will stop other than that very satisfied your able to make your own custom colors or you can pick a color from the color wheel so large range of colors and still bright\n"}
{"text": "The car light are very bright at night & the simple strip is easy to hide behind or under car compartments. The app itself has lots of modes & colors with a lot of control over brightness , tempo, & patterns. I recommend pairing these lights with more adhesion strips. Easy to turn off if you wish by taking out the usb charger. Make sure your car is clean, the bright lights show lots of detail at night.\n"}
{"text": "Got these for my daughters car. She loves them. They were super easy to install, bright, and good value. Only thing that I dont like is that its not lightening up to her music, its just regularly lit up but it bounces and does cool stuff for the preprogrammed music on the app you have to download to use the lights.\n"}
{"text": "The lights are very bright and stick nicely, and I live the range of modes the app gives, however, for the music mode, you need downloaded music. At first I thought that wouldnt be a problem considering I have music downloaded. The only issue they fail to mention is that it seems to have to be purchased music, so things like Apple Music wont work. To fix this I suggest adding more variety to the downloadable or allow a search bar so people can choose what music they like.\n"}
{"text": "The reason I gave it 3 out of 5 is because it doesnt connected while with my music as well. The app does well and the lights are bright. You well have to turn on the lights everytime.\n"}
{"text": "App controls the colors, easy to use, easy to install.  Needed to get some double sided tape because the factory strip started leaking off within the first month but, that was a cheep, easy fix.\n"}
{"text": "These are currently awful. Apparently with the new iphone update they wont even connect, so shame on them for selling as of right now. Stuck with useless lights and I wish I could just be refunded. Such a waste. Either fix connectivity issues and the app interface (also pretty bad) or dont expect to sell.\n"}
{"text": "Love it! Adhesive didn't work good. Had to do something different\n"}
{"text": "The first time I bought this one, I installed it and tried it. I felt it was very good. It can set off the atmosphere in the car. Driving at night is a kind of enjoyment. I'm very satisfied\n"}
{"text": "High cost performance, very practical, highly recommended. Sensitive response, light induction is also very good, really good effect at night! It's pretty. Value for money\n"}
{"text": "easy to install and the wires are easy to hide. looks good\n"}
{"text": "Easy to install. Adhesion is cheap and doesnt stick.\n"}
{"text": "Your browser does not support HTML5 video. I bought this because I wanted lights in my car, very cool at night! Very easy to gather but putting in your car might just be the harder part.  I tried using the app for the lights and to make the music light up together you need music downloaded  in your phone and dont have that, but still works when light up.\n"}
{"text": "Had been looking for lights for my Kia Optima. These worked amazing. They were easy to use and apply. The app that it comes with makes it easy to change the colors and do other cool things with it. Overall pretty good light for a even better price.\n"}
{"text": "It stuck easy the cords hid in the center plastic piece perfectly and it looks professionally installed  when I was all done I tucked the remaining wires between the seat and the console and ran the USB to my center cubby where I have a cigarette USB charger outlet. The tutorial was a bit odd but overall easy to figure out had it all in and running in 20 mins \n"}
{"text": "Gifted to my sons girlfriend for her sweet 16! She immediately installed in her car and loves how it looks!\n"}
{"text": "The only really big thing was that you cant listen to music on Spotify or any other music app with the lights app open at the same time. If you want the light to go with music then you have to download music onto your phone for that to work but besides not being able to listen to music on your desired music app the lights are ok themselves\n"}
{"text": "These lights was really easy to install Ive had them for about two months and I have no problem with them the app is really easy to work they dont go with the music tho. The wires is easily hidden well\n"}
{"text": "\n"}
{"text": "The effect is good. I want it. It's very nice to open at night. I like it very much. Product is very beautiful, a artifact, very satisfied with a shopping\n"}
{"text": "The product is very good, very satisfied with a shopping. It's not interesting to drive at night. It's very beautiful and easy to use. It's worth buying\n"}
{"text": "Not bad, easy to install, mild color. Enhance the interior feel. Better at night. The installation is simple, the material is very good, I really recommend to buy.\n"}
{"text": "The lighting effect is very good. Super bright. Many color choices and options are available. Easy to install, just peel and paste. Recommended\n"}
{"text": "I was satisfied until the other side of my car wouldnt stick on just because i removed it once and it lost the glue & wouldnt stick on anymore...\n"}
{"text": "Can't wait to install it, very good, the effect is very good, if it is night should be more beautiful. It's romantic. It'll come back when you need it\n"}
{"text": "Installation is simple, the effect is very atmospheric, color selection is also good. A very good atmosphere lamp! Friends in need are worth buying!\n"}
{"text": "Very easy to install ! I love the lights ! The only thing i dislike is i wasnt able to get the lights to go along with my music on my iPhone.\n"}
{"text": "Great product no problems with it very easy to install.These aren't too bright too distract you while driving and are also bright enough to notice they are there.\n"}
{"text": "Very nice. Only thing I had a problem with is that it does not have an option for the color white for whatever reason. Not a big deal though. Very pretty and customizable.\n"}
{"text": "Sticky for now.... Definetly needs glue maintenance regularly but the bright neon light mesmerizing\n"}
{"text": "You can't go wrong with these beautiful LED lights. I can assure you with certainty that they will make any car look cooler. I like these things. You can adjust the colors and settings. I would definitely recommend these to everyone, I am glad I installed these LED lights for my car, it is definitely a good choice.\n"}
{"text": "Its super cool , wish it had more colors but when nighttime rolls around and your feet are glowing its hella dope\n"}
{"text": "Super bright and interactive when put on mic mode.  I am sure there are better ones out there but this are well worth the money.\n"}
{"text": "Your browser does not support HTML5 video. Better than expected.\n"}
{"text": "Not for a 16 year old to install\n"}
{"text": "Makes driving at night more fun.\n"}
{"text": "The app sucks ass. Doesn't work well at all. Sometimes take a while to connect. For some reason, if you leave the lights plugged in, they will come on automatically when the car is off and the app is shut off\n"}
{"text": "The lights are great but they will not stone to your own personal music you can either listen to your xm radio while youre phones mic  listens and strobes the light or listen to the apps pre selected music but but cant listen to your personal BT music and have your phone mic stove the music at the same time!!!\n"}
{"text": "Was a little confusing to connect to your phone but overall love the product.\n"}
{"text": "Very good quality product.So easy to install and use. Really lifts the interior.Really impressed with this product.\n"}
{"text": "It's easy for an install but the tape.. Does not stick well.\n"}
{"text": "Nice bright and responsive and install is easy plenty of wire for the job\n"}
{"text": "I thought the lights would blink with the music beat. Thats one think I don't like about it.\n"}
{"text": "Bright , could be a little better with the music system and the color changing\n"}
{"text": "Esta genial poder usarlos con la app\n"}
{"text": "it was way too difficult to get it set up.\n"}
{"text": "its great\n"}
{"text": "AWFUL. LOSES STICK IN 2 DAYS. CHEAP PRODUCT FROM CHINA\n"}
{"text": "These lights are good and all but I didnt know you have to already downloaded music to your phone. So I personally would like these go with music playing from apps like Spotify\n"}
{"text": "Color could be brighter but its good value for what you pay. I keep it on at all times and the darker it gets the more you see it. Cool addition\n"}
{"text": "Disappointing. They only lasted 2 days. They completely went out after having them on for less than 30 total minutes.\n"}
{"text": "I have deleted and reinstalled the app multiple times and it still will not connect to the lights. I have read every forum post on the app and they still dont work. Low quality, spend money else where!\n"}
{"text": "They dont stick the best but Im going to try fixing it with some double sided tape or glue. And the brightness isnt the best but a pretty good deal for the price.\n"}
{"text": "These light brighten up the inside of the car.  People always make comments about them and some have ordered the lights.\n"}
{"text": "Just get it its pretty cool might have to use double sided tape but other than that its pretty satisfying\n"}
{"text": "Is not as bright as the description says it would be and its definitely not the Bluetooth on I ordered its just a usb amd its one solid color which is blue\n"}
{"text": "the reason I gave it 2 stars is because the app doesn't work properly to change the colors...its been green since I installed it\n"}
{"text": "Cant connect to music\n"}
