{"text": "This isn't a sweatshirt, more like a slightly heavier t-shirt.  The colors are really pretty. I didn't realize that it had puffy sleeves until I received it. Puffy sleeves aren't very flattering on my body (athletic build with broad shoulders). The sleeves were also a little short for my liking. I'm keeping it because it matches a pair of yellow jeans I have , but won't be wearing it on a regular basis.\n"}
{"text": "I purchased this thinking the darker color was gray, its a purple color. I think the different in color is because of the slick/slinky material? Either way, its not pink and gray, its pink and purple. The bottom is hemmed, not like the undone look shown in the photo. The shirt is NOT a soft cotton feel. I dont hate it, but its definitely not what I wanted.\n"}
{"text": "Was not what I was expecting. The fabric was very different from what I had thought it'd be. It reminded me of the same type of fabric that's used for exercise clothing if that makes any sense. Also, it was way too small! And I KNOW that I haven't gotten THAT fat yet! So to anyone who might be ordering, save yourself the trouble of having to send your item back & remember that the sizes seem to run small. I'm bummed because I really fell in love with this top when I saw it. Obviously I'm going to have to send it back. \n"}
{"text": "I was thrilled with the fit.  At 4'10\" and about 125 lb. it's not easy to get the perfect fit. I liked that I could adjust the height at the shoulder with the buttons.  I expect that someone with more normal height would find it short and maybe that's the way it's supposed to fit, but at the age of 74 I don't wear anything above the knee, so the length was perfect.  I'm so glad I ordered 2 of them....one in white and one in pale yellow.  The fabric is heavier than I expected but it's still cool enough in 100 degree (F) heat.  I've had many, many compliments on it.  I wouldn't hesitate to buy it again.\n"}
{"text": "Not as flattering as i hoped but i think it's just by body type. in terms of thickness, it's a thin sweatshirt.\n"}
{"text": "This was one of my first amazon fashion finds and I am not disappointed!  This light weight, comfortable tie dye shirt is 100% worth every penny.  This tip is great styled with leggings or a pair of shorts. You wont go wrong with this buy!\n"}
{"text": "This sweatshirt was so cute when I saw it... it arrived and I immediately tried it on. It is not like a typical sweatshirt material at all. It does not stretch or give... it isnt soft either. I am disappointed for sure. There is a waistline hem that is too tight as well. I usually wear an xl but I feel this sweatshirt runs small. I gave it to my 18 year old daughter. Pretty bummed.\n"}
{"text": "Not a sweatshirt very thin and cuffs ugly I could see it in the picture now I didnt notice it when I was ordering but then when I got it very cheaply made beware\n"}
{"text": "I ordered a 2XL which as you can see is way too big. I normally wear a large to extra-large and a department store purchase but when getting stuff from China I always know to order a lot bigger sizes but not in this case! The fabric is a polyester, smooth shinny but stretchy finish. The color was described as red but it is definitely more of a brown to brick red color with light blue and white.\n"}
{"text": "This shirt smells so bad! Reminds me of my great grandmothers house. I have washed it  3 times and it doesnt go away! I put it in my closet at one point, hoping it would fade with time, but instead it spread its awefulness to the sweater on either side of it.  Horrible! Ive never even gotten to try it on. It will be going in the trash.\n"}
{"text": "I truly wanted this sweatshirt to work. However, the sweatshirt sleeves were too loose and the middle was too tight. I have a little bit of a muffin top lower belly. It made me look fat. Im so bummed because I wanted to like this sweatshirt and liked the tie dye colors. Im returning it. Its one of those tops you wish you tried on before purchasing it .\n"}
{"text": "First, this was called a sweatshirt. While it  had sweatshirt styling, the fabric is more equivalent to a heavy T shirt. Second, if you want it to fit like the picture, you need to size up. I ordered the appropriate size for my measurements. It fits close to the body at the bust line, and the band at the bottom is too tight to hang down over my hips.\n"}
{"text": "I bought two from this seller and one fits great and I never tried the other one on until today. It is like if it is a whole size smaller and I am 1 day past the return window. Not very happy...but on another note the sweatshirts are nice.\n"}
{"text": "I do like the comfort of it, I am disappointed because it does not look like the picture for the most part. It is the same colors but I was looking for something like the picture. I was hoping for less white in the middle. Also the texture of it isnt what I expected, although it still does feel good.\n"}
{"text": "Ok. The colors isbwhatbsaved this review. Very pretty. But they run small and it's a weird fabric. If this was cotton and I'd buy every color. Just don't dig the material. The bottom doesn't flow. It's kinda tight so it sits on your hips. I like long and baggy comfortable. Not a total loss. They are pretty. Just not for me.\n"}
{"text": "I had a feeling this would be a cotton lined satin. More slick than soft. Don't wear around campfire.  It will melt . I am a 16 with DD. I should have ordered the 2xl. Cute But I want a cozy rainy day cotton\n"}
{"text": "I loved the colors on this top but I hated the fit. Material was soft but I would not consider it a sweatshirt. More like a long sleeve top... and the sleeves were longggg. I wish the entire shirt had an oversized and relaxed fit but the shirt fit like normal except for the super long and baggy sleeves which make it not very flattering. It is disappointing because the colors are so amazing.\n"}
{"text": "(SENDING BACK) THESE ARE REALLY CUTE LOOKING, SORTA WARM WITH  A THIN LINER....BUT RUNS SMALL FOR AN XXL..NO DIRECTIONS AT ALL ON HOW TO WASH IT.. WHY OH WHY CAN'T THINGS BE MADE IN USA??????\n"}
{"text": "Not sweatshirt material.  My experience is that this type of material actually runs small especially in hip.  Also if you are short with larger hip, this will not fit.\n"}
{"text": "Fabric NOT as expected. It looks like a regular sweatshirt material in the pictures, but it's actually an athletic/gym short type material with netting on the inside. The seam around the wrists is also really uncomfortable and the neck is wide. The color does look pretty though but I'm returning it because of the material.\n"}
{"text": "Not what I expected. Feels like a shirt off Wish. Its very thin which is nice for fall. On its not very flattering. Sticks to my furniture. At least it didnt cost much.\n"}
{"text": "I dont like the material (shiny polyester). I also think the sleeves are too long and you cant even fold them or push them up. Just a weird material & fit.  Not flattering at all on me.\n"}
{"text": "Unfortunately this was not as described in the title of the product or the description. This is NOT a sweatshirt! What you get is a t-shirt that is not tie-dyed; the tie dye image is printed onto the shirt. Such a bummer :(\n"}
{"text": "This top is so great color wise...  But the neck on it was huge!  It was totally mis-proportioned to the rest of the top. Much to my dismay, I returned it.\n"}
{"text": "The top portion fits fine except at the waist band then it was made smaller and the material doesnt stretch.\n"}
{"text": "This is not a tie dye print. It's more like a photocopied print of a tie dyed fabric on the slimiest, most synthetic fabric you've ever felt. Do not recommend.\n"}
{"text": "Cute top - but it doesnt wash well. The fabric pilled and the shirt looked old and ratty after just a few washes.\n"}
{"text": "Not really thick like a sweatshirt. It is much thinner than that. I usually wear a large but could have easily ordered down to a medium.  The large will ensure im covered completely if wore with leggings. Roomy and comfy.\n"}
{"text": "Not as baggie as the photo makes it seem. The sweater is soft and good quality but it seems as if the product was printed on it is not the color of the fabric.\n"}
{"text": "It was really soft. The colors were pretty, just like they were shown. But, the bottom was too tight for a large woman even though I bought a 2X. Had to give it away to a girl who normally wears a Large. Exchanging wasn't possible. They were out of stock.\n"}
{"text": "Love the top and the great colors blended together!!  I did feel it runs a little large/roomy but I could deal with it because I am large too and it is the style of the top!  Nice fabric, quality and comfort and very complimentry!!!!\n"}
{"text": "Super cute and youthful! I love it because its comfortable and stylish! Looks great with leggings....I upsized to go for the oversized look with black leggings. Great for running errands and mom on the go or college student. Only wish it had a peekaboo opening for breastfeeding...that would be perfect because its so hard to find stylish nursing outfits.\n"}
{"text": "Says sweatshirt, it is not!!! Some nylon polyester material, band on bottom is snug and sleeves are very long! Not flattering or cozy like expected!\n"}
{"text": "Product or sweatshirt is adorable online. I finally ordered and received it. The material wasnt all cotton, more like polyester. I tried it on just to make sure. The neckline was big, so the shirt under would be seen. The neckline was just too big, it went from shoulder to shoulder. Also the sweatshirt fit like a square too.\n"}
{"text": "Love the colors although the item color picture was not quite accurate.  I got my regular size and it was extra roomy I could have sized down. I'm not returning it since it was a lightening deal and I don't know if there will be shrinkage when I wash.\n"}
{"text": "Shirt sleeves were a bit too long but beautiful colors as pictured. I expected it to be a bit more light weight so it is a cotton blend and not pure cotton.\n"}
{"text": "First this is not cotton. It wont breathe like cotton. I knew this going in. I bout some t shirts of the same material and loved them. It is super comfortable and fit perfectly. The colors are a bit darker than the photo. Overall I love my shirt.\n"}
{"text": "The quality of the shirts colors is not what I expected. It has spots missing color in the gray area which looks like it has been been chemically stained. (Like a bleach spot). I would not waste my money on this shirt, poor quality.\n"}
{"text": "Thought it was going to be a little thinner than a sweatshirt but the texture as a sweatshirt. Was very disappointed in that. Colors are as bright as picture. Sizing seems normal fit. Overall, disappointed because it does not look like the picture but might be a decent shirt for around the house.\n"}
{"text": "Your browser does not support HTML5 video. This looks digitized, and it is a thin stretchy material. The photo makes this look like a pretty sweat shirt, the colors are not even the same as the photo. Im sending it back.\n"}
{"text": "Im considered pretty thin and I thought that I was ordering a sweatshirt in a size large that would be oversized and  look very cute The shirt runs very small and its not a sweatshirt . Its  a soft thin shirt but not a thick sweatshirt that would keep you warm in the snow The item is 100% not what I was ordering\n"}
{"text": "This shirt came covered in hair which was disgusting. Its a shirt, not a sweater like i thought and the design is off. I got the gray and its not like it is pictured.\n"}
{"text": "The size and fit is good but the color is very dull, compared to the picture.  If you like soft pastels, it's not an issue but I was hoping for more vibrance.\n"}
{"text": "I saw that it is polyester but the picture tricked me into thinking it would be better. WRONG. Its so shiny, I look like Im ready for a disco. Love the pattern but the fabric is so cheap looking its offensive!\n"}
{"text": "I absolutely love this tie dye sweatshirt. Light fabric perfect for late summer nights. I am in love with the colors of this sweatshirt\n"}
{"text": "This is not made of sweatshirt material. It is done kind of sports polyester and feels awful on the skin.\n"}
{"text": "Super weird shiney material. Almost like a soccer jersey. I wish it was just normal cotton it has so much potential to be a cute sweatshirt.\n"}
{"text": "Its weird?  Its so polyesterish....think 70s leisure suit?  Its the oddest feeling shirt.  Stiff?  Very uncomfortable and odd.\n"}
{"text": "The material is not what I expected. It fits nicely but my friends and boyfriend think it looks right on my though it was not. The shoulder and neck area just look not like the picture at all. The sleeves are very cute though. Slightly longer, what I expected.\n"}
{"text": "Bought this as a gift for best friend. She loves it and is very pleased with it. Perfect in every way\n"}
{"text": "the fabric is synthetic and feels kind of cold and slick. the tie dye is like a graphic print onto the fabric. that part looked pretty. but it had permanent wrinkles and creases that two washings wouldnt remove. i noticed them on another reviewers pic also. mine had no tags. zero. nothing identifying the manufacturer or fabric. seemed strange. and when you hold it up it had no distinguishable front or back. the two sides are identical and sewn together so the fit was odd. i kept turning it around thinking i had it wrong. i dont know. it just wasnt at all what i expected.\n"}
{"text": "The look of the picture looks a like a soft blend of fabric..this is not.  Has no soft cotton or even soft poly feel.  Kinda thick, slick feeling, sort of shiny-ish fabric.  Nope don't like it...colors are great\n"}
{"text": "Ive bought clothes off of Amazon and never been disappointed until now. This sweater is a gift for my daughter for Christmas. When I open the package and looked at it, it looked like my teenager sewed it together. So many loose strings and extra string very sick in some areas. Take a look at the pictures, no explanation needed. The picture speak for themselves.\n"}
{"text": "So, this is weird. It is really cute and very comfortable. I ordered a large. I am usually a medium to large in casual shirts. However, the material is just weird. It is also kind of shiny or at least has a sheen to it. Definitely not a sweatshirt. Also, the neckline doesnt sit flat. It loses its shape quickly. The bottom is more fitted than the top. Wish it was more of a tunic than what it is. That said, I liked it enough to keep wearing it and not return it...but not enough to purchase the other styles/colors that I had placed into my cart. I guess you get what you pay for.\n"}
{"text": "Omg this shirt is so dang cute!  I love it! The color is a little different than the picture but it looks great on. As stated in other reviews, its not your normal sweatshirt material but it is warm and comfy! I would recommend this top and most likely will go back and order another in a different color\n"}
{"text": "This product is marketed as a sweatshirt. It is definitely not. The fabric is not stretchy and is very thin. Very disappointed with Amazon for clothing lately because a lot of stuff is coming from China and is garbage. Hard to find actual cotton sweatshirts that feel good and fit. Look elsewhere.\n"}
{"text": "So this shirt is super cute but also very deceiving because the models hands are covering the full design and size of the shirt. It way cuter tucked in or tied with a hair tie. Its very baggy and not flattering. It is straight down from neck to bottom, all one size. Seriously it is not flattering at all and arrived very wrinkly so I was not impressed trying it on. It did come a month earlier than expected so that is a plus. I personally would not buy this again or recommend this.\n"}
{"text": "I have not put it on because I'm returning it so I can't rate comfort but it makes you select something. I was expecting a real sweatshirt. This is just a long sleeved shirt. Its a little thicker but not a sweatshirt. I was very disappointed because I felt the word sweatshirt was misleading. I have no complaint about the delivery. It was here when it was supposed to be. It was a gift and  I had time to order something else. Its nice but not at all what the description says.\n"}
{"text": "This is definitely not a sweatshirt. It's a basic polyester long sleeve shirt. It looks pretty but as far as keeping you warm, not so much. It's cute for indoors. Good thing we're in the middle of a pandemic and can't go out.\n"}
{"text": "Not sweatshirt material, its some odd, cheap, shiny synthetic fabric. I didnt even know it was possible for a shirt to make you colder, but this one does. The material is slippery/shiny on the inside as well and is not comfortable against the skin. There also was absolutely no tag anywhere and no way to designate a front or back to the shirt, and the front and back were constructed the exact same way, making the neckline fit weird and the shirt be entirely unflattering.\n"}
{"text": "The gradient color effect on this sweatshirt is of good quality. I recommend washing it in cold to get the processing of hues out of it before wearing it.\n"}
{"text": "I think these are really cute, but not very long into washing them, they start to ball up. Kinda sad.\n"}
{"text": "Just as pictured. Cute and great breathable material. I think overall fits as expected.\n"}
{"text": "It is very very uncomfortable. Felt like sitting around in a garbage bag. I should have read the ingredients.\n"}
{"text": "Very soft thinner but warm sweatshirt. I LOVE it.  I ordered medium and it fits great. Difficult to push sleeves up (tighter than most) but I'm ok with that.\n"}
{"text": "Theres no tag indicating front from back so it is a tad confusing putting on the sweat shirt but, other than that, great product. Warm, comfortable and fits so well\n"}
{"text": "Love the details of this shirt!!! Super cute scallop edge.  Only downfall is hard to hide a bra but otherwise beautiful shirt that is a perfect length.\n"}
{"text": "I liked everything about this shirt the fit the feel washes up nice color staying good very nice shirt\n"}
{"text": "Does not look like what is depicted in the ad. Looks very cheap and you can find better at a lower price elsewhere. Really disappointing.\n"}
{"text": "The material is like a nylon sport shirt and be ready for puffy shoulders, like in the 80's. It's not a bad shirt but it's not the cozy sweatshirt I thought I was getting.\n"}
{"text": "This shirt was not a sweatshirt. The fabric was rather thin and it was too small. I returned the shirt\n"}
{"text": "I dont like the fabric and it isnt as cute as it is in the picture\n"}
{"text": "Cheapest looking and feeling material you could possibly imagine. Its AWFUL. I returned it the day it arrived. Absolutely horrible.\n"}
{"text": "This is not sweatshirt material. Its a shiny top that reminds me of work out top material. Color does not match picture. Im returning it as its not the comfy top I thought it was.\n"}
{"text": "Need to return this shirt not flattering at all , to short for the size it says order a bigger size then actual size so 2x would be 3 x\n"}
{"text": "This is an adorable sweatshirt, but it is not warm and fuzzy on the inside as I expected.  It is a nice fabric for warmer weather, but still not overly soft.  I have a feeling it will hold up well in the wash and not pill easily though.  I am enjoying it and recommend it. The colors are beautiful.\n"}
{"text": "This shirt is true to size and more of a loose fit. I expected to be a soft cotton material but its more of a silky poly material. Looks just like the picture otherwise though.\n"}
{"text": "Great shirt for running errands or just being casual! Looks great with yoga pants or jeans and is super comfy\n"}
{"text": "Love this blouse, very comfy & fits just right.  I will definitely remember this brand whenever I shop for a blouse again.\n"}
{"text": "Didnt look anything like the picture. The colors and material are just cheap and they look cheap.\n"}
{"text": "I had hoped to get a sweatshirt, as advertised.  This has no fleece lining.  I dont believe theres any lining.  Its simply a pullover shirt.\n"}
{"text": "The shirt is cute and comfortable. After the first day (wearing only in my home), the fuzz balls appeared on my torso and sleeves. This was before washing. After four wears, washing on gentle and air drying, Im tossing it in the pajama pile. Poor quality.\n"}
{"text": "I love this shirt. So comfy. Fit perfect. Have bought 2 different colors. They wear, wash and dry very well. I will buy again.\n"}
{"text": "I was disappointed with the material of this shirt. its short and wide so was not flattering on me at all with how tall I am. Was donated immediately.\n"}
{"text": "Not sweater material or sweat shirt material by any means. More like a cheap silky pullover from Walmart . Fits short\n"}
{"text": "Waited several weeks for this to be delivered and its the wrong color and way too small. Very disappointed.\n"}
{"text": "I did not even bother trying it on. It is UGLY because of the polyester \"sheen.\" Returned for a different item.\n"}
{"text": "I so wanted to like this sweater but it is a yucky shiny spandex material and not cotton like a traditional hoodie\n"}
{"text": "Super thin material\n"}
{"text": "I have worn and washed this sweatshirt 3 times and already the fabric looks old and worn with 'balls' all over it. The material was shiny, which was unexpected. Disappointed.\n"}
{"text": "Very comfortable, I did have to hem it as \"I am short and it was too long!!\"\n"}
{"text": "Would not recommend.  Arms are too short and the rest is too big.  Material is cold and scratchy.  I wanted something soft and comfortable and this isnt it.\n"}
{"text": "Great colors! A little summer color in dead of winter. Can't wait to wear it!\n"}
{"text": "I like the lightweight soft material.  Colors are pretty, it is exactly like the photo.\n"}
{"text": "Was misled.  Thin shiny material. Not like a t- shirt\n"}
{"text": "It looks like a cute sweatshirt that you would want to wear but instead it is a hard rough sweatshirt.\n"}
{"text": "This is not sweat shirt material. This feels horrible and it is see through.\n"}
{"text": "this products claims to be a Tye Dye crew neck sweatshirt. IT IS NOT!! It is more like a thick Tee, with a Screen print of tye dye. NOT ACTUALY tye dye very disappointed :-(\n"}
{"text": "Do not buy!  Total misrepresentation of product. False representation!  Items are not sweatshirts as seller represents.\n"}
{"text": "Too big, the material was slick and shiny. Will never wear it!\n"}
{"text": "I bought this as a Christmas gift for my daughter. Shes 54 110 pounds. We got size small its a little bit but she loves it and wears it with leggings.\n"}
{"text": "The fabric is a shiny knit fabric instead of a soft cotton sweatshirt look. Also it has a band around the bottom and isn't that long. The core are alright though.\n"}
{"text": "The material feels like plastic, not cottony at all.  The inner layer also feels like plastic. Not happy.\n"}
{"text": "This shirt fits on the small side. Does not breath as much as a cotton blend shirt, but is warmer. Great color combination.\n"}
{"text": "Fabric was not breathable & had a weird, cheap sheen to it. Neck opening was very large. Sleeves tight.\n"}
{"text": "This is not a sweatshirt at all, its not made of the same material so its not soft on the inside as expected. The color is pretty but otherwise I would NOT recommend purchasing. Ive had problems with other companies selling products like this and its a waste of money!\n"}
{"text": "Cute and comfortable. Love that the tie dye is printed on the shirt not actually dyed. However, I thought this was a sweatshirt, but its just a long sleeve tee. And there arent any marking which is the front or back, so I need to hold up the shirt each time to see which way to put it on.\n"}
{"text": "Ordered a 2x, and it fit.. but not as supposed to. Like the model's shirt is baggy and comfortable looking, but that's just not what I got. Mine was tighter on me, especially at the hips, which is fine if that was what I was expecting.. returned.\n"}
{"text": "It was poorly made of non-stretchy Polyester material. I will update my review with a picture. I would not buy from again :(\n"}
{"text": "These are beautiful tops! They are even prettier than the pics. And the material is so soft. Not skimpy or heavy. The outside has a silkiness to it. Love this top and great price!\n"}
{"text": "Purchased for my daughter and she loves the fit and softness!\n"}
{"text": "Description is misleading. It is definitely not a sweatshirt. Although the color is pretty it is T-shirt material. I was looking for a sweatshirt so I am disappointed.\n"}
{"text": "I noticed all my sweatshirts were gray and I needed to bring some color to those dull, cool days so I bought this lightweight sweatshirt. It fit the bill!  I get compliments on it every time I wear it!\n"}
{"text": "Its really thin almost see through not what I would call a sweat shirt\n"}
{"text": "A little on the small side. But its a really cute shirt\n"}
{"text": "Dont buy this based on the picture. Looks nothing like it. The material is cheap polyester and not soft. Not what we were looking for. Runs large.\n"}
{"text": "I like the color, the fabric is not sweatshirt material, its kinda weird\n"}
{"text": "Love the color, size & overall fit of this sweatshirt. This is the perfect light weight sweatshirt for the South!\n"}
{"text": "This is that weird polyester type maternial. Not soft or anything. Like cheap sheer. Not what I was wanting or expecting - returned immediately\n"}
{"text": "This shirt is so cute and comfortable I love the scallop detail on it.  It is a little fancier than I was expecting but easy to dress down.\n"}
{"text": "Colors are really vibrant. Fit is TTS.\n"}
{"text": "The shirt looks better in the picture, not soft at all more like polyester material.  Ugly ugly\n"}
{"text": "It does have a front and back. Theres a label inside that goes on the left side.\n"}
{"text": "Having it away !  Too long in torso and arms but very soft! Wish I could have kept it!\n"}
{"text": "Love the sweatshirt Cute comfy and perfect For a teacher like myself to wear to school on Halloween\n"}
{"text": "Shirt is very thin and see thru. It is not soft at all, feels like the tie dye was printed on the shirt and not actually dyed. Dont waste your $$.\n"}
{"text": "Love it\n"}
{"text": "I was unsure how it would look and feel. I purchased the grey white combo color. It fits amazing. I ordered an XL. I have long arms and it hits pass my writs.\n"}
{"text": "Love the sweatshirt but i ordered 2x and its more of a 1x\n"}
{"text": "Very nice...feels nice fits good...I ordered 1 more...very satisfied...\n"}
{"text": "This fabric is so thin and is a cheap polyester, shiny material. NOTHING like the picture.  I bought it as a gift, but would be totally embarrassed to even give this as a joke! More cheap CHINESE crap for our landfills.\n"}
{"text": "It feels like Im wearing a basketball jersey; I swear its the same material. I ordered a size small and it fit as expected. For reference, Im 54 and 117 pounds. Unfortunately, the neck hole was really stretched out and is very noticeably stretched out. I dont think its worth $25 because its so thin. Its not cozy and soft like a typical sweater, but itll work on a day that starts slightly chilly and warms up throughout the day. I think $10 would have been fair, if there wasnt significant distortion involved.\n"}
{"text": "I purchased this as a lightening deal so did not have time to read the description in depth or I would not have purchased. It looks like a super soft slouchy cotton sweatshirt in the photo so thats what I assumed it was. Wrong!  Its a polyester slightly shiny, thin material that clings to fat rolls and snags easily. It also has a bottom band on the waste that I had not noticed in the photo and it just looks weird, so I will probably cut off the band. I will say that I love the colors and it does fit true to size. I cant believe this has so many high ratings.\n"}
{"text": "I thought it was cotton but its polyester \n"}
{"text": "It is not tie dye, it is actually a print on lycra that looks more like outer space than tie dye.  Very disappointed, it is actually quite horrible.  Nothing like the picture!\n"}
{"text": "The shirt I received is so ugly and nothing like the picture. The material is weird too. Hate it.\n"}
{"text": "I thought this would be a soft, loose fit crew neck. The colors were much brighter than pictured. Also its not even a sweatshirt material. Its a stretchy, shiny material, and quite firm fitting. Not what I wanted at all. Returning.\n"}
{"text": "Horrible off-gassing smell & material was more like a track jacket than a sweatshirt. In the process of returning it.\n"}
{"text": "This top is not made to fit a person. Not sure how they came up with the design. I can't remember EVER having put on a top and it being so horribly constructed. It does not sit around shoulders and collar bone like any top should. The top continues it's odd shape through to the armpit area. When you wear it, you keep thinking you need to adjust it or that you have it on backwards. It's very strange. I DO NOT RECOMMEND.\n"}
{"text": "The fabric is weird and not flattering on a thicker girl.\n"}
{"text": "I love the color of the sweatshirt. The size fits, and it's comfortable. After a few washes, the only bad thing was that it started to get fuzz balls, so I started to wear them only as PJs.\n"}
{"text": "I bought for my daughter and she loves it. Fits perfect and looks just as vibrant after washes .\n"}
{"text": "Kind of shiny and baggy arms but super cute for the price. Bought one for a gift as well. Worth it for something cute and comfy.\n"}
{"text": "Not typical sweatshirt material color is great\n"}
{"text": "The product was a Christmas gift.\n"}
{"text": "I am five four and 160 lb with a very hourglass shaped figure and I purchase this in a medium after reading the reviews I definitely recommend sizing down one size that personally worked out well for me where the medium was still a little on the big side not much but fits as the picture shows\n"}
{"text": "I got this a size up because I like comfy, cozy sweatshirts but this is a little too big. I still love it, its just a tad bigger than I would ideally like. Material isnt sweatshirt-like like it appears, almost feels like a very thick running shirt. Again, not bad just not what I expected. Overall, I really do like this and am happy to have something cute to snuggle in as the weather changes.\n"}
{"text": "I got this for my Fiance as she is big into these types of designes. She was very excited to get it. It was a bit smaller than she was expecting (she normally a small so she went a size up but it was smaller than expected. If you want it flowy, order two to three sizes up) and it's more of an athletic material than a soft and fluffy. However, she loves it. It looks great on her and she can wear it running if she wants to.\n"}
{"text": "TERRIBLE QUALITY Its says sweatshirt material but this is made of polyester and its thick feeling even though its really thin. Its not at all what I thought I was getting. The sleeves are also too short. I usually wear a medium So I ordered a medium. The arms were to short but it for like it was supposed to everywhere else. Just not a good quality and very misleading on the description of it.\n"}
{"text": "Wish it was more cuddly\n"}
{"text": "This was a gift to my boyfriends stepmom and she love it, light weight and comfortable.\n"}
{"text": "Took two months .. the sleeves is like a blouse not a sweat shirt .. way too shiny \n"}
{"text": "Material VERY thin\n"}
{"text": "A little thin but perfect for that oversized look if you have a long torso. 5'7, 155 ordered a large and the sleeve length is perfect and so is the rest\n"}
{"text": "This product is horrible I bought 3 and I'm sending them back. They don't fit right and with the pictures you'd think it was a long sleeve tee shirt material but no it's extremely uncomfortable. I feel like it chokes me.\n"}
{"text": "The collar is not as expected. It sits weird on my shoulders. It is soft but the color is also way faded compared to the pictures.\n"}
{"text": "Good buy\n"}
{"text": "Overall love this shirt but fabric is somewhat shiny and started to pill after a few washes.\n"}
{"text": "Love the colors, the fit, the quality!  I am very pleased with this shirt!\n"}
{"text": "My DD loves this! Super comfy and baggy just the way she likes her sweatshirts! Thinner material than I thought.  But will be nice even in the spring and fall.\n"}
{"text": "Cute and comfy top. Blended material that was not too warm or thin. Graphics were just like the picture. Ordered an XL, but it was still a little snug by my hips. Maybe order a size up\n"}
{"text": "Expected a sweatshirt.  It was a lightweight cotton blend, feels like a satin, not suitable for anything below 65 degrees.  Did not fit as shown.  I would not recommend.\n"}
{"text": "The fabric is weird and super baggy. I usually wear an xl. But this was big and baggy. It'll be cute for a lounge shirt. Or if you're going for a cute baggy shirt with some capris, or leggings.\n"}
{"text": "The color is beautiful. I was hoping for a soft cozy feeling when I wear it. I do not feel that way. It is NOT comfy and cozy. The picture looks soft. This feels cheaply made.\n"}
{"text": "Cute shirt but runs large.  Quality good; front and back not marked so you are always trying to figure that out.  Garment with a puzzle ... entertainment\n"}
{"text": "I got a large and it was a little  big in the arms,but I like the oversize look. So you could  size down if you want  it more fitting.\n"}
{"text": "Feels scratchy, neckline is too big.\n"}
{"text": "I love that I can wear this to work without feeling dressed down... yet I'm comfy on chilly days! It feels like decent quality and has held up in washes.\n"}
{"text": "I ordered a XXL because of what was indicated on the reviews.  The XXL is far too large for me & should have just ordered my regular size.  No cotton on this product, not good for a cold day.  Fire Pit worthy though.\n"}
{"text": "The colors do NOT look anything like the photo.  The material is horrible and shiny and the waistband is tight so it looks like I am wearing a balloon.\n"}
{"text": "A little small\n"}
{"text": "Overall the top is nice! The colors are not as bright as the picture shows and it definitely is not a sweatshirt. The pink shows great, but the yellow and blue are very light to where some of the shirt actually looks white. Runs slightly larger than expected. Not what I wanted, but again nice top.\n"}
{"text": "This was a duplicate order! Already received one and do not want this.\n"}
{"text": "Not sweatshirt material.  Slick, shiny, and super thin.  Can see through the white when layering.  Not at all like I expected. Threads coming off cuffs.\n"}
{"text": "This is a very nice quality blouse well worth the money!\n"}
{"text": "I gave he top to my Granddaughter and she really likes it.  The product description calls it a sweatshirt. I'd call it a top.\n"}
{"text": "Not the greatest but not the worst. On cheaper side\n"}
{"text": "Great shirt, weird material and shorter than the picture shows\n"}
{"text": "Color is as pictured.  Fabric is polyester and i expected cotton.  All and all I like it.\n"}
{"text": "Very flimsy and pattern was not dyed it was printed on the the fabric so looks cheap.  RETURNED.\n"}
{"text": "Fit is true to size...........lightweight sweatshirt type material, comfortable.\n"}
{"text": "Bought as a gift. My granddaughter loved it! Great price!\n"}
{"text": "Love this shirt! Will be great for cold or just cool weather. Will probably order another in a different color.\n"}
{"text": "Pretty color but very thin material. Not like a thick sweatshirt, more like a t-shirt.\n"}
{"text": "Nice shirt. Really nice material. Fits as expected... I got a large not too baggy not too form fitting. I I got the black, yellow, white fade- true to color. Kind of expensive though and no care tag so Im not sure what to happen after wash.\n"}
{"text": "Ordered this at the end of winter - I loved the color- the ombr grey to white- the shirt was light feeling- it didnt make me hot - comfortable\n"}
{"text": "Very soft and comfortable shirt. Thin sweatshirt not heavy. Love it!\n"}
{"text": "Top part really big especially the neck area, neck area needs to be corrected on these tops.... would be a great top.\n"}
{"text": "I found it was super oversized so I will return it.\n"}
{"text": "Ran a little large and the material is not like a sweatshirt at all.\n"}
{"text": "Does not look the same as the picture. It has a sheen appearance instead of distressed. Bought it for my sister for a gift and she asked me to return it\n"}
{"text": "I bought this for my girlfriend and she loves the color and fit. It is very flattering on her she is a curvy woman so she looks great in anything but she loves it and its comfortable to be in all day or night.\n"}
{"text": "Shirt is nice and cozy...but mine had no tag on neck so no idea if I am wearing it backward or frontwards. Theres a tag on the side.\n"}
{"text": "Length is shorter than I thought it would be falls above my hips! but nice quality.\n"}
{"text": "Its very beautiful, soft and its pretty big.\n"}
{"text": "Very soft. Bright colors. Not exactly sweatshirt material, but looks like a sweatshirt & is comfortable.\n"}
{"text": "The arms are a little short and the rest is baggy, materiel is pretty cheap as well. Honestly Im disappointed   Afaid of what a size smaller would have looked like.\n"}
{"text": "It's nice for casual days, just wish the fabric was softer and flowed a little better. All in all it's a good buy.\n"}
{"text": "I ordered this as a Christmas gift. The delivery time was good.. size looks true to size.. just not crazy about the material. I was expecting it to be like a cotton.\n"}
{"text": "Our 11 yr old granddaughter asked for this for Christmas.  She loves it!\n"}
{"text": "It fit however the sleeves aren't as long as I thought..therefore once it's washed it will strink\n"}
{"text": "Bought for my daughter and it looks great on her! She says it's comfortable and even after washing it, it stays nice!\n"}
{"text": "Didn't like the material. Thought I was ordering a sweatshirt.\n"}
{"text": "The top itself is nice but the one I received had any tags that may have been in it cut out.\n"}
{"text": "Horrible material!  It is definitely not a sweatshirt...also doesnt have a front and back!  There are no tags anywhere on it and it looks like it was made in someones garage.\n"}
{"text": "Its shiny! Not shiny  like a quality Under Armour or Dri fit Nike product, but shiny like a childs Halloween costume! Just horrible!\n"}
{"text": "The fabric isn't very soft or plush. I'd describe it as silken. I was expecting more of a sweatshirt fabric. Other than that, it's cute and fits well.\n"}
{"text": "Product is not like it is in the picture except for the color. Looks like a soft sweatshirt but it is not it's a slinky material not very forgiving and is not comfortable. Will be sending it back. Was very disappointed because I love tie dye\n"}
{"text": "Piled a little after the first wash. Not the best material.\n"}
{"text": "I found the material cheapy, like clothes from wish (that shiny, odd printed style). Didn't blend like a true tiedie, was more like it was printed.\n"}
{"text": "Fits large. Not sweatshirt material.\n"}
{"text": "Super soft and comfy. Fits perfectly\n"}
{"text": "Purchased for my 12 yr old daughter as gift.  OOF!  Now I am the dumb dad that does not understand Polyester and Spandex is a terrible combination (apparently).  Returned.\n"}
{"text": "It was used. No tag and you could tell it was washed.\n"}
{"text": "Very disappointed\n"}
{"text": "This top was not like its betrayed in the picture!  Very disappointed!  Doesnt fit right!  Its not flattering!  Its not soft! Nor comfy!  It was a gift and I was embarrassed to give it  But I didnt have a choice. It was to late for Christmas!\n"}
{"text": "I was disappointed for 1 there were no tags so I dont have a clue which is front or back of the shirt for 2 I thought it was sweatshirt material and its a silky material but it was comfortable to wear so maybe include tags next time to tell front from the back\n"}
{"text": "The fabric was a little corse not sweatshirt material, super lightweight and perfect for summer night.\n"}
{"text": "Already getting fuzzy, washer only no dryer and only 2 months old.\n"}
{"text": "Received a different pattern/color than what I ordered. Wouldnt have been a big deal to exchange for the right one, but the quality was so poor (loose stitches everywhere) that I dont want to take the chance. Returned.\n"}
{"text": "It fits as expected and is incredibly comfy. In my experience, I noticed that with the material it kept me a little cooler than others. I also love the color scheme.\n"}
{"text": "Really really cute!  I bought oversized for my 13 year old granddaughter!  Its very soft and falls below hips.  She loves it!  Its a go to sweatshirt!  So comfy!  Looks great with k skinny jeans and leggings!\n"}
{"text": "I bought a size that would be to big for myself. I was so excited to receive this. I tried it on and it was way to small. A 2 x fit like a large and it was way to short. I expect an oversized sweater to be long enough to cover my stomach. This did not. It was also a shiny material. Very weird.\n"}
{"text": "Not high quality. Not good material, bunching, weak stitching that does not stretch. My baby pulled on the neck just a little bit and I heard the stitching snap. I bought the pink and light grey/white one and it stinks so bad, that I still cant wear it after washing it four times. All of them balled up so bad in the washer that I can not even use them anymore... Already.\n"}
{"text": "Cant tell the front from the back. Both ways feels too high on the neck. Its kind of shiny which makes it look synthetic and cheap. Not what I was hoping for. I want soft and slouchy in a cute way but its just blah\n"}
{"text": "Super cute! Not quite a sweatshirt, but thicker than t-shirt material. Comfortable and warm enough to wear on a fall day. I ordered a XL thinking it would be cute baggy, and it is! Just a little bigger than I expected it to be but still really cute!\n"}
{"text": "Likes: Colors are exactly like the image & description, soft material, comfortable to wear! Dislikes: Material is not what I was expecting biased off images. I expected more of a \"cotton\" type sweater material not the polyester/spandex material. The product is very delicate and must be washed on gentile to ensure the seams do not come apart.\n"}
{"text": "This material is not at all soft. And the shirt is sheer. Ive never seen a sweatshirt that is sheer before. Its a strange shirt. It fit well, but Im returning it.\n"}
{"text": "This was suppose to b of a sweatshirt type material and it looks like it dates from the 70, would snag easy for sure. Very disappointed, tho I did buy by mistake another that was added on FB. thought give it another chance just as bad. UGLY. Thank goodness Amazon backs there products because I would never of got my money back from this company. Thanks for asking. Only Amazon would give my money back and take the ugly back.\n"}
{"text": "I really like this top.  I'm 5'7\", 140 lbs and ordered Large.  It fits but is a bit skimpy.  I ordered a second one and sized up to XL.  It very comfy and is Polyester and Spandex.\n"}
{"text": "I cut the waist band off and cropped it! Because with the band I looked like an old lady. It is soft and cozy..\n"}
{"text": "I loved this dress. It shrunk and now fits beautifully. I have yellow and orange. I love them so much I may buy the light blue as well. The material is a very high quality I love it. I inadvertently bought 2 of the yellow.\n"}
{"text": "She hated it. Uncomfortable material. Doesnt look like the picture. Wish I could get my money back\n"}
{"text": "Had to order 2x when usually a xl. Xl was tight but 2x too big. Different material but youth likes it\n"}
{"text": "This is so soft and roomy and I get compliments everywhere\n"}
{"text": "Love the material. It is soft and stretchy.  Colors are also great.\n"}
{"text": "The sweatshirt that I received looks nothing like the sweatshirt in the picture.\n"}
{"text": "Beautiful. I wore this to a mother's day photoshoot my husband gifted me and it turned out beautiful. Fit beautifully and looked great on. Would definitely recommend\n"}
{"text": "Nice and warm and looks great on.  The size was perfect.\n"}
{"text": "Weird fabric, shiny and slick, not soft at all.  Seems like it won't be very breathable or comfortable. Got a small, is pretty true to size, it's cut oversized which I like but it  looks cheap. Was going to order more than one, glad I didn't, will probably return.\n"}
{"text": "Overall a cute top. I love the weight of this top which is between a light sweatshirt and tee. I am 55 135 lbs and bought a medium. Love that there is no tags on the top but dont realy care for the sheen of it but its still confortable  and cute.\n"}
{"text": "This is not a hoodie. I ordered a size up. I should have ordered have ordered a large. It is soft the color is nice. Overlocked stitching. Soft have not washed it so i dont know how color will last during wash. Polyester usually good at holding color. I really like the color-block. Overall, im happy with the purchase. Not a heavyweight long sleeve, good for mild temps.\n"}
{"text": "I like wearing something thats a loose and slouchy especially on the weekends. This top is great for staying in but the perfect weight for going out on those early brisk fall mornings. Plus it has a little stretch but it wont be down to your knees at the end of the day.\n"}
{"text": "Prettier in person than in the picture.  Super soft with an oversized fit.  I am wearing a size large for reference.  Would definitely purchase again!\n"}
{"text": "This product is much brighter, lighter and colorful than pictured or expected. It looks muted and grey-ish in the pictures. So just know that you will be getting very vibrant colors. Thats not great for what I need it for, but I like it overall and will still wear. Im 53 and 135 lb. And I got an XL, expecting it to be a bit bigger than what it is. As is it barely barely covers my butt if I dont move at all. Should have gone XXL for what I wanted.\n"}
{"text": "Very soft, long, perfect to wear with leggings!\n"}
{"text": "This shirt is amazing! So comfortable and washed up well (air dried). I never know if shirts are actually going to fit (plus size) was thrilled with the fit a feel of this shirt!\n"}
{"text": "terrible material--thought most sweatshirts are made of cotton/somewhat breathable but no no no , this sweatshirt is made of polyester and spandex.  I should have read the  details of this sweatshirt better cause I will only be able to tolerate the shirt if its below zero\n"}
{"text": "This is spandex workout fabric.... not at all as described... and definitely isnt the same sweater as the picture...\n"}
{"text": "I absolutely love this top.  Totally comfortable and washed without wrinkles.  I am completely satisfied and will definitely concern purchasing more due to the quality!  Being plus size I dont feel like I look huge either in it.\n"}
{"text": "This is so beautiful in design & not heavy to wear. ..just perfect\n"}
{"text": "This is not a very heavy sweater which I am ok with. I wanted it to be baggy which it is but I probably could have wemt with a large. Really pretty colors though.\n"}
{"text": "The neckline is too high. There is no back tag on the shirt so you have to guess the front and the back and both ends are too high up on the neck. This makes it uncomfortable.\n"}
{"text": "This is not like a sweatshirt material. It is shiny and more like a running suit material.\n"}
{"text": "This top is a beautiful shade of blue!  It fits great , flares out a little from the bust, and nice length.  Only thing is the neckline was stretched, but I made a pleat at the neckline in front. Issue resolved. Im 55, wear 2XL .\n"}
{"text": "The length wasn't anything like the picture.  Kind of boxy.\n"}
{"text": "It was cute but the style wasnt quite what I was expecting. Meaning, it was a tad short than what I wouldve preferred even with a size large that was bigger than I wouldve preferred.\n"}
{"text": "The fabric and sizing on this is horrible! Dont buy it!\n"}
{"text": "Hate this, it's not a sweatshirt, it is a cheap knock off, dont waste your money!\n"}
{"text": "Made out of heavy stiff fabric.  Zips up the back which I didnt realize.  Bought it thinking it was softer,  more of a beach cover up.  Its not.  Still cute enough to keep.\n"}
{"text": "I liked it but I was expecting cotton. This fabric is more of a shiny polyester, so I returned  it.\n"}
{"text": "Absolute love it!! Need to get more colors.\n"}
{"text": "Love it. The colors are amazing.\n"}
{"text": "very soft\n"}
{"text": "Got a small and it was just right, not snug bit ample size in arms and length.  Pretty too.\n"}
{"text": "Perfect\n"}
{"text": "the color was the not the same quality of ombre as in the picture.  also it ran big and just felt cheap and not that comfy.  not worth the price.\n"}
{"text": "Fits great! Lighter color than pictured but still very pretty\n"}
{"text": "Different material than expected..but the colors are true to pic. & I like the design very much.\n"}
{"text": "I love the colors and love how it fits\n"}
{"text": "I was looking for sweatshirts and loved this in the picture. It was not at all what was expected. The material has a dull shine on the outside and inside isnt sweatshirt material. Thin and flimsy this isnt a sweatshirt\n"}
{"text": "Very comfortable and love the sweatshirt design.\n"}
{"text": "Didn't realize the material this is made out of is shiny. Not regular sweatshirt material. Didn't like the fit or feel.\n"}
{"text": "I loved the colors and light weight of it.\n"}
{"text": "Is not what is pictured. Very disappointed. Feels like plastic.\n"}
{"text": "Feels cheap, thin and weirdly shiny material, not snuggly sweatshirt material like I hoped. Will be returning.\n"}
{"text": "Love this cute shirt.  Fit was perfect.\n"}
{"text": "Does not look anything like what I ordered It does fit.\n"}
{"text": "Beautiful\n"}
{"text": "This is made cheaply. I would not recommend it.\n"}
{"text": "Material is soft and the length is good. i like the gradient of the colors. The only thing I don't like is the neckline, which is a slouchy for my preference. Overall though, comfy lounging sweat shirt.\n"}
{"text": "I loved the texture of the material and softness.\n"}
{"text": "Nice shirt but is shorter than pictured\n"}
{"text": "The small is pretty large, but really cute and soft.\n"}
{"text": "It feels and looks cheap.  Thought I would receive a mostly cotton sweatshirt but instead received a polyester sweatshirt\n"}
{"text": "The fabric had a strange texture.  I was expecting cotton\n"}
{"text": "The sewing around the shoulders and neck are poor quality. Looks nice but won't last long\n"}
{"text": "Fits great and looks good\n"}
{"text": "The sleeves are not long enough for my arms and it fit weird around the waist.\n"}
{"text": "Did not like this at all. Looks like cotton in picture but it is not. Very shiny & would not wear it anywhere.\n"}
{"text": "Comfortable, warm and I love the colors. I ordered 2 sizes larger and fits perfect.\n"}
{"text": "Have gotten a lot of compliments with this shirt!\n"}
{"text": "Started fuzzing with littlie balls and looked cheap\n"}
{"text": "I wasnt crazy about it. I thought it would be much warmer and softer. Didnt like the metallic sheen of the gray color.\n"}
{"text": "came with a huge stain in front! Dont buy\n"}
{"text": "This is not a sweatshirt. It's a shiny kind of thin work out material.\n"}
{"text": "This is not a sweater or a sweatshirt its a nylon feeling shirt. It looks cheap. Not worth the money.\n"}
{"text": "Good quality. Great colors. Runs very small. Short not as long as photo.\n"}
{"text": "I am between large and xLarge. When the items are made in CHINA They never fit. It I had known it was made in CHINA I would have never have bought the item!!\n"}
{"text": "Bought 2 different ones. They both look very cheap. Its shiny. They do not look like photo. Stitching is not straight material feels cheap. Returning product and purchasing something else.\n"}
{"text": "I was hoping it was made of sweatshirt material, but its more like a spandex, looked for material type before purchasing but wasn't listed\n"}
{"text": "I have ordered one before and the size was perfect , so then i ordered in different color and it is smaller .\n"}
{"text": "This looks horrible when you get it! The material is shiny and it looks terrible\n"}
{"text": "Love this shirt but it's made from some strange synthetic material almost plastic feeling.\n"}
{"text": "Problem solved!\n"}
{"text": "Exactly what I was looking for. Thicker than a t-shirt but not as thick as a sweatshirt.\n"}
{"text": "this products appearance is misleading, i expected the sequence to be angled and it was horizontal so the photo is actually not at all what was shipped. see photo^ lol\n"}
{"text": "The material is crappy- dont waste your $ and the neckline is just strange and the image displayed is totally off and not what it looks like on.\n"}
{"text": "Definitely not Cotten.  Not very comfortable. Super disappointed.\n"}
{"text": "Love this\n"}
{"text": "It is cute, but not the normal sweatshirt material I am used to. Description says is a hoodie, but is a sweatshirt only (no hood). That fits with pictures shown on Amazon, but if you want a hoodie this isnt it. The back of material is slightly scratchy, a polyester type of material.\n"}
{"text": "From the images it looks pretty baggy...It isn't baggy enough for me...It is a little stiff, which feels more confining. But it is a heavy and warm shirt. I purchased a large and I'm worried that if I wash it-it may not fit anymore. If it doesn't, I'll give it to my daughter and maybe get a larger size later for myself.\n"}
{"text": "I ordered the black and yellow one and when I got it, it was so soft! I loved it so much I ordered the same exact one. But when I received the second one it was jersey type material, thicker and ran smaller than the first one I got. Wish they were all made out of the soft material I received first.\n"}
{"text": "I LOVE this sweater. I get so many compliments on it. The only thing is, my hair sticks to it so I have to pick it off during the day and after a wash. I dont remember what size I got but I based it off most reviews. I'm 5'6\" 120 lbs. I probably got a small or medium. It does fit loosely.\n"}
{"text": "It is incredibly soft...Definitely need more colors because this is one of THOSE shirts ladies if you know what I mean. That one you wear the crap out of bc you love it so much! \n"}
{"text": "I normally wear a size medium and thats what I ordered and it fit tight. Definitely need to size up if you want it to fit loose.\n"}
{"text": "I had wanted this sweatshirt for a long time. I was so disappointed when I finally bought it. The outside of the sweatshirt is shiny. Almost like a dry-wick look, but its not. It looks very cheap and weird. I imagined a normal cotton sweatshirt, but this isnt that.\n"}
{"text": "This LOOKS like a sweatshirt but it is not. It's a cute pattern and the colors were nice. I would say the sizing was spot on but I was expecting a sweatshirt. Maybe I wasn't understanding the product description. I returned this because I was wanting a sweatshirt...not a shirt that looks like one.\n"}
{"text": "This sweater wasnt flattering fit for me. It doesnt have a tag so its hard to determine what side is the front and what side is the back lol. The reviews and size chart both seem to say this is a true oversized sweatshirt. Im 50, 130lbs and I ordered a small. It is a little loose in my stomach area but the chest and arms are not so much, but I wouldnt call this a true oversized sweatshirt. Im small chested so it works for me but I would recommend if you are someone who is blessed in that area, definitely size up. Overall, its soft and seems like it would be warm. I ordered the black and grey ombr color and its very pretty.\n"}
{"text": "So this is NOT a sweatshirt.  It is thin almost silky material.  Its cute on, but if youre looking for more of a warmer sweatshirt this is not it.\n"}
{"text": "Not your original sweatshirt. Really dont like it sending back\n"}
{"text": "Have washed 3x's already trying to get the mothball smell out. Does me no good if I can't wear it.\n"}
{"text": "Not a soft cotton material like it looks like in the photos shown, it's a weird material that I'm not a fan of, and the colors don't match the photos shown either.\n"}
{"text": "I love this sweatshirt! Its got a silky feel to it and fits perfectly! Its oversized so its very comfortable! Im going to buy more!\n"}
{"text": "Looks like a fleece sweatshirt - it is not.  it's made out of a strange, polyster-feeling material without a lining.  It feels dull and a little scratchy.  Would not purchase again.\n"}
{"text": "Material is shiny. Very soft. Size is a little weird. Very wide, but not long enough.\n"}
{"text": "Absolutely love this dress!  Nice thin jean like fabric is perfect for warm weather.  The fit was just as expected, with nice adjustable buttons on shoulder.  I am 55 140 lbs and ordered the large in white.  Its so cute and comfy can wear it anywhere with any shoes.\n"}
{"text": "Too small. Material stiff. Cheaply made.\n"}
{"text": "Her new favorite shirt. Likes the way it fits. And, it's super comfortable.\n"}
{"text": "I love the colors, fits great, and I've had several compliments.\n"}
{"text": "This sweatshirt looks cheap. It is not made from normal sweatshirt material.  it doesn't look like the picture.\n"}
{"text": "I thought it was going to be a warm sweat shirt, its full polyester not what I was expecting \n"}
{"text": "Shirt fit as expected and is very soft material.\n"}
{"text": "Love this shirt\n"}
{"text": "I love the colors. But the fabric is horrible. Not a sweatshirt at all. Sent it back\n"}
{"text": "Not what I expected.  Cheaply made\n"}
{"text": "Looked nothing like the picture, the colors were dull & the pattern wasn't the same. Skip this one\n"}
{"text": "Very cute but it is not true to size. The sleeves were nothing like shown and did not fit properly. It is also not soft as claimed.\n"}
{"text": "Soft and pretty\n"}
{"text": "Runs very small. Its cute but its also very short. I was expecting a longer shirt. Will probably return.\n"}
{"text": "The shirt is cute, but material is more like a shirt. Its polyester. I did return it.\n"}
{"text": "Didnt like it the material was cheap I gave it away\n"}
{"text": "Very soft and comfy, does run just a little small. Pretty colors\n"}
{"text": "Very cute and comfy, but certainly not made for warmth. Pretty much see-through.\n"}
{"text": "A little smaller than your normal large Im giving it 2 stars because its very thin polyester & spandex material I wanted a sweatshirt made of fleece that was not in the description!! Its going back !:(\n"}
{"text": "Love color coordination, the soft material and the ease of wearing out and about.\n"}
{"text": "The sweatshirt was not the soft cotton it shows in the photo. Its form fitted and not stretchy.\n"}
{"text": "First one was to small exchanged next size was to large comfy to wear around the house.\n"}
{"text": "This fits my friend beautifully, but it is a more of windbreaker than a coat or heavy jacket. She loves the purple!\n"}
{"text": "Love this sweatshirt! It fits just right and very beautiful. One of my new faves!\n"}
{"text": "Weird material. Disappointed\n"}
{"text": "Love this top\n"}
{"text": "It wasn't the t shirt material we thought. It's still nice. Not sure we'd order another.\n"}
{"text": "The sweater feels a little plasticy\n"}
{"text": "So soft washable nicely hang to dry can dress up or down\n"}
{"text": "Its soft, cozy, and cute.  My teen daughter really likes it.\n"}
{"text": "The shirt has no shape and fits like a bag. Also the material is a weird feeling thin material.\n"}
{"text": "Runs very large. The material is not very soft.\n"}
{"text": "Didn't like the look. Returned it.\n"}
{"text": "This shirt felt more like a bathing suit or gym wear and it was pretty big\n"}
{"text": "Super nice, exactly as pictured\n"}
{"text": "This shirt balled up under the arms after first wear. very disappointed\n"}
{"text": "Nice\n"}
{"text": "Polyester\n"}
{"text": "Weird cheap material.\n"}
{"text": "This product is  shorter in  length than it looks in the picture.  Its ok, but not what I thought I was getting.\n"}
{"text": "I am 54 120lbs and small fit almost perfect .  It looks cute on too!\n"}
{"text": "Super soft and flattering\n"}
{"text": "This is more like an oversized silky feeling shirt than a sweatshirt. I still like it and plan to wear it.\n"}
{"text": "Product arrived, materials does not look like pictured. The material is shiny. Extremely different then pictured. UGLY!!!!\n"}
{"text": "I felt like the shirt length was so weird. The fabric was really uncomfortable to me & wasnt what I was expecting. \n"}
{"text": "I did not like the fabric at all it was a shiny material not soft\n"}
{"text": "Very pretty but sizes are way off ..\n"}
{"text": "Cheap polyester material. Feels slick to the touch. So gross!\n"}
{"text": "The fabric was not soft but slippery. It was small compared to the size.\n"}
{"text": "Sent with massive orange stains all over the front and back!!!!  I havent even gotten to wear it once... very bummed\n"}
{"text": "Nice but runs very small\n"}
{"text": "It's not a sweatshirt material. It's very cheap. Threw it away. Awful quality\n"}
{"text": "This was exactly as I expected. Torso a little on the shorter side but not terrible. Comfortable, pretty colors.\n"}
{"text": "Very disappointed\n"}
{"text": "I love this shirt. Very soft. Washes well .Get it out of dryer & hang up immediately & you wont need to iron I did have to exchange ..i did at first order a large because i like shirts loose. It was huge!! So med was much better fit\n"}
{"text": "This is a very sexy black number! Fits great in all the right places. I ordered a medium and I am 5'6\" 140lbs.) Bust 36D  It got a great reaction from my man who about fell over when he saw it on me ... I was pleased with it and would highly recommend this product!\n"}
{"text": "I tend to buy items large im 52 , weight 125 i believe i bought lg possibly xlg - my granddaughter made me a Great grandmother So I made her smile an being big like the photos on models She has room to move an baby is 15 days today\n"}
{"text": "I love the shirt and the colors, however one of the under arms has a hole in it. Not very flattering.\n"}
{"text": "Not as pictured. Looks like a sweatshirt. Is not one. Very disappointed. Made out of soft fabric though but catches from other objects. Not worth the money to me but am not returning it.\n"}
{"text": "Not impressed with the fabric or the fit.  The shirt is smaller than anticipated and no marks to show front or back.\n"}
{"text": "So soft!! Absolutely love, thinking of purchasing another one! Was so comfy to wear and worked perfect for my leggins and big sweater look!! I purchased an Xl so it would be big!\n"}
{"text": "Beautiful and comfortable top! Fits to size and gives you a little room to move around. No label inside so its a bit different to recognize the front from back. You have to hold it up to determine. Great purchase.\n"}
{"text": "If you think your getting a sweatshirt or sweatshirt material..your not!  That was a disappointment to me. The green is a pretty shade, but Im not big on this material, thin and shiny!\n"}
{"text": "Cute colors, looks like the photo. Only issue I have is that is seems thinner than it looks in the picture. Flattering and doesn't hug you in the mid section which is nice if you have a bit of a tummy.\n"}
{"text": "Awful and returned it.\n"}
{"text": "Poor quality, cheap material\n"}
{"text": "Fabric is not typical sweatshirt material.\n"}
{"text": "Love this sweatshirt! I purchased the grey ombre which looks amazing on! It's lightweight and super soft! Love it so much I will probably get it in a second color!\n"}
{"text": "Soft comfy material, lighter weight than a spirit jersey. It is shorter in the torso than anticipated so Im glad I ordered a size up to have a little baggy room.\n"}
{"text": "The material was more thin than expected. I was looking for a sweat shirt material. Cute colors.\n"}
{"text": "Thick material, but comfy\n"}
{"text": "This is not sweatshirt material, not warm for winter. I returned it. Cute colors,  extremely shiny material, spring wear. Not t-shirt material either.\n"}
{"text": "Not sweatshirt material\n"}
{"text": "Runs small\n"}
{"text": "I love it this sweater\n"}
{"text": "I'll never wear this So much cuter advertised than the actual product....cheap looks\n"}
{"text": "This looks nothing like the cotton shirt in the pic. Cheap\n"}
{"text": "neck too large\n"}
{"text": "nothing\n"}
{"text": "The fabric isnt fleece.\n"}
{"text": "Material was very odd...\n"}
{"text": "The quality of fabric feels cheap\n"}
{"text": "Material is awesome... recommend ordering smaller size.\n"}
{"text": "It was not what I was expecting\n"}
{"text": "Very cheap looking, I ended up returning\n"}
{"text": "Awesome gifts a bit too big as it should perfect fit\n"}
{"text": "was a gift and they loved it.\n"}
{"text": "If you get a large cause you want it baggy be prepared for the sleeves to be huge.  So huge you cant even role them up right.  I so wanted to love this but no!\n"}
{"text": "I did not like this sweat shirt at all. I do not recommend it. The color was light I was very disappointed does not look like the picture at all\n"}
{"text": "Great color. Exactly as pictured.\n"}
{"text": "This sweater is extremely soft and so comfortable.\n"}
{"text": "I love the feel of it. Is the perfect weight n got nicely. Am going to order another one or two.\n"}
{"text": "I hate the material. It is not like a sweatshirt. It looks like material a man would wear.\n"}
{"text": "Product is very small, ordered the sweatshirt a size bigger and I'm glad I did it it wouldn't fit.\n"}
{"text": "I like the colors,I thought it would be material like a soft sweatshirt,not so.\n"}
{"text": "I was worried because my daughter is picky when it comes to clothes. We bought this for her for Christmas and its her favorite top right now.\n"}
{"text": "Didn't fit\n"}
{"text": "Great sweatshirt!\n"}
{"text": "The colors are beautiful, the material is soft but wrinkly\n"}
{"text": "This is not a sweatshirt as advertised.  It's more like a jersey long sleeve shirt.\n"}
{"text": "Style and weight of product.\n"}
{"text": "The material has a weird shine and feel to it..more then likely it will be returned .. it looks great in the picture but very disappointed..\n"}
{"text": "Material was not sweatshirt material and didnt like it\n"}
{"text": "I do not like the fit or th material.\n"}
{"text": "just because is has cuffs and a bottom band does not make it a sweatshirt, It is some kind of shiny polyester. And it is cut really small.\n"}
{"text": "This is my favorite sweater! I absolutely love it and get a ton of compliments on it!\n"}
{"text": "This sweater is very comfortable and fits as expected\n"}
{"text": "Good buy\n"}
{"text": "Love it !\n"}
{"text": "Cute and lightweight sweatshirt.  Great for fall evenings or spring mornings.  Fabric is different feeling than your typical sweatshirt.  Not warm for winter, but nice and light.  I don't like big and bulky sweatshirts, so this is perfect.\n"}
{"text": "Fits true to size, soft and comfortable\n"}
{"text": "Advertisement said sweatshirt so I took it as sweatshirt material so I ordered larger size.  This is not sweatshirt material.  It is big but tolerable.\n"}
{"text": "Fits as expected like the shirt\n"}
{"text": "Gift for Christmas\n"}
{"text": "Lighter and more fitted than a sweatshirt.  This is flattering. I am 5'4\",135 lb, size small fits well.\n"}
{"text": "The colors are pretty but its definitely not a sweatshirt. More of a polyester feel. Pretty oversized as well. Would not purchase again.\n"}
{"text": "Im 40 weeks pregnant and the medium fit me wonderfully. Very soft sweatshirt. Different material than expected, but very comfortable. Runs a little large but perfect for my bump!\n"}
{"text": "1. This is an oversized T-shirt, not a sweatshirt. 2. The colors are much lighter than in the picture.  In fact, when my husband saw it, he said it looked old and faded. 3. The neckline in front lies funny. Its not flat against my chest, but perhaps it would be better if I ordered a medium. The neck looks stretched out.\n"}
{"text": "The shirt was soft, comfortable and perfect to run my errands.\n"}
{"text": "When I read the description as a sweatshirt, I expected something a little thicker, and heavier in weight. If you want a thin, light weight long sleeved shirt, this is the Shirt for you. The colors are beautiful though\n"}
{"text": "So cheap looking and feeling, returned immediately. Would not recommend!\n"}
{"text": "Another one that has that shiny stretchy wish like material. It doesn't look like the picture. It does fit as pictured just not the material I was wanting. If I wanted wish quality I would have paid less and ordered from wish not amazon.\n"}
{"text": "Sleeves are very long. Color is not as vivid. Not as soft as I would have liked it to be. I returned it.\n"}
{"text": "T  JV e shirt is ridiculously small. Horrible fit\n"}
{"text": "Good\n"}
{"text": "Fabric is to heavy\n"}
{"text": "Not the material I expected, it doesnt look like the pic \n"}
{"text": "It is not a sweatshirt. Its nylon pullover. Very cute but not a sweatshirt\n"}
{"text": "Ran bigger than I thought.\n"}
{"text": "Very comfortable. Fit true to size.\n"}
{"text": "This shirt is comfy and cute.  Washes well.\n"}
{"text": "The sweatshirt was a stiff rough non stretching material\n"}
{"text": "I was hoping for a more comfy / cotton material but its cheap and elastic feeling.\n"}
{"text": "Its a very cute top for my daughter, but its not a sweatshirt. Its a very thin, almost silky material.\n"}
{"text": "This is silky feeling, not at all what Id call a sweatshirt.\n"}
{"text": "Poorly made, cheap material. Oversized awkward fit.\n"}
{"text": "\n"}
{"text": "Very thin material and color faded after second wash.\n"}
{"text": "Love the sweater, just didnt like that it was short in length.\n"}
{"text": "Very cute and comfortable\n"}
{"text": "Not an actual sweatshirt\n"}
{"text": "Flimsy material, not as expected\n"}
{"text": "Got this for my daughter for Christmas.  Fit perfect. She loved it\n"}
{"text": "Not the kind of material  I expected.\n"}
{"text": "great product. different texture than expected\n"}
{"text": "Colors are cute and fits great... just hard to tell what side is the front!\n"}
{"text": "Cute colors but material is very thin, more like a shirt than sweatshirt\n"}
{"text": "Its like a crop top kinda. Way to short for my liking\n"}
{"text": "Is not made the way it looks on the site. Only thing similar is the color\n"}
{"text": "Nice and lightweight. Loved the colors.\n"}
{"text": "Very comfortable\n"}
{"text": "Good material, but the design doesnt match the picture.\n"}
{"text": "I dont care for the fabric or the style.\n"}
{"text": "It was great although I didnt like the silky look it had\n"}
{"text": "Comfy but way too tight and I got a size larger than I typically order.\n"}
{"text": "Fits lose like I wanted. Sleeves a little long.\n"}
{"text": "Ordered this for my daughter. She loves it.\n"}
{"text": "Liked it a lot for really well\n"}
{"text": "Material is cheap\n"}
{"text": "Comfort ad warmth.\n"}
{"text": "I like the different colors\n"}
{"text": "This material is cheap and not cute\n"}
{"text": "Is not sweatshirt material\n"}
{"text": "Wasn't as described.\n"}
{"text": "Cruise\n"}
{"text": "Colorful\n"}
{"text": "Arrived on time and product was excellent quality.\n"}
{"text": "Ordered a 2x tie dye block blue, white, and grey.  Received VERY quickly (1 day shipping), but does not fit as expected. It appears to be an oversized top on the website, but it fits true to size. I normally wear anywhere from an XL to a 2X and that's how it fits me. The sleeves have a nice length to them, almost too long, and the material is very comfortable and soft. I plan to keep it, but won't be able to wear it with leggings like I was hoping. If you're a size S-L, definitely go up at least one or two sizes, if you prefer an oversized look.\n"}
{"text": "Fits great, true to size...nice and cozy!! Would definitely purchase again!! I am 53 and 160 lbs. the material is a 95% polyester so it washes very nice too!! You can dress it up or wear it casual!!\n"}
{"text": "While this looks like a sweatshirt in the photos, it does not have the look or a feel of a sweatshirt in real life.  It looks shiny, almost like a swimsuit, and does not feel soft or comfortable.  It also smells like mothballs, could actually smell it through the plastic packaging and gift bag. Will be returning.\n"}
{"text": "I did not like this product at all. It said it was a sweatshirt and I believed that. My mistake for not looking at which materials were used. All of stretch materials which I do not like. What ever happened to good old cotton!!  I kept this shirt which now I am sorry for.  Not as loose fitting as they claim.  Should have bought a size larger than I normally wear. Wore this once and put it in the wash and probably never wear it again.  My own waste of money.  Just don't like the material enough to put it on again.  I much prefer cotton to this new everything stretchy phase that is happening now.\n"}
{"text": "This is NOT a sweatshirt. It is a polyester shirt not fleece and not sweatshirt like at all. If you are thinking this is a cozy fleece dont buy this.\n"}
{"text": "the neckline and sleeve cuffs on these seem very stretched out or large, the colors are lovely but sleeves are huge\n"}
{"text": "Looks horrible.  Too loose.  Not even the same material as shown.  Ore like papery thin paper\n"}
{"text": "I like the dye but the top was to small.\n"}
{"text": "Very satisfied with this purchase I recommend I got a large and its so comfortable \n"}
{"text": "True to size and comfort.\n"}
{"text": "Says it is a sweatshirt but it is a silky material\n"}
{"text": "Love this orange dress fit perfect\n"}
{"text": "It's okay, just that the colors are faded. The photo that they show is edited. But the design is pretty much the same except for the vibrant color that they show.\n"}
{"text": "Love the style, hate the material.  I saw in the description that it was poly/spandex, but it isn't as soft as I had hoped.\n"}
{"text": "Material was scratchy not as described fit was weird would not Recommend\n"}
{"text": "True to size\n"}
{"text": "The shirt has very nice color, I love the material, but, the sleeves are way too long!!!!\n"}
{"text": "This is not a sweatshirt! It is a long sleeve t-shirt. Cute and comfy but not a SWEATSHIRT.\n"}
{"text": "Cheaply made Boxy and weirdly designed\n"}
{"text": "Love the design. A good value.\n"}
{"text": "This is so cute and incredibly soft! I cannot wait to throw this on and head out. Beautiful sweatshirt, I am sure it will be a favorite this winter!\n"}
{"text": "Not soft as I had expected but the colors are pretty and true to picture.\n"}
{"text": "The colors weren't as bright as I thought they would be but I still like it!\n"}
{"text": "I purchased thinking it was a sweatshirt.  It is not. Its very light weight - much like a long sleeve tshirt.  The sleeve balloons out at the wrist, making it very baggy and awkward to try & roll.  The white part is almost see thru.  Very misleading description.\n"}
{"text": "these were beautifully colored but the material is a cheap polyester, not a sweatshirt material at all. I thought washing would pull some of the shiny silkiness but but it did not budge\n"}
{"text": "Its horrible, its super thin kinda slick material.  A little small but what Im majorly disappointed in is the colors.  It just doesnt look like pic at all.  It has no orange tones at all which I liked for a kinda muted rainbow color that I thought it would be\n"}
{"text": "Did not like the shiny fabric\n"}
{"text": "Love the shirt, but I should have gone to larger size, does run small!  It's very soft.\n"}
{"text": "Definitely NOT A SWEATSHIRT. Has a strong chemical odor as well.  Its a Poly/Rayon blend shirt\n"}
{"text": "This shirt was just OK.  The sleeves are a little too short, and it just doesn't feel as cozy as a sweatshirt.\n"}
{"text": "This item was listed as a crew neck sweatshirt but it was no more that a very large long sleeve t-shirt\n"}
{"text": "It was very pastel in color but I thought it would be bright like the picture.\n"}
{"text": "Cute, but not very sweatshirt material. I would have preferred cotton\n"}
{"text": "The fabric is crappy for a sweatshirt & not oversized enough for me.\n"}
{"text": "Love the colors! The material is a mix of a t shirt meets athletic material. Very breathable. I would suggest going up in a size if you would like it to fit looser. I am normally between a medium and large. I first ordered a large and it was fitted and not the look I was going for. I exchanged for an XL and it is a more relaxed fit.\n"}
{"text": "Too boxy looking and huge. Made me look fat, its pretty but not as nice as the photo.\n"}
{"text": "This shirt says small but is closer to a large. No way will it fit my Grandaughter\n"}
{"text": "Poorly made and designed\n"}
{"text": "Fits perfectly, I ordered a 2XL! It's kind of weird silky material, but it's super comfy, and super cute! Also it's not really gray at the bottom it's more white, color is a little different, but I still like it.\n"}
{"text": "I love this sweatshirt! It feels more silky than normal sweaters and the fit is perfect!\n"}
{"text": "Super soft, super comfortable.  Received it in the mail yesterday and wearing it today.  So comfy!  Love the color\n"}
{"text": "Nice warm material.  Was a bit too small. Will reorder and exchange.\n"}
{"text": "Super comfy, it has turned into my favorite sweatshirt. I love the colors and the material keeps me warm but not overly warm.\n"}
{"text": "Very nice the feel of it is very nice\n"}
{"text": "The material feels like plastic and smells horrible. This is going back.\n"}
{"text": "I absolutely love this sweater! Its light weight, comfortable and so soft! I ordered a size large because i like them a little baggy and its perfect! Definitely going to order more colors\n"}
{"text": "Granddaughter loved it\n"}
{"text": "This piece of clothing is branded as a \"sweatshirt.\" Let me tell you it is NOT A SWEATSHIRT! It is a SUPER thin material that feels like a sports jersey type of material. The fit was true to size and the colors were great but if you want a sweatshirt, this is not it!\n"}
{"text": "This is NOT a sweatshirt . It looks and feels just like a soccer goalie jersey. It has NO waist so it would just hang on you and look like you ran into a bunch of spattered paint in a kindergarten class . NOTHING like the picture. If you love thin boxy polyester shirts you might like it.\n"}
{"text": "I love this shirt! The size is perfect, it is sooo soft and the colors are great!! Thank you!\n"}
{"text": "I love the way it looks and I have gotten tons of compliments on it.\n"}
{"text": "Gave as a gift the person was very happy with it said it was very well-made and soft\n"}
{"text": "Great colors. I ordered an XL, it fits more like a Medium/Large. Not A sweatshirt material, more of a thick shiny polyester.\n"}
{"text": "This shirt is so cute; however, its not by any means a sweatshirt. Its just a long sleeved shirt. I found the medium to be very long in the sleeves and a very large neck hole. But, Im keeping it anyway because it was a surprise from my hubby ... and it is very cute.\n"}
{"text": "It is very comfortable and very attractive. I got compliments. It has almost a silky look to it.\n"}
{"text": "BewAre cute sweatshirt but not sweatshirt material & has ZERO stretch!\n"}
{"text": "I was disappointed in the colors. I ordered what I thought was the pinkish purple on top, a light blue green in the middle, and a periwinkle blue on the bottom. What you get is a true lavender, a true light blue, and a true medium blue. I wouldve chosen a different color scheme had I known.\n"}
{"text": "Light weight and very soft\n"}
{"text": "I do not like the material\n"}
{"text": "I love this oversized sweatshirt, it looks exactly like the picture. I bought this for my grand daughter for Christmas, shes going to love it.\n"}
{"text": "I hated the way the material felt.\n"}
{"text": "The material is terrible, like polyester\n"}
{"text": "I really liked it. Comfy. I wear between 1x-2x & glad I went with a 2x.\n"}
{"text": "Love the color and the texture\n"}
{"text": "Product size deceiving\n"}
{"text": "Material is shiny.  Not what expected.\n"}
{"text": "Same as the other one\n"}
{"text": "Just plain awful .. don't waste your money\n"}
{"text": "It shrank considerably in length, but the sleeves are super long.\n"}
{"text": "Ugly and cheap.\n"}
{"text": "The material is polyester. Not like a sweatshirt at all.\n"}
{"text": "Not happy with material\n"}
{"text": "Not at all what is shown. Super cheap looking runs small\n"}
{"text": "Awesome shirt\n"}
{"text": "I love how flattering this shirt is, and its so comfortable!\n"}
{"text": "Love it! Fits great, very soft.\n"}
{"text": "Fits well.\n"}
{"text": "Absolutely hated the texture, it is not soft, is somewhat see through, and the quality is not the best. I will be returning it.\n"}
{"text": "Once the item arrived it was not what I expected. The fabric is very cheap looking. The colors are good but I didn't like how it looked cheap.\n"}
{"text": "It was a gift she loved it  whats most important to know\n"}
{"text": "I returned the item. Material of felt gross.\n"}
{"text": "Soft and warm\n"}
{"text": "Not sure about fit, Christmas gift\n"}
{"text": "Color  not as shown  has snag across  the whole front\n"}
{"text": "This shirt is made out of a strange material. Like bathing suit. Not an actual sweatshirt.\n"}
{"text": "This is very thin material. Not soft at all.\n"}
{"text": "Cute top for myself\n"}
{"text": "This is far from a sweatshirt. Material is more like jersey material. Not soft at all. Would not recommend.\n"}
{"text": "Every thing! The colors, the softness, the fit was all perfect!\n"}
{"text": "Bday gift for fiance and she loves it. Fits her perfectly.\n"}
{"text": "Super soft and comfy not too hot great for a cool summer night.\n"}
{"text": "Not very soft a little baggy and slouchy arms more so than on model.\n"}
{"text": "The sleeves are bunched and very low hanging. It makes me feel like a clown. Only keeping as a humourous pajama shirt.\n"}
{"text": "Thought I was getting a sweatshirt it is not sweatshirt material it is a slinky polyester\n"}
{"text": "Fits terribly and isnt sweatshirt material. The shoulders and sleeves are for a giant. Proportions are completely off.\n"}
{"text": "I ordered a medium and it looks like it is for a 12 year old girl. Also is not a sweatshirt it is made out of that slick material like leggings.\n"}
{"text": "Not a warm comfy sweat shirt. More like a silk long sleeve. Runs small material not as expected I ordered xl\n"}
{"text": "Cute. A bit thin.\n"}
{"text": "Nothing like the picture. Very cheap fabric.\n"}
{"text": "Fits perfectly true to size!\n"}
{"text": "It is NOT a sweatshirt!! I dont like the material. Not a sweatshirt.\n"}
{"text": "Ugh\n"}
{"text": "Way too big\n"}
{"text": "Done not look like the picture it looks worse \n"}
{"text": "Bought it for my 11 yr old and she loves it. She normally wears an adult medium and did in this shirt also.\n"}
{"text": "Its not a cotton material. Its more like a Jersey. I was expecting a sweatshirt and I didnt get what I thought I ordered.\n"}
{"text": "Was not even close to what it looks like in the picture!\n"}
{"text": "I've had this problem before. The shirt looks long but then it fits at the waste... on the model it looks like it's rite at the top of the thighs.. so it's being returned .. other than that, or if you're a little shorter perhaps (I'm 5' 10\").... it's a nice shirt\n"}
{"text": "I love this shirt. Fits well, is thicker than I thought it would be, and is comfortable. I will be ordering more!\n"}
{"text": "The product description mentioned this item as a hoodie.  There is no hoodie and the fabric was not as expected.\n"}
{"text": "The color was as expected. The material is weird. Almost like a thicker dry-fit shirt. I wouldve wore it, but it was too short. Theres like an elastic band or something similar at the bottom that hugged my hips that made it uncomfortable. I ended up returning it. Its a cute shirt, but if youre looking for something loose and comfy to lounge around in, this is not it.\n"}
{"text": "This is not a sweatshirt, it is just a long sleeve top. Sizes run large, not true to size. Not what I expected-I wanted a true sweatshirt, this is not. Would not buy again.\n"}
{"text": "I wanted a sweat shirt. This is too thin to be considered a sweatshirt.\n"}
{"text": "It's way to tight fitting, even when you SIZE-UP.  It's as if they forget to enlarge it.\n"}
{"text": "This shirt is so pretty and soft! I love it!  Unfortunately, I wore it while eating at taco bell and their greasy tacos dripped all down the front and ruined it!\n"}
{"text": "a sweatshirt conjures up softness with a fleece interior - this product is not made of anything related to that\n"}
{"text": "Was large on me, but I took the sides in.  Very pretty and soft.\n"}
{"text": "This is NOT normal sweatshirt fabric...the shades are nice enough and matches well with the boots I recently bought from Dr. Martin but this is not what I expected. I rarely give low reviews but this is not a sweatshirt - it is super shiny and not the normal sweatshirt fabric. Also, it is not as long as pictured so I am pretty disappointed overall.\n"}
{"text": "This item appears to be a comfortable cotton or cotton blend oversized sweatshirt. It is not. I dont know what the material is, but it is very thin with zero absorbency. Having a hot flash wearing this would be a nightmare!\n"}
{"text": "I purchased in an Xlg for an oversized fit.  The sweatshirt is perfect.  I love the softness and the pink and yellow colors are really vibrant.  The item washed and dried with minimal shrinkage.  Would buy again.\n"}
{"text": "it is not the old fashion sweat shirt , it has some screening kind of print stuff...not what I expected. I gave it to my grand daughter, I am tired of sending back stuff due to it is not what I expected.\n"}
{"text": "This shirt fits good and the colors are exactly as pictured in the description.\n"}
{"text": "Need to read reviews more before purchasing since this item is not of cotton material. Is shiny like a jersey & just feels uncomfortable. I do feel also is is way overprised! I sent it back!\n"}
{"text": "I like this shirt however it is difficult to figure out front or back when putting it in.  Im not crazy about the material but is doable.  It does fit to size and attractive on\n"}
{"text": "Material was almost shiny & not what a sweatshirt should be. Inside wasn't fleecy, but just knit. Color was much lighter than in the picture. Nice roomy fit though.  Not worth the $18 in my opinion.  Returning it.\n"}
{"text": "The material isnt soft it is heavier but also feels cheap. Im not quite sure how to describe it but not happy with it. It also was very large around the neck. I got an XL for baggy fit and the neck is huge.\n"}
{"text": "Its cute but the fabric is awful and stiff. You definitely have to wear something under it or you will be super uncomfortable the entire time you wear it. I lasted maybe 10 minutes with it on and had to change.\n"}
{"text": "It is not a sweatshirt.  To silkie for one.  If your ordering a sweatshirt dont order this.\n"}
{"text": "Very cheap and looks awful!  Not at all what I expected to receive.  Never would I order again.\n"}
{"text": "Very pleased\n"}
{"text": "The material is not what I expected, I'm not happy\n"}
{"text": "Not even close to the picture. This is a short, polyester top that looks like it was made in a home ec class. Poor quality.\n"}
{"text": "Love the material & fit!\n"}
{"text": "Fits to size, could handle to be a little longer but fits well. Will order more!\n"}
{"text": "Looks cheap  like a bargain store Halloween costume\n"}
{"text": "Love the design. Silky fabric. Do not expect it to keep you warm. There is no lining at all.\n"}
{"text": "I love the feel of the material and fits like it should. tcook\n"}
{"text": "Pretty colors and great fit but was not soft. More like polyester\n"}
{"text": "Cute, comfortable sweatshirt with beautiful colors.\n"}
{"text": "Unknown about fit.  The shirt is for Christmas.\n"}
{"text": "Odd material for a sweatshirt but pretty colors\n"}
{"text": "Colors are vibrant, ordered for my oldest daughter and it was a little tight for her but the middle daughter loves it\n"}
{"text": "Not really a sweatshirt wouldnt buy again\n"}
{"text": "It was not cut out right shoulders were to tight\n"}
{"text": "Light weight nice looking shirt.\n"}
{"text": "Super cute and fit great!!\n"}
{"text": "Dish tie dye shirt is a little snug I was thinking it'd be more a sweatshirt material but it feels more like spandex\n"}
{"text": "I thought it would be more like a sweatshirt and it was thin. It was smaller and tighter than I expected. I wanted something large and cozy.\n"}
{"text": "I got a 2x, now when youre plus size, you shy away from ordering online but so glad i did, Fits very nicely\n"}
{"text": "This shirt was really wide but short and not very flattering. It was also scratchy.\n"}
{"text": "xmas gift\n"}
{"text": "I hate the fabric, its not cotton. Very synthetic feeeling.\n"}
{"text": "Its very lightweight therefore not very warm and is see through.  Also its difficult to tell the front from the back, the tag in along the seem down the side of the shirt Not worth the price\n"}
{"text": "It fits perfectly I recommend this.\n"}
{"text": "As described\n"}
{"text": "Comphy\n"}
{"text": "Material super soft sleeves 8\" too long\n"}
{"text": "Did not like the material, i thought sweatshirt\n"}
{"text": "Soft and cool material.\n"}
{"text": "Soft and comfy. Perfect for staying at home.\n"}
{"text": "Fabric is more like a jersey not like a cotton shirt. Wouldnt order again.\n"}
{"text": "Fabric is very thin-not a fan. Returning it\n"}
{"text": "This wasnt as long as I wanted and Id size up for sure.\n"}
{"text": "Generic and had to tell front from back, no tags no print in inside. Too high cut around the neck. Cheaply made.\n"}
{"text": "Medium was a little bigger than expected, but its a soft, light weight material.  Very comfortable.\n"}
{"text": "Ordered twice. A medium was too small then ordered again in a X Large and it was way too big\n"}
{"text": "The way the bottom seems its makes the short look and feel more grumpy and larger\n"}
{"text": "I love this shirt is a nice roomy shirt. Soo soft\n"}
{"text": "I love how thick the fabric is, perfect for lounging around at home on a winter day, but also nice enough to go out in public in it. Fits baggy, so definitely dont expect a tight fitting shirt.\n"}
{"text": "Loved the colors ...hate the feel of the material picture  the shirt looks longer...  will not wear\n"}
{"text": "Not good material.\n"}
{"text": "Very poor quality material. Super thin. I wear a large everything and this is super small as well.\n"}
{"text": "Sweatshirt does not look like photo. Quality is not good.\n"}
{"text": "Did not like the material\n"}
{"text": "I liked this very much, but the sleeves were extremely long.\n"}
{"text": "More like a long sleeve shirt than a sweatshirt, its not very thick. The colours are nice!\n"}
{"text": "I wanted this shirt and also the other one that zips up mAinly because I loved the bright colors. But very disappointed because they are neither one bright colors at all.\n"}
{"text": "i DONT like the product!! I thought it was going to be fleece  and not jersey and a french terry on the inside.  Like the coloring but not the material at all!\n"}
{"text": "It's okay\n"}
{"text": "Very soft sweatshirt.  The colors are vibrant.  Nice fit.\n"}
{"text": "Granddaughter loved it. She is 10!\n"}
{"text": "Soft and color as shown. I bought the purple ombre. Perfect lounging sweatshirt or casual wear!\n"}
{"text": "Lots of compliments. Love it\n"}
{"text": "This product is nothing like the picture. I wanted a gray and teal color and the entire shirt is the same dark gray throughout the whole thing. Very disappointed and will be returning.\n"}
{"text": "This product felt like plastic, very cheap looking,\n"}
{"text": "Fits well, true to size. The colors , softness and comfort are exceptional.t\n"}
{"text": "Very cheap shiny material. Was 2 sizes too small.\n"}
{"text": "Artificial fabric feel is a little off-putting.  Colors are much more muted than expected.  It fits and I will wear it, but its not my favorite purchase.\n"}
{"text": "Outside of shirt is rayon, if you've got long hair, you will get static! Honestly, the shirt is frumpy looking on and frankly, I wouldn't buy it again.\n"}
{"text": "Disappointed that it's way lighter than the photo depicted. Almost like cotton candy colors compared to the dark, pretty colors shown.\n"}
{"text": "Really like the colors but material was shiny and not sweatshirt material.  It was a little big so would size down\n"}
{"text": "Ordered this shirt but the material inside isn't soft.  My teenagers did not want to wear it so I sent it back.\n"}
{"text": "Its soft and the colors are pretty but the sleeves are a good 2 inches too short. Im tall- 5 11 so it happens but Im definitely disappointed.\n"}
{"text": "I absolutely love this too. It is very soft and warm and will be purchasing another one soon. Absolutely love the hippie vibe\n"}
{"text": "iT'S A REALLY PRETTY SHIRT BUT IT'S NOT A SWEATSHIRT. DEFINITELY NOT WARM AND CUDDLY. SLICK MATERIAL,  NOT FLEECE\n"}
{"text": "Color is as pictured and it is generous in size.  Perfect for lounging but stylish enough to go out to the shops or casual afternoon.\n"}
{"text": "This is very nice to wear.got headsturning when wearing.liked that.its soft and very comfy to wear.fits great.\n"}
{"text": "First time I washed shirt the material faded and looked inferior quality, especially for the price. Disappointed in quality of material.\n"}
{"text": "i got this order 3 days ago it was to small has a rip when i got it and is not comfy at all.\n"}
{"text": "I bought it for a gift, I think the size is too big for a med.\n"}
{"text": "Colors were cute but it stopped there.  Fit is smaller than expected and the material was a shiny awful looking slippery fabric.  Cheapened what could have been a cute top.\n"}
{"text": "Returned item. Was not the material that it stated. I expected it to be sweatshirt material and it was more of a workout material.\n"}
{"text": "This is not a sweatshirt. Made of slick cold fabric. Nothing soft and cozy as a sweatshirt.\n"}
{"text": "Honestly I didnt even try it on... its that cheap cheap material. Not worth it\n"}
{"text": "The colors are pretty but what isn't shown and what I don't like is the band at the bottom. The material is very strange, not cotton as I had hoped and very thin, I don't foresee wearing this.\n"}
{"text": "Perfect. Thank you\n"}
{"text": "This is not a hoodie and its poorly stitched. This sweater is disappointing.\n"}
{"text": "Not the same shirt in the picture.  Just black and white.  Not yellow on bottom as pictured.\n"}
{"text": "This is just a heavy weight t shirt, not warm enough for winter, but will be fine for spring and fall.\n"}
{"text": "The stitching was pulling. It was not made very well\n"}
{"text": "It runs very small, the material is gross definitely not cotton.\n"}
{"text": "Looks nice and comfy to me. But sorry until Christmas, and my daughter opens it. Can not honestly reply. Sorry\n"}
{"text": "Although this is comfortable the black looks like navy blue. The yellow color is lighter than pictured\n"}
{"text": "Comfortable, stylish\n"}
{"text": "Love this. Looks really cute with shorts\n"}
{"text": "Perfect fit and perfect colors! Love this shirt!\n"}
{"text": "I guess I was expecting it to be cotton. But the material feels like a heavy longsleeve shirt. Overall, not bad just not what I was expecting\n"}
{"text": "Very comfortable and soft.\n"}
{"text": "Looks great on my GF!  Made really well. The colors are beautiful.\n"}
{"text": "Great product bought it as a gift and they love it.\n"}
{"text": "Not what I expected\n"}
{"text": "Super cute tye dye pattern!  Runs big. Sooo comfy!\n"}
{"text": "The fit was good it was a quality material\n"}
{"text": "Not a sweatshirt\n"}
{"text": "Loved the color a cozy look\n"}
{"text": "Did not like the fit or material.\n"}
{"text": "Casual weekend wear\n"}
