{"text": "I have purchased 8 of these mugs and 2 of them have developed a defect over time. There is a small hole on the bottom near that handle which I presume is there during the manufacturing process to permit the double wall design. At the mug is formed the hole is closed with a thin layer of glass. We have had these sealed hols on two of the mugs reopen during use and this allows water from the dishwater to enter the space between the walls of the mugs. It is a real hassle to get the water out of the space. We have to put the mugs on a paper towel with the manufacturing hole down to draw the water out of the space. The only solution to prevent this from reoccurring is to hand was the mugs that have developed this defect. We really like the mugs with the exception of this defect. At over $12 each it is not cost effective to  replace the defective mugs.\n"}
{"text": "I've always like the appearance of double wall mags but kept finding deals on espresso cups instead of regular size. These mugs are 12 oz and work great for my morning coffee. As the description says, it is incredibly lightweight. Not sure why some review says it's made of plastic, but the product I receive (with a little brand sticker 'Sweese' at the bottom) is definitely made of glass, and very easy to clean. The double wall makes the cup cool to touch even with a hot cup of coffee poured in, and prevent the condensation from happening with an iced drink. These are my new favorite cups for everyday use. Hope they will last me long, otherwise, I'll plan on updating the review on durability.\n"}
{"text": "I don't submit reviews in general but this product deserves it I'm afraid.  I have only cons to speak about. 1.  One cup leaked liquid into the insulated portion of the cup.  See picture.  It was never in a dishwasher. 2.  The cup looks like plastic and feels like plastic, cheap. 3.  The cup is not a good insulator. Sorry but I'm returning this product.  BN\n"}
{"text": "I ordered these glass coffee mugs with handle to make a set with my other coffee mugs without handle which I already have.. LOL..! Me and my husband love this glass. I love these kinda glasses as its Light weight, easy to hold even with hot beverage. Glass material is super light with smooth clear finish. So far I like them. The only reason I gave 3 star to it is it came with the seller offer to text to a certain no to receive free set of coasters and each time I clicked the link it keeps on redirecting me to a different link for the offer..!\n"}
{"text": "We had these cups for about two weeks when water from the dishwasher (top rack) leaked in between the two walls of one of the cups. . We threw that one out. Then about three weeks after that the same thing happened to the next one. We threw that one out too. We are both very immune compromised so returning them is not an option for us. They are trash. I would not recommend buying these at all.\n"}
{"text": "I like them so much so i decided to share with you. Its very cool felling to hold hot boiled water underneath of mug and know you wont burn your hand. Also the look... im a tea person so i like to see how tea bag have been prepared in mug...\n"}
{"text": "I use this mugs for my cappuccino and it tastes even better than before, the elegant design the lightweight and easiness to hold pleases your sight and taste buds\n"}
{"text": "These rapidly became the favorite mugs in our home. They're comfortable to hold, and they tend to hold the heat without burning your hands. They're also pleasing to look at. (With a shot of chocolate, a shot of coffee, and a shot of creamer, they're beautiful. Here's the downside: We've had these for less than 5 months. We haven't done anything unusual. It's broken. I discovered it in the dishwasher, when it was dripping dishwater water. I think what may have happened is that it had been soaking in the sink, and we put some utensils in it to soak those as well. I don't think anyone was overly aggressive about this, though we weren't assuming the cup was fragile, either. But maybe a knife or a fork punctured the inner layer? I really don't know. This is literally the only thing I can come up with for why it would have broken, but it's ridiculous. Obviously a design flaw. The inner layer of glass should be at least as thick as a drinking glass. I've never broken a drinking glass by putting a utensil in it. I wouldn't spend this much money on a \"disposable\" mug, so it really should have only one star just for that. But I'm giving it another star because it was good while it lasted. I bought these as a gift for my daughter. Unfortunately, she really likes them and wants me to replace the broken one. I'm a little torn about this. It really shouldn't break that easily.\n"}
{"text": "I bought 2 sets of these lovely glass mugs a month ago. My husband and I instantly fell in love with the aesthetic! They keep the liquid in the mug hot/cold for a long period of time. Unfortunately, two have broken out of the four I got. It's only my husband and I using these glasses and we only hand wash to avoid any water getting into the hole. I'm giving a rating of 3 because although the aesthetic is nice, it keeps the items at a good temp., and its easy to hold, 2 out of 4 broke within a month of having them. I'm very disappointed, I would invest in a different set so you get your moneys worth. I hope this helps you make a decision.\n"}
{"text": "I got this mugs about two months ago I didn't want to write a review until testing durability specially after unboxing the material feels extremely delicate but after two month with them being hand washed and no special treatment I'm glad to say still in one piece. If they ever break in the future will probably order more. You can't feel the temperature at all until you drink from the cup so have to be alert on that.\n"}
{"text": "Design is beautiful but the glass is thin and super light. Seems so fragile Im afraid to use it. For the price of two mugs, not sure its worth it.\n"}
{"text": "Really nice! Glass cups are insulated with space between outside and inside of cup. Hot coffee stays warmer and ice drinks stay cooler. Cups are lighter, easier to hold than other cups.\n"}
{"text": "So disappointed! The description describes it as a 12 ounce cup its definitely much smaller. Its maybe 6 oz at best.\n"}
{"text": "Packaging makes them very gift givable. They are very light in weight and delicate looking but they seem to be able to withstand all temperatures. Unfortunately, after unpacking and washing the water leaked and I was not even able to use them at all. I returned them immediately.\n"}
{"text": "It doesn't stay hot long. But, for cold beverages it stays colder. I still like the product for cold beverages.\n"}
{"text": "I got these because I drink a lot of tea and generally with tea, I like to see the color of it, hence the preference for glass mugs. I am quite happy with these.\n"}
{"text": "Love these. Well made, keeps coffee hot. Just what I was looking for. Nicely packed in a styrofoam box.\n"}
{"text": "My absolute new favorite mug! Keeps coffee warm and not too hot to hold! Love the feel and look. Very durable\n"}
{"text": "My wife previously got a gift of the Teavana brand. I broke two glasses and wanted to buy a replacement for her. I found this and bought the 12oz mug, which is way larger compared to our older one. Its very light weighted and easy to clean. It is perfect for a gift. On the down side, it does break pretty easily so you might need to be careful when washing It. Also I think it is expensive for just tow mugs.\n"}
{"text": "This mug is \"perfect.\" Not too heavy, size is just right, and looks great, too. Highly recommend.\n"}
{"text": "The cups arrived in a timely manner and in good condition. They do need to be Hans washed but I dont have a problem with that. The handle is comfortable, my coffee stays hot for a good long time. They seem durable but only time will tell.\n"}
{"text": "After only using these mugs for a week, they are \"murky\" in appearance.  They look dirty even when they're clean.  Did not hold up to being cleaned in the dishwasher.  I through them out after only a week because they appeared scratched up and dirty even when they were clean. Do NOT recommend.\n"}
{"text": "Great mugs! They keep in the heat for longer than anticipated, easy to hold/grip, & nice looking.\n"}
{"text": "My mugs arrived quickly and well-packaged.  I was surprised at how light they were, but they are sturdy nonetheless.  My coffee tastes wonderful - just seems brighter and fresher.  Stays hotter longer.  I am very happy with my purchase and would recommend these glass mugs!\n"}
{"text": "Love the look of these mugs and they keep my coffee hot/warm MUCH LONGER than a regular mug. They feel very lightweight and seem like they would be somewhat fragile but have yet to break with regular use. No problem in the dishwasher either.\n"}
{"text": "I'm having a hard time getting in touch with the company. One of my mugs has sprung a leak and liquid grts in the walls and leaks out when I fill it rendering it unusable. I'm still trying to get in touch with Customer Service.\n"}
{"text": "Both cups broke within 5 months of hand washing. The first broke within 2 months and the 2nd broke on the 5th month. Never washed in a dishwasher, hand washed only. Eventually, the top of the cups will crack and that is the beginning of the end. It will take maybe 2 weeks after the first crack for the cup to completely break. Too fragile and not worth it. Save your money.\n"}
{"text": "These are not only beautiful they are light not heavy that is what I was looking for.\n"}
{"text": "We love these cups very generous portion in the 13.5 oz cup. Keeps coffee hot for a while. Longer than a regular mug. These are simply great.\n"}
{"text": "We purchased this for our new apartment. We moved in less than a week ago and when I took the mug off the shelf to use it for the 3rd time, the handle was chipped. I almost cut my finger. I kind of expected it to happen because the handles are so thin and weak in proportion to the mug. Do not buy these mugs. Waste of money\n"}
{"text": "So I just got these coffee mugs delivered today and used them for tea. I was surprised at how little heat transferred not only to the handle, but to the rest of the mug as well. Despite the near boiling water, the entire thing was only slightly warm to the touch. I had to double check the tea hadn't gone cold! I do have to drop a point off for the actual texture, though. It was a bit slippery when picking up not using the handle, and its pretty light so it'd be easy to drop if you're not careful.\n"}
{"text": "We liked the cup and used it occasionally. We hand washed and placed it on our kitchen shelf after each use. But within a few months the cup began to crack around the lip. After more cracking, we are throwing it away. For the price we paid it should last or be replaced under warranty.\n"}
{"text": "Your browser does not support HTML5 video. Ive been using them everyday since I bought them. They came with i think one year warranty if you sign up within 21 days which is awesome . I never experienced that kind of support from buying glasses ever. Cant imagine my life without them. Considering buying more in different sizes\n"}
{"text": "Loved my two cups until I washed them. One did great, one not so much. My father in law has not had any difficulty with his with daily use, and my one remaining is great!\n"}
{"text": "Its super cute and looks great with my experimental drinks Im trying out due to quarantine! They are easy to clean and so far no problems with water coming into the center ( Ive only been hand washing them). They are surprisingly larger than I thought they would be- which is a good thing! They are pretty sturdy but just be careful because they are made from glass.\n"}
{"text": "These mugs are nice! They keep coffee warmer for longer than regular mugs and my fiance loves them. They're a little light and kind of have that plastic sensati\n"}
{"text": "I was gifted a Nepresso machine for my birthday and was excited about ordering the 12oz double wall mugs. I was a little skeptical because there were numerous bad reviews about receiving broken or leaky product but was very surprised when I received my package as they were packed very well. The cups are light but very durable, be careful when sipping as cup is cold but coffee is hot!!! I LOVE MY CUPS\n"}
{"text": "I love this product. I just got the product today and used it 3 times already. Its gorgeous!  Now that Im home for quarantine I want to hve an elevated coffee and tea experience. These Sweese glass cups are beautiful. Experiencing them is even better. My home made lattes, tea, even smoothies are more enjoyable because of these cups.\n"}
{"text": "The mugs arrived on time. They where in very protected in the box which was a concerned. They also included instructions on how to get a replacement if they were broken during shipping, so thats a non issue. They looked great and I love to see what I'm drinking. I am very happy with my purchase.\n"}
{"text": "The best way to enjoy a cup of coffee is in a glass cup/mug. These are the best, pretty, sturdy and keep the coffee hot for a while. Well, long enough to enjoy and finish! The glass feels strong, so I'm not scared to handle the mug.  Well worth the price! Will replace if I need to.\n"}
{"text": "I use these to drink my coffee and really like them. They're lightweight yet durable. They have a good feel. They're very pretty also and it's nice that you can see the colors in your drink.\n"}
{"text": "Excellent coffee mug. Easy in the hand and keeps the brew warm longer than the average mug.\n"}
{"text": "Se meti agua y no nunca sali y a los tres das se quebr muy caras para la calidad\n"}
{"text": "Small Handel but other than that its a good mug and my favorite and its insulated so you dnt feel the hot coffee or tea if you hold the mug with your hand\n"}
{"text": "Unlike other double walled mugs Ive had in the past, these were really hot to the touch. More importantly, one of the mugs shattered after owning only a few weeks - filling with room temperature water and no previous dropping, etc. They look good, but dont last.\n"}
{"text": "The mugs are cute and have a great aesthetic to them. Hold the perfect amount of coffee for me. only thing is to be careful when hand-washing them as the glass is very slippery.\n"}
{"text": "These glass mugs are perfect for everyday use. They are easy to clean and a perfect size for my morning coffee. I also find the design very aesthetic. The double walled design works well in maintaining the temperature of the liquid.\n"}
{"text": "Love these mugs. Really large and sturdy. They might be on the pricier side compared to other on the site but its worth it. I tried another brand out and they arrived cracked so I went back to Sweeze!\n"}
{"text": "Saw this product in a youtube video and fell in love with it. I especially like the design because it looks very clean, stylish and simple. It is easy to wash and i like that it works for both hot and cold drinks!\n"}
{"text": "Love these mugs, I recently bought these for Mothers Day gifts. They were a big hit!\n"}
{"text": "Exactly what i was looking for. Ive been trying to find clear glass mugs like this that werent too hot to hold and these are perfect. I will definitely buy more in the future.\n"}
{"text": "Loved the look of the product; insulation works good ; however it is very light and does not feel solid; dropped one and it broke into pieces.\n"}
{"text": "These came bigger than I expected. So beautiful! I love how the outside stays cool so you can hold the mug while still keeping your coffee hot on the inside.\n"}
{"text": "These mugs are great. They are surprisingly very lightweight. I love that they are double-walled because they stay cool to the touch I had almost forgotten how hot my coffee was until I took a sip lol. Would definitely recommend!!\n"}
{"text": "Just received my first set of glass coffee mugs. Looking fwd to trying these tomorrow morning for my first ever cold brew using the French press. They are very light and feel like they can break easily since they are glass, so be careful how you handle them.\n"}
{"text": "Although super cute, once you wash them water gets in the sealed portion. I even washed them by hand because the instructions say dish washer safe but they recommend washing by hand. They look cute but they're not practical\n"}
{"text": "I loved them. Simple, modern and looks minimalistic. (The vibe im looking for at my place)\n"}
{"text": "I have had these mugs for less than a month. This morning's coffee somehow ended up trapped in the double wall.  No way to get it out. I will need to toss the mugs.\n"}
{"text": "Love these mugs!\n"}
{"text": "Great for mid-afternoon cappacino\n"}
{"text": "Ive been wanted a glass coffee cup for a while until I searched at Amazon and found it and  I was so excited! I brought the glasses, and loved them. Mind you I have so many coffee mugs,  this one was a must!   I loved the fact that my coffee stayed nice hot.\n"}
{"text": "They arrived quickly, are packaged securely and are beautiful! Ive had Bodum in the past and these are a better weight and quality.\n"}
{"text": "Lightweight but contains the warmth of the coffee without making my hand warm. Exactly what I wanted\n"}
{"text": "They are so aesthetically pleasing. Gorgeous! They also work really well for hot coffee or tea. I love them.\n"}
{"text": "Great mugs, they are cool to the touch on the outside with hot liquids inside. They are very durable. And I love that they are glass and I dont have to worry about any chemical coming off of the mug.\n"}
{"text": "I love how the mug looks and allows me to see my drink. Its very aesthetic and isnt very heavy at all. I was a lot bigger than I thought, which was good for me since I like being able to hold more. It also keeps my drinks hot inside without me feeling it. Quality product!\n"}
{"text": "I love these coffee mugs, so light and it protect my hands from the heat of fresh made coffee everyday! Love the design and style, great buy!\n"}
{"text": "Packed very well in a nice box. These are great for coffee or tea drinks.\n"}
{"text": "Really love the simple design of this cup and use it daily for my nespresso machine. Love how it's lightweight and how it maintains the warm temperature of the coffee. Can't wait to purchase more in the future.\n"}
{"text": "I love these mugs.  They look like they would be heavy, but they are lightweight. I will be buying more for sure! Perfect for my Nespresso machine brewing as they show off the coffee so nicely!\n"}
{"text": "I bought several glass mugs from this company. They are beautiful mugs and when one received was broken, they immediately replaced it with 2. I will continue to buy items from this company.\n"}
{"text": "I was very unhappy with the product. The first mug broke after 1 week and the second has a crack. I even hand wash the mugs. Not worth the money.\n"}
{"text": "Such a beautiful cup! Makes drinking coffee way better.\n"}
{"text": "We recently purchased a DeLonghi expresso, cappuccino maker and wanted nice glasses that would keep our awesome coffee hot. These are just the ones!  Quality glasses, keeps my coffee warm!\n"}
{"text": "I love this mug.  Lightweight and just the right size.  I use one pot of frothed milk and two espresso pods...perfect fit.\n"}
{"text": "They are lighter than I thought they would be but love them. I made a Nespresso coffee as soon as I got them in and while my coffee brewed at 160 degrees the cup itself was not HOT.\n"}
{"text": "I bought this as a gift for a friend. She loves them and they are very aesthetically pleasing. They came very well packaged and were super high quality. I would buy from this brand again!\n"}
{"text": "I got these a few days ago and they are absolutely beautiful, they have a very modern look which I love! Cant wait to use them. Definitely would buy again.\n"}
{"text": "The cups are used for various types of coffee, including regular, espresso, latte, etc. I am very happy with my experience.\n"}
{"text": "My favorite mugs!\n"}
{"text": "Very flimsy. Doesnt hold heat well. Streaky after cleaning. Not a great item\n"}
{"text": "I'm very happy with the build quality and look. I love the double layers and it's very sleek look\n"}
{"text": "Ordered two and one cracked within a month of use.  These are not sturdy at all and are made from very thin glass.  Stay away.\n"}
{"text": "Love these mugs! Keeps my coffee hot. Easy to hand wash. I havent used the dishwasher to clean them yet.\n"}
{"text": "LOVE! so pretty & great quality\n"}
{"text": "Light large cups. Look great and easy to clean.\n"}
{"text": "Very light and attractive.  Keeps drinks hot for a substantial time.  We love the cups and will purchase more for ourselves and as gifts.\n"}
{"text": "The cups are very pretty, simple, elegant, and functional.  Packaging was great, they were delivered in perfect condition.\n"}
{"text": "These cups are super cute and customer service is amazing! Highly recommend! \n"}
{"text": "I honestly like the design and quality of the product. I bought all sets and in the future, I will get the same sets. The best part it is lightweight to hold compared to other glass products.\n"}
{"text": "Beautiful glasses! They arent too thin, not too thick, great size for espresso with some steamed milk, they are perfect!\n"}
{"text": "I loved these glasses for the first few days... then they began to get water build up between the two panels of glass. I would not say these are dishwasher friendly like they claim :( Mine are cracked internally all over\n"}
{"text": "keeps warm and you burn your lips\n"}
{"text": "Great looking mugs, love the look of these.\n"}
{"text": "These lightweight glass mugs are what I needed! I wanted them for this beautiful tea I bought and they didnt disappoint.\n"}
{"text": "i am a little concerned about breakage, they are very light weight\n"}
{"text": "These are great mugs! They look fantastic next to my coffee machine. Classy, functional and holds a good amount of coffee.\n"}
{"text": "Love these mugs! Theyre really good quality and also really aesthetically pleasing. Love being able to see my coffee inside! Also the double wall feature looks really cool and also keeps it warm longer!\n"}
{"text": "Title of review pretty much says it all. They aren't as heavy when empty as I would have expected, which is fine by me. They arrived securely wedged in Styrofoam cutouts inside the box.\n"}
{"text": "Bought a set of two, one of them broke on the first day after use. There literally was a hole in the inner layer, not at all sure what caused it. I still am using the second one pretty regularly. Also they smudge easily.\n"}
{"text": "I loved the glasses although I dropped one of the glasses by mistake on carpet and it shattered. So be Careful. Although they are beautiful elegant glasses they are also easy breakable\n"}
{"text": "Great glass mugs that also make a great gift set. Only downside is they are glass so have to care for them. Received broken mug in first set and Sweese responded and replaced ASAP. Awesome customer service!\n"}
{"text": "Works great just like I needed to keep my coffee warm without a lid\n"}
{"text": "Mugs both broken within a month of receiving them. Reached out to customer support to inquire but they took over a month to reply. Would recommend buying from another brand.\n"}
{"text": "I got these mugs mainly for drinking hot tea without burning myself and these are great for that. They're lightweight, I like how they look, they're easy to clean, and they feel pretty sturdy.\n"}
{"text": "It's a very high quality product. The package is a great condition...strong....they packed it so well. Highly recommend! It would be great for a gift too!\n"}
{"text": "Love these cups! Very attractive and so large, easy to hold. Would definitely buy again!\n"}
{"text": "Drinks stay warm but not super hot. I do love them for my coffee and tea. I had no issues washing it like other reviewers.\n"}
{"text": "I love these mugs! They keep my coffee nice and warm! They also look pretty with matcha lattes!\n"}
{"text": "After approximately 5 washes, water and soap weep into the open space of the two glasses... it starts to look unclean as a result and cant be fixed.\n"}
{"text": "They look great and are easy to clean dishwasher safe light weight\n"}
{"text": "Cute mugs! They are on the bigger side which is what I like.\n"}
{"text": "Water got into the wall in one cup after several months, but we were more than pleased by the immediate response of the vendor who sent a replacement under the extended warranty that we got by registering the product.\n"}
{"text": "Love these cups! Keep things hot for at least 50 minutes! The handle stays cool!\n"}
{"text": "Quality item that helps hot coffee to stay hot much longer\n"}
{"text": "Great cup, it held my hot coffee but the outside didnt get hot so I didnt have to worry about burning my hands.\n"}
{"text": "These have become my new favorite everyday tea/coffee mugs. They are aesthetically pleasing and keep your drinks hot.\n"}
{"text": "They hold coffee temp really well, spouse was surprised at how light they are. Perfect for brews with my Ninja CF091\n"}
{"text": "Love these mugs!  They are lightweight, almost feel like plastic but are glass!  Very trendy and stylish and also keep your beverage hot without burning your hands!\n"}
{"text": "Extremely fragile. Both mugs broke in less than three months. The first one when it gently bumped the side of the sink, and the second when I put it in the dishwasher. I had similar glass mugs from another brand (that are no longer available) that lasted several years. Do not buy these.\n"}
{"text": "Too small and did NOT keep things hot!\n"}
{"text": "This is a well made product I enjoy how lite it is and the double wall is amazing.\n"}
{"text": "Its very light, perfect size for hot and iced coffee, and very pretty!! I would definitely buy other size of this product and also other stuff from Sweese !!! :)\n"}
{"text": "Have as a gift, said she liked a lot\n"}
{"text": "Packaged beautifully! Keeps coffee warm forever, they look great and are super easy to hold. (No slips) 10 out of 10!\n"}
{"text": "The double wall has water trapped in it, I assume defective & has a crack somewhere. Not good quality!\n"}
{"text": "I love everything about these glasses. They look very modern and holds the perfect amount for my coffee. They came intact and not broken which was the best part for me. Lol\n"}
{"text": "Very practical and quite useful mugs! Looks very contemporary and able to hold plenty! Love these mugs!\n"}
{"text": "I thought the glass would be heavier but they seem very nice. Packed nicely so would not get crushed.\n"}
{"text": "Perfect cups for hot or cold drinks - I use it for all my teas, coffee, smoothies, etc. Cups are light weight yet sturdy. Just ordered three more sets to gift for friends.\n"}
{"text": "We ordered these glasses and with within the first couple of weeks the glass cracked. Got a replacement set and that one also cracked and water started going into the outer layer.\n"}
{"text": "Used my mugs 10+ times, until one of the two I purchased broke. The glass is thin (the walled layer) so my coffee leaked down into the other glass layer, did use metal spoon to mix sugar like I do all my glass mugs, glad I didn't drink the glass pieces.\n"}
{"text": "Awesome insulated coffee mug. Very chic design and amazing temperature control. Definitely a new staple for my morning cup of joe. High recommend if you want to keep your coffee warm (or cool!) throughout the day and just overall very aesthetic.\n"}
{"text": "originally bought this because i watched a youtubers amazon favorites videos and immediately added it to my cart  love the aesthetic of these mugs !!!! the double wall keeps my iced coffees cold and i was really impressed on how lightweight the mugs ended up being.\n"}
{"text": "These keep coffee soooo hot! I love the look but one broke the day I got them. The cups are fragile. Both cups broken in less than a month.\n"}
{"text": "Ive only had these cups a month or so. One already shattered in the dishwasher. Im so sad because I really love them and I followed the instructions!\n"}
{"text": "Bought this two times and both times all glasses cracked on outside--do not buy\n"}
{"text": "Beautiful glassware, easy to hold easy to clean\n"}
{"text": "Beautiful mugs but they arrived late and broken.\n"}
{"text": "These glass mugs keep beverages hot and can go in the dishwasher if not crowded together. The handle can be slippery when wet and I wish they held a little more. Overall pleased with them.\n"}
{"text": "it also didn't really hold the heat of the beverage that well. I've used bodum double walled glasses and they worked much better (and didn't crack!)\n"}
{"text": "Love these!! They are so cute . They are glass and brake easily if it slips your hands or something. Just be careful.\n"}
{"text": "I love these cups.  They make your drink taste even better.  They are kind of expensive though.\n"}
{"text": "I love these mugs! They keep my coffee warm til the end, and when using cold drinks the mug does not sweat. They were a bit bigger than I would like, but, Im happy I got My new coffee mugs. Enjoy\n"}
{"text": "We love the double wall mugs.  The coffee stays hot, and cool to the touch.  Lightweight, love em!\n"}
{"text": "These are so great l cant believe l didnt buy them before now. Total recommend them as being of excellent quality and they work great keeping drinks hot or cold. We just love them!\n"}
{"text": "The cups are exactly as described and Im thrilled with mine. I love the look of a glass mug.\n"}
{"text": "Loved it. I got it for my daughter and it is so effective - I dont have to worry about her burning her hand again when drinking tea! It is easy to hold and it checked out every box for me! Because it is Amazon I sometimes get worried about my purchases but everything you see is what you get. Its true to the photos and really does help keep the outer glass cool.\n"}
{"text": "Just the right size.  Holds heat well.  Light weight.  Just use caution when washing.  I like these.\n"}
{"text": "These cups look very nice although i don't believe they keep your drink any warmer or colder.\n"}
{"text": "Big enough to hold what you need, low enough to fit under my Breville espresso machine porta filter, clear glass, but fragile. Be careful. I love them, but you must be careful.\n"}
{"text": "Wanna show off your frothy milk? These are the mugs for you. Keep drink hot and you can see the layer of foam.\n"}
{"text": "The two mugs I ordered are made of sturdy glass and came without any defects. The packaging was very protective and even came with a coaster! My family also enjoys the insulation and lack of condensation the mugs provide. Overall, great design and its the perfect size for morning coffee!\n"}
{"text": "Absolutely love these mugs. Super chic & durable\n"}
{"text": "I love these. It is a little pricey, but it was worth it for the double glass layered look. I enjoy my coffee and tea in it.\n"}
{"text": "This is my best investment ever! I loved that I can make my Keto mug cakes in microwave and not worry about burning my hands. Its a perfect gift that everyone will love\n"}
{"text": "I love my sweese coffee mugs. I usually use for capuccinos, tea and iced coffee, very easy to hold and enjoy your drink. I bought since September 2020 and worth it!! An incredible idea for a gift or just pamper yourself.\n"}
{"text": "These cups come very nicely protected in their packaging.  It is a set of 2 coffee mugs.  They are lightweight and easy to hold without feeling cheap.  I am enjoying them and am glad I found this item.\n"}
{"text": "The design and lightweight feature make these glass cups very desirable.  Ive always preferred glass cups and these certainly meet my expectation.  I am very happy with my selection of this Sweese product.\n"}
{"text": "I was really disappointed ordering my 2nd set of mugs from them. One of the mugs I received had a crack.  Beware!\n"}
{"text": "love the clear glass mug for seeing your lattes as you make them.\n"}
{"text": "These cups are great and they keep coffee and tea warm without being hot to the touch. I get tons of compliments on them. Buying more for my office.\n"}
{"text": "We are simply in love with these mugs!! If you wash them carefully every time they will last a long time. We used them for about 3 months until I accidentally dropped another cup on top of it in the sink.\n"}
{"text": "So far I love it so much!! I am changing my review because it hasnt even been a year and even though theres all these fancy descriptions of the glass, theres water and condensation leaking in my double walled glass.\n"}
{"text": "My friend had these. we had coffee together. and I fell in love with them. Had to buy a couple. so easy to hold. very light weight. And keeps my coffee warm. I love drinking out of a glass mug.Very classy looking mug.Very happy with my purchase!\n"}
{"text": "I love the mugs. They are thick and well made.\n"}
{"text": "Today I was brewing my coffee as usual and when I went to pour it into my coffee cup, I noticed it was pouring strangely. The bottom glass inside the cup was broken so coffee was flowing in between the double walls. I havent even had these cups for 2 months.\n"}
{"text": "I LLVE this product. These mugs are so cute and affordable. I love making iced coffee with them and watching the milk pour into the coffee. The customer service was great! I had an issue with an order and it was IMMEDIATELY addressed. I am so happy with the purchase and I highly recommend!!\n"}
{"text": "Love these glass mugs.  Beautiful presentation of coffee drinks and wonderful to hold.  Keeps coffee hot, while cool to the touch.\n"}
{"text": "I absolutely love these mugs!  They are the best I've ever had.  They are durable, keep liquids hot or cold and they are easy to hold.  My husband loves them too.  You can't get any better that these.  Great for the value; high quality.\n"}
{"text": "does the job\n"}
{"text": "Super neatlooking! Great quality! I love seeing the beautiful colors of different tea!\n"}
{"text": "Pretty glass cups for coffee! Im a little clumsy so trying to be careful to not break them.\n"}
{"text": "These mugs are gorgeous and good quality! I highly recommend, they provide such a nice look for my coffee station!\n"}
{"text": "Product came as advertised. Sleek + easy to clean.\n"}
{"text": "Your browser does not support HTML5 video. In love with this mug prefect for my morning coffee \n"}
{"text": "I like this cups very much! Look great, holds just a right amount of tea. Cool to touch. Very nice.\n"}
{"text": "Es perfecta, liviana, se ve super chic. Me encanta muchas veces\n"}
{"text": "I used these mugs for my morning coffee, they keep the drink warm and they're  a great size\n"}
{"text": "The perfect size and I cant wait to gift it! Cant wait to buy a set for myself! They are so pretty!\n"}
{"text": "This is truly beautiful!! Exactly what I was looking for. Delivery was real fast as well.\n"}
{"text": "I love my cups! I use it for coffee and matcha lattes. Love!\n"}
{"text": "Its elegant. Use it for coffee.\n"}
{"text": "Lightweight mug that keeps my coffee warm!\n"}
{"text": "great coffee mugs\n"}
{"text": "I really like our new cups, they are a very sturdy glass and we love using it for espressos\n"}
{"text": "So cute! Exactly what I was looking for! Great quality\n"}
{"text": "These mugs a light and easy to hold. Great gift idea!\n"}
{"text": "Love this cup! Super cute!\n"}
{"text": "These mugs are so cute and good for coffee or a hot mulled wine \n"}
{"text": "I loved the product\n"}
{"text": "Very cute and Instagramable cups.\n"}
{"text": "Love it! Perfect for a minimalist like me! \n"}
{"text": "Love the look and feel of these\n"}
{"text": "Fancy looking cup\n"}
{"text": "Beautiful coffee glasses! And so lightweight!\n"}
{"text": "One cup cracked after less than a month of light use.\n"}
{"text": "Very thin glass, For the price I expected a better product.\n"}
{"text": "Excellent and elegant mugs!\n"}
{"text": "Beautiful cup\n"}
{"text": "Theyre so pretty! Excited to use them!\n"}
{"text": "Dishwasher safe! Easy to clean!\n"}
{"text": "Love the cups ! Exactly what I was looking for\n"}
{"text": "Clear insulated glass\n"}
{"text": "LOVE IT\n"}
{"text": "love it\n"}
{"text": "Well I don't know what kind of glad these are but they feel light and cheap.\n"}
{"text": "Great mugs!!! High quality! Great shipping\n"}
{"text": "I like how easy they are to clean. I use them to melt candy and it is so smooth.\n"}
{"text": "Great looking glass coffee mugs!\n"}
{"text": "Love these. They are very easy to hold. They hold almost as much as my favorite Starbucks mugs but are not nearly as heavy, which is now important with my poor arthritic hands. I wont be burning my hands anymore on the hot mug either. This last week I was holding my Starbucks mug of hot tea and my hand holding the handle kind of gave out, I went to grab the hot mug with the other hand, burnt my hand and spilled hot water in my lap...blisters on my legs. Time to accept I have to make a change. Fortunately these mugs are gorgeous.\n"}
{"text": "I am very please with this set of cups.  I found out when registering that they are microwave safe.  I will use them daily so I will report back on their durability.  I ran a test with my ceramic mug and they definitely kept my tea warmer during my 20 minute test.  I like them so much, I'm going to get a larger size.\n"}
{"text": "This Glass mug is a lot sturdier than I thought. I always like my tea/coffee extra hot and I always thought it would shatter one day. It hasn't! I've put it in the dishwasher and it hasn't given me an issue so far. I have one at home and one at work. I always get compliments when I take it to meetings with me. You can clearly see the inside glass layer and it's very satisfying not matter what your drinking!\n"}
{"text": "These mugs come in sets and while I do like them, one of them out of the box came defective and after just one use water became trapped in between the two layers and it cannot be easily removed.  I contacted Sweese customer service and while responsive they were happy to just refund me the cost of the one cup.  This is a hit or miss with this product.  The said to me (paraphrasing) sometimes the hole at the bottom of the insulated portion is made too large  and results in water seeping into the insulated portion - so it can happen although not often. They also advise to not wash cups in dishwasher or let them sit in water for too long.  Seems like too much work for a mug in my opinion.\n"}
{"text": "I am a ceramic mug gal, so when Sweese asked me to give these a try, I hesitated. I will just say I was pleasantly surprised and have been enjoying my iced coffee in these mugs. They are soothing to look at (especially when full!) and give me a 'fancy' feeling.  The glass is so light, they do feel like plastic as other reviews note; however, they ARE glass. I also noticed that the sealed hole from the double wall is on the bottom of my two, as opposed to just under the handle, as another customer encountered. I could definitely see giving these as a gift - so versatile, and delicate enough to be a little more classy than traditional ceramic. Thanks again, Sweese, for a great product!\n"}
{"text": "I just really like their products! These products are weightless, so easy to clean and use and adorable! I first purchased the little ones (for espresso) and I found them so useful and cute, that I had to come back for these mugs! Plus they come with a one year extended warranty and free coasters when you follow instructions from inside the box when received!\n"}
{"text": "Nice mugs. Two things though: the glass is thinner than I expected so I'm not sure how long they'll last. The handle also feels kind of thin and cheap. Also, because they're double-walled, the amount of usable volume in the mug is reduced; there's a lot of empty space between the outer and inner walls. I don't design drinkware so there may be a legitimate reason for this, but as a consumer, I wish the mug had thicker walls and/or a little more space for liquid.\n"}
{"text": "These came wrapped in foam in a very sturdy box. They are like nice wine glasses and I treat them accordingly when washing them. I have a Keurig machine that makes cappuccino and this cup is the correct size for a double tap of coffee and all the foam it makes. Being a delicate looking, clear double sided glass, give it an elegant appearance. I highly recommend it!\n"}
{"text": "I bought this about 2 weeks ago, I was so happy cuz its so cute but it broke today. After I drank my coffee i was washing it with hot water and it cracked and broke.I didnt even drop it which is so weird. Im so confused.  How can something break without dropping it? Edit: I contacted the seller and they responded in a timely manner and refunded me for the broken glass because they have 30 day warranty. Sadly the second glass broke to .\n"}
{"text": "I bought several of these mugs and after only a few months the inside glass has broken. I dont normally write reviews but this is the fourth mug that broke which was a waste of my money! These are supposed to be dishwasher safe. I put them in the dishwasher and they were fine then after completion I pulled them out and there was water in between the mug layers with cracks/chips.\n"}
{"text": "Perfect size! I drink my coffee slow and I love how I dont have to warm it. I want to order the tall tea glasses now.\n"}
{"text": "Beautiful mugs. Arrived in good packaging to help prevent them breaking in delivery. I want more!!\n"}
{"text": "Very aesthetically pleasing when drinking my coffee and teas. Also very useful because it keeps my hot drinks hot without burning my hand when holding the mug\n"}
{"text": "These coffee cups came right on time, are light weight and stylish! They go great with the rest of our kitchenware!\n"}
{"text": "These are easily breakable in hot water or the dishwasher. They do not last long. I bought 4 total and I have 1 left.\n"}
{"text": "I love these mugs, they are really pretty and big! I drink everything in them from coffee to teas, Ive already had a lot of compliments!\n"}
{"text": "I love my coffee hot and trust the double walled glass mug will do the job.  Love the looks of it.\n"}
{"text": "Love these mugs! Theyre just the right amount of warm to keep your hands toasty while sipping your coffee. They also look amazing! Would def purchase more!!\n"}
{"text": "We got them to see how they hold temperature and they did not disappoint. Also, look nice and comfortable to hold.\n"}
{"text": "Really nice and light weight\n"}
{"text": "I love the simple unique look to this mug.  I'm writing a review because Sweese gives the absolute best service ever.  I broke my mug which I was incredibly bummed about and was just in the 30 day warranty.  They were very understanding and sent my a new set of mug instantly.  Sweese is the best and I want to thank them for helping me out.\n"}
{"text": "These are nice mugs, but they dont feel exactly like glass. They have a plastic feel to them.\n"}
{"text": "Love these cups! I just ordered some more actually. :)\n"}
{"text": "These mugs are the best! I use for hot or iced coffee and other beverages. They look sleek and stylish and are so functional. Sweeses customer service is top notch. I had a cracked mug and they were extremely responsive and immediately took care of my issue. They put the customer first which is refreshing.\n"}
{"text": "These mugs are great quality, easy to hold, and are so aesthetically pleasing. I had a question and customer service addressed my concerns efficiently and kindly. Will buy more to replace my set of ceramic mugs!\n"}
{"text": "Obsessed with my glass mugs! They are  aesthetically pleasing, easy to handle and each mug holds 2 cups of liquid. I definitely recommend these mugs to anyone!\n"}
{"text": "Impressed with these mugs.  So far seem solid and sturdy.  Packaging was excellent, and came undamaged. Easy to clean, no signs of condensation on internal structure.  My wife loves these which were a birthday gift.\n"}
{"text": "Love these mugs, wish I bought them sooner!\n"}
{"text": "Absolutely love these!! They look beautiful, my drink stays hot/cold for quite some time. I wouldnt put these in the dishwasher, I havent - they are delicate.\n"}
{"text": "I purchased these mugs because it said these mugs are glass and keep your coffee hot.  The mugs I received seem to be made of plastic, not glass and they do not keep your coffee hot longer than other mugs.  I'm very disappointed with these mugs.\n"}
{"text": "Loved these! Im putting them in anwishing well for a bridal shower gift and theyre so simple and classic. Theyre very light but seem to be good quality. Best of all the company actually packaged them REALLY well. I watched on my security camera chucked the package over my 6ft fence, and not even a scratch :)\n"}
{"text": "I love using them to drink my tea. Update: One of the mugs shattered after a few weeks, it was very fragile. The second one has water trapped inside just after a few months of use (always hand washed). I got J.A. Henckels Double Wall Mug Set after the first mug shattered, and the JA Henckles mugs do not have that problem.\n"}
{"text": "I was very impressed with the packaging on these!  I would be shocked if anyone received broken ones because they are really protected with a lot of foam.  These glasses are the perfect size.  They are keeping my coffee and my sons got chocolate hot as long as we need.  For the price I would definitely buy again or give as a gift.\n"}
{"text": "A beautiful glass adds so much to the enjoyment of a beautiful drink. These are perfect all around! They feel lightweight, so I will be handling them with care. Looking forward to many mornings enjoying my first cup of the day out of these lovely glasses.\n"}
{"text": "Poor quality glass, feels more like plastic and only a month after owning and dishwashing, glass becomes cloudy and one of them got water trapped inside the insulation.  Keep looking if youre considering something elegant to drink your coffee or tea.  Im disappointed.\n"}
{"text": "these were delivered on the 11th of march. 8 days later (used daily, handwash only, no drops) the cup has leaks between the walls.  1 week.  will update if and when the other one fails. outside of glass is unusually slick too. odd choice by the mfg. disappointed.\n"}
{"text": "Just received my Sweese pair of 12.5 oz glass mugs; wrapped very nicely, very high quality glasses (they are replacing a broken Bodum I had previously) identical quality, reasonable price, recommended.\n"}
{"text": "I've always preferred clear glass coffee mugs and I love that this one is insulated to keep my coffee, or cocoa, hot long enough for me to enjoy it. It's also great that it's dishwasher safe.\n"}
{"text": "These are of course good for hot coffee or tea but are just as nice for iced coffee. Also, serve nice for ice-cream desert service with colorful syrups streaming through them. Dishwasher safe and clean very nicely. Good quality glass.  Sweating is at a minimum even with the ice-cream.\n"}
{"text": "I love my sweeze cups. I have 2 which I love for hot drinks. Mostly for my coffee because its beautiful, perfect size and keeps it hot. I have 1 larger size for my cold water or beverages.  I will always buy sweeze products.\n"}
{"text": "We have ordered several double walled mugs from William Sonoma, Nespresso, etc.. These mugs are by far the best! It's our second order due to needing more when family visits. Great gift for someone bc you will know they are great quality and will last. Add to a gift basket with coffee, cookies, etc...Who wouldn't love a gift like that:-)\n"}
{"text": "These are very nice looking, very light double walled mugs.  They don't get hot to the touch because of the double wall design, similar to some of the high end whiskey glasses out there.  All in all very pleased for the money, aside from the spot being discolored where the mugs were \"detached\" during the glass making process.\n"}
{"text": "Hello The mugs arrived on time and its a great product. I had a small issue with one mug , I contacted customer service and they addressed the issue. I recommend this outfit , only fir the attitude and customer focoused. Ty\n"}
{"text": "They arrived super dirty with what appears to be grease and fingerprints. Supposed to be new, but who knows. Luckily they are for me and not a gift. At least they were not broken and they were easy to clean. Quality is meh, not asking for much for what I payed. Not buying more of these.\n"}
{"text": "These mugs are a game changer! Coffee stays hot longer without burning my hands and they look super sleek. These mugs are the ones youll want to hang out on display. CLASSY!\n"}
{"text": "I just received my double wall glass Sweese mugs. These were packaged very securely and arrived with no breakage. I used these at my daughter's house when she made cappuccinos . I had to buy some for myself! The coffee has such a lovely presentation in these mugs!\n"}
{"text": "There's really nothing I dislike about this product.  Holds hot or cold beverages, outside is always room temperature, you can see what's in the glass.\n"}
{"text": "Your browser does not support HTML5 video. These are PLASTIC! The website says glass. This is fraud. Do not buy. Instead of a high quality gift I gave crappy plastic coffee cups. Embarrassing.\n"}
{"text": "Stunning! I had been wanting to buy these for a while but could not find myself justifying spending so much money for a mug. Especially when there are about 200 of them in my cabinet. Bit this one is something else! I love it!! Such a chic look and every morning i wake up excited to drink coffee in my new mugs hah. Totally worth the money!!\n"}
{"text": "This is definitely glass.  Im down to one now because one has chipped already due to me forgetting that its glass and not plastic.  I've taken care of the other and have used it often.  So far, so good.\n"}
{"text": "Muy buena compra\n"}
{"text": "Very well packaged. Nice weight, hold the heat.\n"}
{"text": "Great cups. One broke during shipment but theyre great.\n"}
{"text": "Didnt really keep coffee or tea hot\n"}
{"text": "The glasses look just like the photos. I've seen some other reviews that say they get water in between the layers so I've only hand-washed them, but they look great! They are light and easy to hold.\n"}
{"text": "The cup is attractive and easy to hold, but if you are looking for an insulated container, I couldn't recommend it.  It doesn't seem to hold warmth any better than a conventional cup.\n"}
{"text": "They are bigger than I though. they are so cute! i love them.\n"}
{"text": "Very nice. Looks heavy and fancy but is actually very lightweight. Def the look I was going for.\n"}
{"text": "good quality\n"}
{"text": "These cups are amazing. I really enjoyed drinking out of them. The coffee stayed hot. I usually have to reheat my coffee at least twice before I finish it but I finished without reheating at all\n"}
{"text": "I have been wanting a double-wall coffee mug with handle and this came. Very ergonomic, easy to clean and can accommodate the right amount of morning energy for me. I would want to get few more.\n"}
{"text": "These cups are great.  The look is modern and fun to give to guest with a warm latte.\n"}
{"text": "Love these mugs! It's my second set because everyone loves them. Just be careful when hand washing them as the glass gets really slippery.\n"}
{"text": "The cups were great but cracked after the second use - hand washed and the rimmed chipped off and cracked down the cup so can not sip out of now.\n"}
{"text": "Love these double wall glasses, they are perfect for my iced coffee (I'm addicted). These are perfect and very easy to clean!\n"}
{"text": "Feels incredibly cheap, very fragile, one broke within a week. Water also gets inside the outer layer.\n"}
{"text": "My coffee mugs arrived on time. They're very nice and sleek. I'll be using them for my coffee bar.\n"}
{"text": "I love drinking my tea from this cup. It stays hot and its easy to wash by hand each day.\n"}
{"text": "Keeps my coffee hot.  Looks nice, but 1 of 2 Had small defect and reached out to company with no response.\n"}
{"text": "I love my glass coffee mugs My coffee look so yummy in every morning, easy to hold them outside and enjoy sunshine with a nice beautiful coffee cup\n"}
{"text": "Nice packaging. Love it.\n"}
{"text": "I love to see my Black Coffee in a See thru glass!\n"}
{"text": "Excellent quality! Love it!\n"}
{"text": "Love it\n"}
{"text": "easy to hold\n"}
{"text": "Looks exactly like the picture! Its not super heavy but yet durable. Perfect size!\n"}
{"text": "Its very easy to hold and its light\n"}
{"text": "Great product, I wish could be little cheaper\n"}
{"text": "Very light weight and so nice\n"}
{"text": "Love it\n"}
{"text": "The cups are neat to see,easy to use and clean, keeps coffee or tea hot. Using them for a cold drink works as well. Will buy more now that I see how nice they are!\n"}
{"text": "Fits well 10oz coffee serving from our Keurig machine, still have ample space for creamer/milk. I enjoy my morning coffee more since I dont feel any heat on my hand while sipping. Even my husband loves it too (to think he has high standard on his coffee cup/mug). This is a nice gift idea for coffee/tea lovers!\n"}
{"text": "Love these mugs, because of the double glass the mug does bot get hot so it not burns your arm when you drink hit tea or coffee\n"}
{"text": "Love to see the foam on the top of my coffee.  Adds to the experience.\n"}
{"text": "Attractive design, comfortable to hold!  The are microwavable and dishwasher safe!  Awesome item!\n"}
{"text": "These are super cute! I thought they were going to be heavy but they are very light. They are durable. It keeps my coffee hot not my hands. I love how safe these are.\n"}
{"text": "Bought the 12.5 oz double wall glass. The product packaging super secured. I love these glasses for both iced drinks and hot drinks. They are also super sleek and trendy\n"}
{"text": "Beautiful and functional yet doesn't feel like it's going to break. Exactly what I was looking for.\n"}
{"text": "I love these mugs, Very light to hold and keeps your coffee warm a long time. Plus they are lovely.\n"}
{"text": "I bought it for my parents.  They are 93 and 90.  Their coffee would get cold to soon.  These mugs seem to help.\n"}
{"text": "Good quality and exactly what I was looking for.\n"}
{"text": "I was looking for some glass tea mugs that would keep my tea hot. These are perfect. My drink stays hot but my hands stay cool!\n"}
{"text": "My mugs have water bubble after a little over a month of having them and one cracked in the dishwasher. So upset about this!\n"}
{"text": "Does not keep coffee any warmer than a cup. Waste of money.\n"}
{"text": "Looking good as a first impression. Well see what happens on the durability over time test!\n"}
{"text": "It is a perfect size coffee cup. Lightweight and lead free. I bought them for my home\n"}
{"text": "the design is beautiful! love my morning coffee with it!\n"}
{"text": "We absolutely love these glasses.  Cool to the touch even when filled with hot tea.  Beautiful to look at and easy to hold.\n"}
{"text": "The cup is attractive, sizable, and keeps beverage hot.\n"}
{"text": "This is a quality mug. It is easy to hold & keeps my latte hot. I love this product. Five stars all the way.\n"}
{"text": "Great mugs, very cool design, everyone in our family loves them. Very lightweight and easily washes in dishwasher. My only concern is that the inner wall could be more thicker, great gift idea!\n"}
{"text": "These cups are great. Theyabre easy to hold and makes for a great gift for anyone. My coffee stays warm for a long time. I love these and will be purchasing more.\n"}
{"text": "Works very well. I'm happy with my purchase.\n"}
{"text": "We love these coffee cups but one chipped even though we were very careful washing them by hand\n"}
{"text": "Within 2 days of use there was water flowing between 2 glass walls. Overrated and over expensive. Poor Quality !!!!\n"}
{"text": "Use for morning tea and it's a great cup for that! Keeps tea HOT and easy to hold and manage. Love it!\n"}
{"text": "Great mugs! Keeps my coffee warm and looks great while at it! Always hand wash, never put in dishwasher and will look great! Love them!\n"}
{"text": "I really like the look and functionality of these mugs. Used them for coffee this morning. Great buy.\n"}
{"text": "I use them for my tea, absolutely love them,  nice size mugs\n"}
{"text": "I loooove these! Theyre so lightweight even after a liquid is in the cups. Very nice for someoke with carpal tunnel or someone who has any wrist issues!\n"}
{"text": "Glasses are very attractive and I also love the double wall design that keeps my coffee warmer much longer.  Great product.\n"}
{"text": "Good size 12.5 oz - great packaging - great customer support (for help with free gift of coasters) - nice touch with free gift - looks good Is very light so not sure how durable.\n"}
{"text": "They broke after two days so I sent them backvery disappointed because I have dishes from them that I love\n"}
{"text": "Great job keeping beverage hot, my only issue is how fragile they are.\n"}
{"text": "Love them, but the glass is too thin and cracked when pouring tea in it.\n"}
{"text": "Omg! They didnt last! got a little hit in the corner with that wood lid and this happened \n"}
{"text": "Simple things can make life way easier and happier. This mug is one of them. Its easy to handle even though coffee is really hot. I was tired of having mugs which chokes and breaks after putting any hot water or coffee. This looks nice so far.\n"}
{"text": "I use these mugs for coffee every day. They are everything I hoped for -sturdy, clear glass, microwavable and dishwasher-friendly. I had one tiny issue and Sweese customer service responded quickly and with no hassles corrected the problem. Would buy again from this company.\n"}
{"text": "This is a good cup it really keeps my coffee hot for a long time\n"}
{"text": "Great size mug. Easy to hold and keeps my morning coffee nice as hot.  These would make a lovely hostess gift.\n"}
{"text": "They look like they would be heavy, but they are lightweight. Nice looking cups.\n"}
{"text": "One of the pair cracked very quickly.. nice set however not durable for plastic\n"}
{"text": "I love my new teacup I got a lot of compliments from it, very elegant looking I'm glad I bought this one.\n"}
{"text": "I just recently got really into brewing coffee and these cups are great for the roughly 10oz that I like to drink per serving (with some headroom to prevent spillage).\n"}
{"text": "Mugs came in a very well packaged box. Our mochas look great inour Smeese mugs. Keeps them hot longer.\n"}
{"text": "Look great! High-end-looking in our modern home. Shipped in a very secure foamed box. Very happy with this. I'm going to buy more \n"}
{"text": "Love these so much ordered another one for a gift for my sister\n"}
{"text": "I am a small, gentle person, I bought these and a small set, one of each set ended up with a crack in the outer glass. Not sure how but they did.\n"}
{"text": "Love these mugs! Super cute and give off a nice aesthetic while sipping coffee. Keeps coffee super warm without burning your hand while holding the mug! A must for any coffee lover!!\n"}
{"text": "Love my new mugs. They fit great on my hand and are weight less. I recommend these 100%! Plus you get a very nice set of spoons! It can't get better than that!\n"}
{"text": "I wanted to love these mugs to go with my new Keurig.  One day and water leaked into outer chamber.  Looks awful.  Probably not a good purchase!\n"}
{"text": "Beautiful cups. A bit hard for my small hands to hold. But absolutely love the look\n"}
{"text": "My daughter asked me to buy this Sweese mug. I am so happy I made this purchase. These mugs came beautifully packaged. They look great are easy to hold and best of all they keep my coffee or tea warm.\n"}
{"text": "Cups are great definitely recommend!\n"}
{"text": "Perfect cups for everyday coffee or tea enjoyment. If u dont like something u can contact the brand and they will be more then happy to help.\n"}
{"text": "The glasses were filthy inside and out, even inside the double wall was dirty!\n"}
{"text": "Very fragile, break quickly.\n"}
{"text": "These glasses are beautiful and came packaged very well. I havent been able to use them yet or clean them which is why I gave it 4 stars. If I like these larger sized mugs Ill probably buy the smaller ones too.\n"}
{"text": "Great cups. As advertised\n"}
{"text": "Glass chipped and cracked after two weeks of normal use. Im going with a new manufacturer. Wish me luck.\n"}
{"text": "i am in love with these cups !! the double wall insulation makes it super comfortable to hold when moving the hot tea or coffee. these cups are super cute and make for a good addition to the kitchen.\n"}
{"text": "The set of coffee mugs were perfect, easy to clean and hold. I use them everyday and when one of the bottom of the mugs cracked, I was able to order a replacement (due to the 1 year free warranty). I was very impressed with the professionalism of the customer service and how fast the replacement was sent to me. Id recommend this product and Sweese to everyone!\n"}
{"text": "They are lightweight, easy to hold and aesthetically pleasing. I use them to drink coffee every morning.\n"}
{"text": "Product works well and is a described. They look very nice and really enjoy having my coffee in them\n"}
{"text": "This has been great for my 92-year-old mother to hold her tea. Keeps it warm and its not heavy.\n"}
{"text": "I had been looking for glass mugs to drink our morning cup of Joe with. These exceeded our expectations. the handle is awesome. They look great and no lead from ceramic!!! Highly recommend, and I will be giving these as gifts.\n"}
{"text": "I accidentally broke one and I am so sad, these are my favorite mugs right now because they look so chic and minimalistic lol! I intend to buy some more because I love them so much\n"}
{"text": "Great craftsmanship and is cool to touch. Was skeptical after seeing a few not so positive reviews but for the great price, decided to see for myself and Im very happy I did! Love these cups!\n"}
{"text": "I love these cups.  There is no condensation and the cup will not burn your hands. These are exactly what I wanted.\n"}
{"text": "Poor quality - cracked after microwave. Not sure if I shouldnt have used it that way...\n"}
{"text": "Love these! Well made and dishwasher safe (a plus)!\n"}
{"text": "Definitely satisfied with my mugs!\n"}
{"text": "The design is simple and elegant. Easy to handle and the packaging is very secure. Great for gifting\n"}
{"text": "Fit just right. \n"}
{"text": "Used it for coffee\n"}
{"text": "Very nice coffee cups\n"}
{"text": "Perfect size, fast delivery and beautiful style :) great customer service!\n"}
{"text": "Love them, the right size for a morning coffee, good quality.\n"}
{"text": "great, as advertised\n"}
{"text": "Great product, looks awesome!\n"}
{"text": "Disclaimer- I was provided this product in exchange for a review. I am a big fan of Sweese products and use the 15 oz mugs regularly. The double walled glass mugs are much lighter than I thought they would be. This is neither good nor bad, just unexpected. I'm used to a heavy feeling mug. The handle is a bit small, but again, I'm used to the larger handled mugs. The important things: Did it keep my coffee hot? Yes. Did it 'sweat'? No. So, it is doing what it is designed to do. I have not put them in the dishwasher because I am going to do some glass etching on them and see how it holds up. I hand wash all my etched glass. I think the price is a bit high for two mugs. If I had not been provided them to try, I would not have bought them due to the price point.\n"}
{"text": "These cups are great. Just the right size for either hot or cold  beverages. Cups were securely packaged so breakage was nell. These cups will make great gifts\n"}
{"text": "These are really beautiful and my mom liked the pair that I bought so much that she decided to buy a second pair to gift them to my sister and her husband. These are surprisingly lightweight and can be a little slippery putting them into and taking them out of the dishwasher, be forewarned. However they do appear to be sturdy and my iced coffee looks amazing in a double-walled glass!\n"}
{"text": "Cool design. But the glass double walls are very thin. Both mugs have cracked within a month from there bumping around that I've caused during dishwashing. I will admit that I didn't treat them very delicately, but I don't brake other glassware very often.\n"}
{"text": "Im so disappointed! I really wanted to like these and even gave them a good review initially. Because of some of the other reviews, I dont put them in the dishwasher and only hand wash. Ive not even had them two month and they both broke. I know things happen and sometimes its our own fault but I was especially careful with these and the way they both broke was weird. Theyre super cute but theyre not well made!\n"}
{"text": "I purchased these mugs about 6 months ago and they quickly became our household favorite- lightweight, keep beverages warm without getting the outside of the mug hot, and of course theyre aesthetically pleasing. Just last week one of the mugs did end up getting water trapped between its double walls after washing. I contacted Sweese and within two days they sent me a replacement. They were eager to resolve the issue and did so without hesitation. As a consumer that level of customer service is so appreciated. I will probably hand wash these from now on just to ensure the same issue doesnt occur again.\n"}
{"text": "I had gone to many local stores/shops to pick up some glass double walled mugs. They were either too small (3 oz); too large (16 oz); or too fragile feeling. The one specialty store where I found an acceptable size and quality mug wanted $30 each. I then decided to do a quick search on Amazon and saw these mugs. Ratings were good and price was acceptable to take a risk. I am glad I did. These mugs were perfect!\n"}
{"text": "I originally bought these for coffee, and I do, but I found them especially nice for tea!  I put milk in my coffee, so it really isnt that hot when I drink it. Tea I drink straight up, so it can be really hot. These are perfect for tea in the afternoon.  They keep it nice and hot without causing any discomfort to my fingers.\n"}
{"text": "I have had other glass coffee mugs in the past and this one was terrible quality . The cup cracked at the top almost right away. We only hand wash these glass cups and leave out to dry.\n"}
{"text": "These are pretty but very easy to break.  I mostly keep them separate from other dishes and hand wash them but still broke two.  I ordered two sets and one of them was already broken during shipping.  I believe these are copy of Crate and Barrel cups.  If I knew, I would get the original ones.\n"}
{"text": "Keeps my coffee warm for a good time\n"}
{"text": "Coffee\n"}
{"text": "Love em\n"}
{"text": "I love my sweese cups!\n"}
{"text": "Broke after one hand washing. Very thin glass.\n"}
{"text": "I love my new mugs!! The perfect glass mug I have been searching for\n"}
{"text": "Looks sleek and feels light. So far so good!\n"}
{"text": "Will use this for coffee or tea.\n"}
{"text": "Great mugs.\n"}
{"text": "it was a really good product. stable and light.\n"}
{"text": "Both glasses smashed on arrival. Barley any padding in the box. Spliters of glass cut my hands on opening the box.\n"}
{"text": "One of the cups was broken on arrival. Not worth it\n"}
{"text": "Cracked after less than a week\n"}
{"text": "Both Mugs were delivered completed smashed/broken.\n"}
{"text": "Not double walled sealed!!!\n"}
{"text": "Mine are still working great.  No chips/cracks/leakage yet and I've been using them for a while now.  I am careful to  hand wash them and to keep them separate from the other cups so that they don't bang into other cups in the cupboard.  Once I get back to working in the office full time, I will use these cups in the office as they are attractive to use.  Also thinking of gifting sets to family/friends.\n"}
{"text": "These glass mugs are lightweight and perfect for my morning (and afternoon and evening) cup(s) of coffee!  They arrived perfectly packaged and were well protected in the box so that they did not break during shipping.  They are well insulated, yet surprisingly light, and my coffee stays nice and hot.  I have other mugs that keep my coffee warm as well, but are more weighted than these.  Bonus points that they also look stylish!  I can already tell that these will be my go-to mugs.  For reference, this is my mug with 12oz of coffee.\n"}
{"text": "Nice size. Lightweight, economical. A little fragile, but still a superb value. Keeps liquids hot or cold. 5/30/2920: Got another set after breaking one accidentally. These are of superb quality. The price has increased by 35% since purchasing the previous set less than a year ago. I would like to believe that it has to do with supply from China and not merchant greed. Otherwise, great product 5 stars\n"}
{"text": "The hole in the bottom means that putting these in the dishwasher causes the them to fill up with water between the double class walls. There is no good way to get it out. The only trick I've discovered is to place each one on a dishtowel and put it in the microwave, the steam pressure forces out most of the water (but not all)\n"}
{"text": "Nice shape, and good heat insulation. Gives nice presentation for a cup of latte due to transparency. But the cup doesn't quite feel great in your hands. It's a tad too light compared to porcelain cups of the same size, possibly due to the hollow space between the outer and inner layers. Also, it makes a weird sound when laid down on a hard surface, again possibly due to the hollow space.\n"}
{"text": "UPDATE: Customer service was quick to respond and sent replacements out immediately. So far, so good. UPDATE:  On 2nd use, one of the mugs cracked for no apparent reason. I'm waiting on Customer Support to respond. Will update again with any relevant info. The glass mugs are lightweight and easy to hold. They hold both heat and cold well. They've made a great addition to my coffee bar!\n"}
{"text": "The glass mugs worked OK until today when the inside of one of them cracked. Now liquid has seeped into the insulation area. Its a shame as we enjoyed the mugs. And Im not going to go and find bubble wrap and boxes to return the defective item. I wonder if another company makes something similar.\n"}
{"text": "These are simply beautiful. You can tell how well they are crafted from the second you pick them up out of a delivery box one can only describe as bountifully excessive. You could probably drop kick this box across your yard and they'd be fine, though I don't suggest it. Hold the coll and heat wonderfully. Will definitely buy more of their products.\n"}
{"text": "These are nicely made durable mugs but unfortunately they do not keep my drinks warm for long. I find myself having to chug my morning mocha within 15 minutes or I have to toss the cold remains. I ended up buying a coffee warmer to set next to me on the couch, hopefully the warmer will keep the mug (and drink) warm.\n"}
{"text": "I have the previous version of the 12.5 oz cups but one broke (my own fault) so I purchased from Sweese again. These are heavier and the handles are bigger, so they feel a lot nicer and more luxurious.  Either versions, the ice won't melt for hours and keeps your drinks cold.  Absolutely love these.\n"}
{"text": "I use these beautiful and super light cups every day to drink coffee.  They are so comfortable in your hand, practical and durable! You would think they're delicate because it's glass but honestly they keep their word when it comes to handling the hot (very!) water from a keurig.  In fact, I am going to purchase a couple of additional sets to make a 6.  Buy them! They're so worth it!\n"}
{"text": "My husband uses this cup every day for his coffee. He loves it and it keeps it warm longer than the average cup. The only thing that worries me is how fragile they are. This is our second order. We already broke both in the last set that we purchased.\n"}
{"text": "BOTH of these broke within a month of having them, On one, the bottom cracked from dropping a single ice cub in it from 3\". The other was being put in the dishwasher and lightly banged against the washer itself. Garbage product. This is not \"more durable\" than normal glass.\n"}
{"text": "Love these! Perfect size and keeps my coffee hot longer than anything I have tried. One arrived broken and Sweese promptly responded and sent a replacement quickly. Will absolutely buy more of their glassware!\n"}
{"text": "1 of 2 cups developed a leak in between the inside and outside layer of the cup right at 30 days so I was unable to return.  Other than this issue, the cups work well and stay cool on the outside with a hot beverage.  Just wish the quality was better.\n"}
{"text": "Not much to say here, it appears to be made well. I use mine at work almost every weekday and have had no problems with cracks or breaking. It holds warmth about as good as any mug without a lid can, so no complaints there. I get a lot of compliments about how cool it looks, overall very happy with it.\n"}
{"text": "I love them! My fancy Nespresso coffee on weekends is made even better by this glass. Only slight note of warning, theyre so light so make sure they are securely on your machine while coffee is brewing (if using a K-cup like machine) because the vibration almost shook mine off the edge one day.\n"}
{"text": "Great packaging and the glasses are beautiful. They do feel thin and after reading reviews I have been very careful. I cant wait to have my coffee in them tomorrow morning! (The only reason I gave it 1 less star is because I have not used them and have not put them in the dishwasher yet).\n"}
{"text": "I bought the 12.5 oz. Glass coffee mugs as a gift for my mother. She really loves them because they are so light and she can use them and set them on a wooden table without a c toaster. Great gift!\n"}
{"text": "Aesthetically pleasing  and work amazing! I havent stopped using this cup set since i got it, quality is awesome and the double  insulated feature works keeps the liquid warm and my hands not burnt lol . I highly recommend and will be purchasing again to gift to friend for the holidays\n"}
{"text": "These have become my daily coffee mugs. The 12.5 oz is just the right size for an extra large cup, and they're lighter than the old ceramic mugs they've replaced. Haven't tried dishwashing them but the wide mouth makes it easy to hand clean. The mouth is not a standard size though, so I haven't had luck finding a lid for it; that's not really a knock on the mug though.\n"}
{"text": "These were everything and more! These not only look beautiful and make me feel fancy but they keep your hot beverage really hot! I hand wash them just like I would anything that is high quality.\n"}
{"text": "The cup splintered / cracked within one month from order. Its also not real glass. These things are garbage. Im returning\n"}
{"text": "I really loved these mugs. The clear design is super cute and it keeps the coffee hot forever. Since its double walled it doesnt get too hot to hold either, just warm enough to keep you cozy!\n"}
{"text": "I loved these mugs until....this. I just got them like sept 30, so have only had them barely 2 weeks. Although it says dishwasher safe, it doesnt appear so. I really did want to love them. :(.\n"}
{"text": "We purchased a Nespresso machine and wanted to be able to have mugs that hold and keep the coffee hot, while displaying the layers of coffee, creme and frothed milk.  These mugs are a perfect design and fit for our new machine!\n"}
{"text": "Just wanted a regular-size coffee cup. This one is a bit too large. Otherwise, excellent.\n"}
{"text": "This is my second time I had purchased this coffee mugs and they are so beautiful. The are elegant, good quality and they keep the coffee warm. Highly recommended.\n"}
{"text": "I am immediate fan of these cups.. they are tough and strong and yet beautiful piece..the double wall didn't make the cups hot when you have hot beverages... I once hit one by mistake  .it didn't break..so quite durable enough..\n"}
{"text": "Delivered on time, look and feel good.  Definitely keepers.  And the extra half ounce is a clever touch.\n"}
{"text": "So funny and cool. Love that they are clear and can give satisfaction of seeing what youre drinking.\n"}
{"text": "Great product\n"}
{"text": "I bought a couple of boxes of these I am so glad I did. I love the design of them. They came packaged so well. I highly recommend!!!\n"}
{"text": "I gifted these to my mom for Christmas and she loves them! I will be getting some for myself.\n"}
{"text": "Love the cups, they are easy to hold and use. Great for having my coffee or tea everyday in.\n"}
{"text": "Have been raving about this coffee mug and design until it cracked a hole and caused this to happen. Bummed it only lasted for a month.\n"}
{"text": "One of the mugs was damaged upon arrival, but for some reason Im unable to facilitate a replacement instead of a return\n"}
{"text": "I love these. They are light weight and real glass.  Will buy more styles from Sweese!\n"}
{"text": "looks so aesthetically pleasing and great quality!\n"}
{"text": "I love the cups. We love that they are not heavy. Very elegant.\n"}
{"text": "Perfect! So aesthetically pleasing. My new favorite cups. It makes me so excited to drink from this cup everyday.\n"}
{"text": "Just what I expected! Beautiful and practical. I will be using these mugs daily!\n"}
{"text": "Perfect glass mugs so I can admire my latte skills!\n"}
{"text": "Great cups!\n"}
{"text": "I was looking for a pretty coffee cup for my macchiatos. And here it is.\n"}
{"text": "3 stars for now until I use it a little more to see what I think\n"}
{"text": "Nice mugs!\n"}
{"text": "Super cute, very light!\n"}
{"text": "These glasses look very nice and seem expensive! Can not wait to use them!\n"}
{"text": "Absolutely gorgeous gift. These are so stylish.\n"}
{"text": "These are so cute and keep my coffee warm!\n"}
{"text": "This is really a great product perfect size for lattes\n"}
{"text": "I love my cups! They look cute and easy to clean. Delivery was on time too!\n"}
{"text": "I love these mugs!\n"}
{"text": "Love these!\n"}
{"text": "Just as expected. Really good quality.\n"}
{"text": "Aesthetically pleasing and practical.\n"}
{"text": "I love it, its durable and light. I got the 12oz mugs and they are perfect for hot chocolage and lattes. The mug does overheat and you can hold onto it easily!\n"}
{"text": "Nice size and they do keep the coffee hotter.\n"}
{"text": "So nice! Loved this purchase. Hoping they last!\n"}
{"text": "I love how light the cups are and easy to hold!\n"}
{"text": "Great coffee mug worth every single penny\n"}
{"text": "great insulated mugs\n"}
{"text": "Nice cups\n"}
{"text": "These mugs are great!\n"}
{"text": "Really lightweight and good quality! Love the double wall insulation and being able to see my drink\n"}
{"text": "Exactly as expected, beautiful double walled glass cups. I use them daily\n"}
{"text": "Fits in your hand comfortably! Perfect size for latte! Makes a great gift\n"}
{"text": "I love them they look so fancy and cool and they keep your drink hot I'll definitely buying more soon\n"}
{"text": "I was looking for a mug to keep my coffee hot longer, this works. The mug looks nice, that is a bonus!\n"}
{"text": "They looks nice, but received one with crack\n"}
{"text": "I love these mugs! I also  the company. One of my mugs chipped & when I notified the company, they IMMEDIATELY sent me (2) new mugs!!!  No problems, no hassles. They were wonderful & the mugs really are wonderful. Very easy to hold & coffee stays warm. Thank you Sweese.\n"}
{"text": "I love this mug! it's so cute :)\n"}
{"text": "Glasses are so lightweight yet cool to the touch with hot coffee inside! Perfect size for my latte and I can show off my new barista abilities\n"}
{"text": "One mug has a rough edge . They are nice but very thin at the handle they feel very fragile.\n"}
{"text": "They are nice mugs. Note the liquid stays very hot, so you must be careful when drinking. We are completely satisfied. I bought a pair as a gift and a pair for myself.\n"}
{"text": "This is an updated review, The glass goes cloudy and scratched after a couple of months of use. Also, seller (maker) promises to give free spoons for review (don't fall for it) - if you don't give them 5 stars (whether you believe in the product or not) you ain't gonna get anything!\n"}
{"text": "Was way too expensive\n"}
{"text": "I dont like them,  the quality is so cheep and bad\n"}
{"text": "I like the cups, they are light weight, looking at them i expected them to be heavier. I use them for our daily espresso\n"}
{"text": "Bought these to make homemade Cappuccinos for my girlfriend and I... I made one so far for myself and loved it... it wasn't hot, but that had nothing to do with the mug. I love them! Like how thick the glass is, lightweight and the cost was great! Tim G.\n"}
{"text": "I like how they can stay clean.\n"}
{"text": "Love these mugs! Pretty and easy to use. Easy to clean as well because they are dishwasher safe, we put them in the top rack.\n"}
{"text": "Very sturdy. Beautiful mugs! Ended up ordering more!\n"}
{"text": "Exactly what I was looking for. You can make a large cup of coffee in these and still have room for milk or creamer etc.\n"}
{"text": "Very delicate but does not really keep coffee hot longer.\n"}
{"text": "Great mugs, keeps your drink hot and the double wall insulation allows you to hold the mug, not just the handle. They're perfect, and look clean.\n"}
{"text": "Great cups . They are beautiful. Unfortunately they can easily crack. I have lost two cups so far Update: now exactly one month after I bought them, another cup cracked Wont buy again\n"}
{"text": "These cups are easier to hold than our Bodum ones.  The ears are larger.  We also like the shape.\n"}
{"text": "Just received them, looks cute and not heavy .\n"}
{"text": "Very nice looking mugs, havent tried them yet, ordered as part of gift with cappuccino machine.\n"}
{"text": "This product broke,leaving a piece of glass behind,fortunately did not swallow it,very disappointed.\n"}
{"text": "These are so beautiful and well made. I love them!\n"}
{"text": "I loved  this coffee cups it came the way as I expected .\n"}
{"text": "Excellent surprise.\n"}
{"text": "I just got these today and they are so beautiful, classy and sleek! I will update once I use them!\n"}
{"text": "So cute exactly as pictured just what i was looking for. But i was not expecting the glass to be hollow between the walls\n"}
{"text": "Beautiful cups! Can't wait to use them!\n"}
{"text": "Love how lightweight it is and no matter how hot the coffee is the temperature on the outside is always warm/cool to hold the mug\n"}
{"text": "love the design. But a little uncomfortable to handle.\n"}
{"text": "Great product, would recommend as a gift!\n"}
{"text": "These are really cool but one broke the 2nd time I used it. I literally set it down in the sink and it shattered. Not very durable.\n"}
{"text": "Love these! Look super aesthetic and keep coffee super hot! Highly recommend\n"}
{"text": "We loved the mugs! You cant feel if the coffee is cold or hot! Its perfect plus the aesthetic is very pleasing!\n"}
{"text": "Love the cups, it looks very elegant and perfect size for my morning coffee. I would buy more in different sizes\n"}
{"text": "This makes six of these cups we now have.\n"}
{"text": "Great mugs that compare to Bodem for quality. Very light and modern! Hope these last for years:)\n"}
{"text": "They look amazing. Great customer service. Not the first time I purchase from them.\n"}
{"text": "Very disappointed. These are such beautiful mugs but unfortunately just after a couple uses, water has entered in between and cant come out.\n"}
{"text": "Classy and good weight and material\n"}
{"text": "loveeee these cups!!\n"}
{"text": "These are lovely!  I wish I had paid better attention to the size; thes are 12.5 inches, and I would prefer a smaller cup - one that is appropriate for an 8 oz cup of coffee. I am going to go look  and see if  Sweese has that size. I hope so!  But I am going to give these to a friend as an XMas gift, as they make lattes and these will be perfect!\n"}
{"text": "I ordered these mugs for my Nespresso coffee  as well as tea-making. I love how beautiful they look, ease to hold, and hold a bit more liquid than a regular mug, not to mention they keep my drinks warm. I will be gifting a set to my daughter, who loves coffee and recently moved into a new place.\n"}
{"text": "Received these cups yesterday. I was very pleased with the lightweight and elegant look. I had coffee in them this morning and was very satisfied with how they kept the coffee warm without making the outside too hot to hold. The handle is the perfect size. Cant wait to impress company with them!\n"}
{"text": "These mugs are lightweight and easy to hold. The outer surface doesn't get hot which is a plus, just remember that the content is hot while drinking because you can't feel it by holding it. Because it's transparent, it's cool to watch the milk cloud when you pour it in coffee, silly little pleasures of life :)\n"}
{"text": "My husband used these to heat water for tea in the microwave. The cup doesn't get hot. Perfect. Also after a year one had a leak inside the walls. Sweese  sent a new cup. They may be slightly more fragile being glass but not that it has been an issue. We love ours. Thank you Sweese.\n"}
{"text": "Wife and I invested in a nice espresso/cappuccino machine and wanted beautiful glass mugs to show the layers.  Im impressed with the quality and functionality of these mugs.  The mug shown is appx 12 ounces, so we are already looking for additional Sweese mugs and glasses for our coffee drinks.  Very impressed!!\n"}
{"text": "I recently bought a new espresso machine and these glasses were the perfect compliment to it. They not only look great, feel great and keep the lattes hot inside while keeping the mug cool on the outside, but they give my latte and cappucino drinks that professional barista look. I am very happy with my purchase!\n"}
{"text": "It is sturdy, keeps contents warm much longer than a regular cup. I use it with an individual coffee pocket, also from Amazon.  I like the straight slope of the rim better than than one that curves inward, but I have each kind and they are both wonderful .\n"}
{"text": "Ordered 4 mugs, 2 arrived broken into multiple pieces. Emailed their customer service nearly 2 weeks ago and am yet to see a reply. The 2 intact mugs are wonderful, but I would like my entire order to be intact and also some kind of acknowledgment.\n"}
{"text": "I love my hot beverages extremely hot and cold extremely cold. With these cups I can enjoy my extreme temperatures without burning my hands and without my hot hands warming my cold drinks.  I was also pleasantly surprised that my tea was still warm more than an hour after I made it.\n"}
{"text": "Great cup for coffee. Looks great and not too heavy\n"}
{"text": "They are easy to hold and super cute!\n"}
{"text": "Sturdy Cups and so aesthetically pleasing. I absolutely love it.\n"}
{"text": "These glass mugs are cute and stylish. Love the shape and great quality of glass.\n"}
{"text": "I love the look of them and how nice they feel to hold.\n"}
{"text": "They are beautiful\n"}
{"text": "Very nice! Hands dont burn when having hot water\n"}
{"text": "These seem super sturdy! Excited to try them out\n"}
{"text": "easy to hold, insulation is great\n"}
{"text": "Love these mugs! Ive been looking for mugs that are big enough to make different coffee recipes and iced drink and these are the perfect mugs!\n"}
{"text": "These are beautiful glass mugs that I use for my coffee drinks.  Doesnt get too hot, easy to hold, looks beautiful, delivered in a gift-able Box.\n"}
{"text": "Safe and secure packaging. Mugs are light and easy to hold. My morning coffee and matcha lattes look amazing in these mugs and I love drinking from them every day.\n"}
{"text": "Glass was poorly made. Upon placing firmly on a marble counter the first glass shattered. The second one broke for similar reasons. I do not recommend this product. $5 dollars more can get a more sturdy set!\n"}
{"text": "If I needed more I'd buy more!\n"}
{"text": "So far this has been a great product. It really does keep beverages warm for longer. One of the cups originally came to me with a deep scratch, but I contacted the company and they sent out replacements immediately! So easy to work with!\n"}
{"text": "Coffee stays hot. They would make a great gift. Customer service was outstanding! I got help right away in getting the free gift. I'll be looking for other things by Sweese!\n"}
{"text": "Ended up buying 6 more and 2 as a gift. Great mug. Feels good in your hand. Seems durable. Keeps coffee as warm as you could hope for from an open, glass, double-walled mug. Would definitely recommend.\n"}
{"text": "Drinking hot beverages I love the design\n"}
{"text": "These were a gift to me, and I use them every single day, for tea or hot chocolate or coffee. I never use any other mugs anymore, because I like these best!\n"}
{"text": "Beautiful, clear mugs of the perfect size and weight. These Sweese mugs elevate my coffee, tea, and cocoa to a whole new level!  It's fun to see your beverage and linger over a lovely warm beverage.\n"}
{"text": "They broke as soon as second use. So easy to break. I waisted my money.\n"}
{"text": "This is actually better than I expected. Beautiful cups!\n"}
{"text": "Great quality and my new favorite cup!\n"}
{"text": "Ideales para las cafeteras de expreso porque se ve muy lindo cuando va llenndose de caf!\n"}
{"text": "SUPER lightweight.  Keeps my morning coffee hot, but still get the joy of drinking out of a mug.\n"}
{"text": "Love these glasses - lightweight and commfortable to hold !\n"}
{"text": "Love these glasses!  Will use them for my coffee and tea.\n"}
{"text": "Light yet durable, these are perfect for hot coffee!\n"}
{"text": "Love that they are insulated AND dishwasher friendly\n"}
{"text": "Great classy sophisticated cups! Highly recommend\n"}
{"text": "Exactly what I wanted and the price was great.\n"}
{"text": "These double insulated mugs are great quality.  They were slightly bigger than I thought, but truly beautiful and sturdy. Love these glasses.\n"}
{"text": "These are beautiful but one arrived shattered and I followed the claim process and still have not received any information back.\n"}
{"text": "I started buying sweese products bcz I liked it.. Have to see how these glasses works.. All other products of it worked great.. Try these!! They look great and light weight\n"}
{"text": "These feel  like such quality cups. They have held up perfectly! :)\n"}
{"text": "Got these for my boyfriend and he loves them. Put them in the dishwasher, put both hot and cold drinks in them, and the look and held up great.\n"}
{"text": "Very cute and aesthetic product. Would highly recommend this to anyone looking for coffee mugs that will keep your coffee warm for longer periods of times\n"}
{"text": "5 Stars thats it.\n"}
{"text": "Modern, sleek, lightweight. I've gotten all 3 times I've served tea in these.\n"}
{"text": "The look of these mugs is what sells! It appears that your drink is floating in mid air...making this a cool gift to others or yourself. The glass feels relatively high quality, though I choose to hand wash them. Great conversation piece!\n"}
{"text": "These are my most used coffee cups, there sleek, clean, and easy to hold.\n"}
{"text": "Pretty cool cup lol\n"}
{"text": "Very light weight, easy to hold, very modern design. Not bulky. Well made. Its perfect for my nespresso coffee. Love it!\n"}
{"text": "I use it for coffee. Its great.\n"}
{"text": "These are not dishwasher safe. My cracked and broke.\n"}
{"text": "I love these cups, they look nice and keep my coffee warm\n"}
{"text": "Great coffee mugs ! Keeps the coffee nice and hot ! Very aesthetically pleasing with glass in glass design\n"}
{"text": "This double-walled insulated coffee mug definitely keep my coffee warm and make my morning coffee a nice experience\n"}
{"text": "Love these glass mugs. These are my second set. Be careful though, they break easily.\n"}
{"text": "I love these glass mugs! Absolutely adorable and easy to clean! They look fabulous in my kitchen!\n"}
{"text": "Love these mugs!  Stays nice and hot for a long time!! My only issue is that they are easily breakable. A slight tap on my sink and Ive already shattered two of them. Otherwise I love these so much!\n"}
{"text": "I loved these at first, but less than 2 months of use (once a day for coffee), it cracked!! Only noticed when I was washing it. I would have drank glass bits!! What's Up!!  \"borosilicate glass which is more durable . . \" that is a FALSE STATEMENT. Almost $14.00 a cup - NOT WORTH IT! Very Disappointed!\n"}
{"text": "Love the cup because its sleek but second day I used it one of the cups had water inside of the double glass. I hand washed them and it still has water inside...\n"}
{"text": "Great mugs for my Nespresso! Makes every cup of coffee perfect!\n"}
{"text": "I've ordered these glasses 2x now and also have the espresso shot glasses and couldn't be happier w/ their products! When it comes time for more, I feel confident in saying I won't hesitate to order from Sweese again! Products always come in a very protective box and keep my drinks warmer longer. Thnx for a great product Sweese!!\n"}
{"text": "The handles arent substantial enough to be comfortable and stable holding this mug full of coffee.\n"}
{"text": "I really love the way these look. I am a tea drinker and needed some new mugs and when these arrived I was thrilled. However, I can only give it 2 stars because one of my mugs broke in the sink just a few weeks after purchase. I am super bummed because I love these and tried to be as careful with these as possible but a small tumble in the sink and one was cracked :(\n"}
{"text": "Beautiful mugs! The double insulation keeps coffee warm in the mug without burning my hand and they are great to look at. Very happy with my purchase.\n"}
{"text": "So excited and I just got them in last night. They fit under the Keurig perfectly and keep the drink hit, but its very comfortable to hold. Cant wait to make a layered latte!\n"}
{"text": "Very happy with these coffee mugs. They are attractive and lightweight. Keep your drinks warm or cool longer than a regular ceramic cup. They come out of the dishwasher very clear\n"}
{"text": "First I received one glass shattered in packaging.  I was told to send back so I did.  Another set was replaced by Amazon.  Two days later cracks started showing then more cracks.  I threw them out.\n"}
{"text": "Just the right size for either hot or cold beverages. Cups were securely packaged so breakage was nell. These cups will make great gifts\n"}
{"text": "Everything I expected! Pretty ,perfect size and good quality material. It makes me wanna buy every sizes they have ;)\n"}
{"text": "Great looking mug and perfect for hot drinks\n"}
{"text": "Love the double walled glass cups! Makes my coffee and tea look more appealing. Only downside is that they are fragile and can break easily. Otherwise I love this Sweese product!\n"}
{"text": "Keeps what i put in it warm or cold, luv these cups\n"}
{"text": "Love how well these come packaged! Right upon opening, my daughter swiped one from me, washed it, and made a cup of coffee just to use the mug. Kept the coffee warm! Love these!\n"}
{"text": "The packaging was great and was well secured. The glass was great to use, especially for making lattes and hot coffee for guests. Highly recommend!\n"}
{"text": "Love these mugs. They're a beautiful design, but also practical in size and shape. Easy to hold. Perfect marriage of form and function. I enjoy using them daily.\n"}
{"text": "These are great cups. I bought them as an early birthday gift for my husband, who likes drinking tea. He liked them so much he wants to get another set for his mom. He likes that they are double insulated and easy to hold.\n"}
{"text": "Coffee\n"}
{"text": "Nice but cracked the second day after I dropped it on the counter, not even a far distance.\n"}
{"text": "Easy to hold and warm\n"}
{"text": "easy to handle\n"}
{"text": "LOVE \n"}
{"text": "Ships well, looks great, will hand wash just in case.\n"}
{"text": "Great looking cups!!\n"}
{"text": "Perfect all around!!\n"}
{"text": "Keeps my coffee hotter longer.\n"}
{"text": "pretty\n"}
{"text": "Very nice! Easy to hold , giftable, warmth\n"}
{"text": "The mugs look great and very high quality! Definitely would buy again\n"}
{"text": "Love these mugs. Weve ordered multiple sets!\n"}
{"text": "Love these mugs!!!!\n"}
{"text": "Being able to see the different layers of coffee with a quality mug.\n"}
{"text": "A love the design and the quality of the glass is high\n"}
{"text": "Great looking mugs at an affordable price\n"}
{"text": "Love them so much! Keep my coffee warm.\n"}
{"text": "Very lightweight, and keeps drinks warm! Great gift!\n"}
{"text": "Great mugs!\n"}
{"text": "Everything ok\n"}
{"text": "They're so pretty!\n"}
{"text": "Beautiful mugs! Love them.\n"}
{"text": "Lightweight, perfect size.\n"}
{"text": "Love these mugs for hot tea my husband loves for his coffee\n"}
{"text": "Muy lindas!\n"}
{"text": "Perfect mugs for coffee and latte\n"}
{"text": "Love them\n"}
{"text": "My new obsession\n"}
{"text": "One of the handles had a 1/4 square chip missing\n"}
{"text": "Keeps my coffee extra warm. Love them!\n"}
{"text": "I do like it very much . Very light glass and comfortable to use . Very happy with a product .\n"}
{"text": "Lightweight and easy to hold .\n"}
{"text": "Excellent product and great seller!\n"}
{"text": "Easy to clean, light weight.\n"}
{"text": "Great coffee mugs! Very light\n"}
{"text": "Practical and cute! Love my new mugs!\n"}
{"text": "I just open the omg and One of the cups are broken\n"}
{"text": "Love these products!\n"}
{"text": "I love the cup for my coffe\n"}
{"text": "Happy with the product\n"}
{"text": "Beautiful mugs\n"}
{"text": "Great product!\n"}
{"text": "So beautiful and easy to clean  ()\n"}
{"text": "Great size for lattes. Keeps coffee warm. Easy to clean\n"}
{"text": "Awesome cups\n"}
{"text": "Durable and look great\n"}
{"text": "Love these!\n"}
{"text": "So easy to hold and enjoy your beverage without it feeling hot\n"}
{"text": "Insulation of hot coffee. Expected it to be lighter\n"}
{"text": "These are awesome glasses. Strong and easy to grip.\n"}
{"text": "Great gift\n"}
{"text": "Amazing mug! Im very satisfied with the product!\n"}
{"text": "Beautiful and excellent quality gift for my wife!\n"}
{"text": "nice, cute  and comfortable mug\n"}
{"text": "I was excited but once I receive the 2 mugs,  I was chocked of the quality is so cheap for the price I paid \n"}
{"text": "These are so pretty cant wait to use it for my coffee!!\n"}
{"text": "Highly recommended, very nice cups\n"}
{"text": "Nice pretty glass. The handle was too small to hold comfortably. Overall it was good\n"}
{"text": "Love it\n"}
{"text": "I love it! My kids enjoy watching how the coffe falls in! Great gift!\n"}
{"text": "While I am washing it It cracked and shattered all over\n"}
{"text": "Dishwasher safe, yes please! Bought this as a gift but may buy another set for myself.\n"}
{"text": "My new mug is awesome\n"}
{"text": "Beautiful!  I love these mugs\n"}
{"text": "Love these mugs. By far the best value I was able to find.\n"}
{"text": "Love them! Nice size. Cant wait to customize them with vinyl.\n"}
{"text": "I was gifted this cups and they are easy to handle and nice design\n"}
{"text": "Didnt even last 1 year. Disappointed - i dont recommend the dishwasher\n"}
{"text": "Very giftable\n"}
{"text": "Keeps coffee hot for a long time.\n"}
{"text": "Very easy to hold and not super heavy like some.\n"}
{"text": "Beautiful sturdy mugs ! Cant wait to use them.\n"}
{"text": "The inside of the glass shattered and cut my mom while she was hand washing the item. I didnt event have the mug for a month. Would not purchase again.\n"}
{"text": "Great for coffee with milk foam\n"}
{"text": "Ive been wanting these glass coffee mugs for some time now! They are marvelous, light in weigh and keeps coffee hot and hands warm.\n"}
{"text": "such a cute a modern coffee mug!! highly recommend to any coffee lover!\n"}
{"text": "Absolutely love these cups! They are exactly what I was looking for! \n"}
{"text": "Light weight and good quality\n"}
{"text": "Super cute. but it Breaks easily.\n"}
{"text": "not dishwasher safe. After washing one of the cups retained water on the inner wall\n"}
{"text": "Love these mugs! So light and easy to hold. Will definitely buy more in the future.\n"}
{"text": "Beautiful mugs- but one chipped after I washed in dishwasher:(\n"}
{"text": "Only got them a week ago and 2 already cracked and had to be thrown out! Didnt wash well at all in dishwasher\n"}
{"text": "Was going to give as a gift but ended up keeping them because I love them so much!\n"}
{"text": "Purchased these mugs to complement my Nespresso coffee.  I love love love the way my coffee now looks just as beautiful as it tastes.\n"}
{"text": "I absolutely love these mugs! They are so cute and a great size! Definitely was what I was expecting. Would highly recommend\n"}
{"text": "Awesome\n"}
{"text": "The mugs are very nice, and look great. I had a set of two that are bigger so are the handles, for these mugs the handles are a bit smaller. But overall they make a great addition to the kitchen\n"}
{"text": "We love these glasses! They came well packaged & delivered quickly!\n"}
{"text": "Nice, large cups. Seem to hold the warmth of the coffee long than regular cups.\n"}
{"text": "Love this product !\n"}
{"text": "Chip in glass. Brand new Out of box\n"}
{"text": "Your browser does not support HTML5 video. I love these mugs. I wish I would've ordered more. When they get back in stock, I will most definitely make a mother purchase. I get a lot of compliments.\n"}
{"text": "Bought these mugs for my daughter. Shipment arrived quickly and well packaged but ... these are made out of PLASTIC not glass. They look and feel cheap. For $15/cup I expected a higher quality. The description states glass it is cheap plastic. Will be returning for a refund. False description, not happy,  Dont buy these as a gift you will be embarrassed\n"}
{"text": "They came perfect and very well packaged! I absolutely loved them!! But it seems they are not so dishwasher safe... one of them got put in the dishwasher after the very first use and broke. I was devastated! I dont use the other one much because I feel its very delicate after the dishwasher incident. But I do love the one I have left!\n"}
{"text": "I have been using this mug for months now. It comes with 2 mugs in a box protected by carboard cushion around the mugs. Very easy to use, keeps my cappuccino hot for a long time, doesn't burn my hands/fingers because of it's double wall. It is sturdy and stays in place on a flat table. It is 12.5oz, not big enough for a regular size latte, but it is big enough for coffee, cappuccinos (which is why I use it mostly) and a smaller latte. I wash it by hand, not in the dishwasher as I saw many reviews saying that it kept water in between the double walls, but it's not a hassle for me. Very elegant, it could be used for display on open shelves.\n"}
{"text": "Your browser does not support HTML5 video. Somewhere along the line someone decided it was a good idea to throw a box around containing glass. This is the outcome. So irritated\n"}
{"text": "I just received the cups today and i am using them since then, i love them! Perfect size, love the material, keep the coffee warmer than i thought it would be so this is a plus! i love the style, the capacity is large enough for a nice latte and i am looking to buy more of these cups.\n"}
{"text": "Wonderful! These mugs are a good treat! the beverage Is hot but the outside of the mug is cool! You will question whether they are glass or plastic because they are so light. Love them!\n"}
{"text": "I really wanted to like these mugs. Good looks and glass is decent for the price. The insulation factor is okay.  My complaint and the reason for the 3-stars is the handles. They are shaped in such a way that the mug, when full or empty, always has a tendency to pitch downwards and spill the contents.  The glass and handles are very slippery and it's hard to drink anything using just one hand.  If the handle was tear drop shaped and offset it would be much better and get a 5-star in my book.\n"}
{"text": "I really enjoy these cups! I have had solid glass cups in the past, and usually, the glass would get pretty hot and it would be hard to drink out of them, but these cups have two layers of glass, so the outside does not get hot! Plus it is very fun to see two separate layers of latte. Cups are surprisingly very light, and while it feels like they could break easily,  this did not happen yet (which is really good!), but I am being careful with them. Overall, very nice design, and good size (fits fairly large volume (\"Tall\" in Strabucks terms) of coffee or tea or any other beverage :)\n"}
{"text": "I am amazed at how fragile this is.  One of mine cracked now and Im not sure how it happened. Very disappointing The second pic is what happened today.  I was going to set the coffee cup down and I bumped into a plastic bottle of body lotion and it shattered so my whole $25 is down the drain. Wont buy again!\n"}
{"text": "surprised at the packaging - it was great surprised at how light the 'mugs' are surprised at the thickness - not very surprised i chose not to send back right away surprised i am giving them a chance put it in the dishwasher nothing broken or leaking made some hot chocolate - reason for buying surprised at how warm it was and how long it was warm i am 80 surprised at all the steps to get coffee spoons 'free' surprised it was not coasters as the stuff included suggested surprised i chose to do it i am an old hippie hoping that there are no more surprises\n"}
{"text": "I placed a hand washed mug in the sink, it tipped over and cracked. I have only had the mugs for three days. Seems really expensive for literally having only one mug now. They do not seem to hold the heat as long as anticipated compared to a plastic double walled Bodum mug I have. Can't send one mug back for refund, so I guess I will keep it realizing it could and most likely will, break.\n"}
{"text": "I live in cold climate but like my hot drinks.  From the description I thought these mugs would keep my beverage warm longer.  They do keep it warm longer than a regular ceramic mug, but not by much.  And they need to be hand washed.  I am careful not to use a metal spoon in them, only a plastic one, for fear of nicking the bottom and causing a crack.  I end up putting my hot drink in a thermos and putting only a small amount in the cup at a time so I can drink it before it cools off.  Not going to recommend this one.  It is not awful but not great.\n"}
{"text": "these are very light. they feel like they'll break if i clank a metal spoon around. However its been a few weeks now & they've held up. The cup never feels hot. I have placed them in a microwave with no problems, but I've taken the advice of others and hand washed these cups. I ordered another set from a well known brand. Those ones were heavier, had a quality feel if you know what i mean. Those were sent back due to knicks & a small crack. I replaced them with another set of Sweese 8oz cups. Of now 6 cups I have had 0 problems. I use a Keurig capp/latte machine. Using the recommended amount of milk ; a latte fits in these cups. I can fit a capp in the smaller ones.\n"}
{"text": "these cups are as advertised, the best coffee cup made. first off these coffee cups look fantastic, it appears that my morning coffee is suspended in midair while sitting on my table, which i think is pretty cool. the cups are easy to hold and not too big to get your hand around and with a generous handle. the cups always stay cool to the touch and clean up is easy too. the customer service is why i will be a returning customer, i had one cup that cracked shortly after receiving it, seemed like a manufacturing flaw in this cup alone. i contacted the manufacturer and explained the problem i encountered with the cup and within five minuted i was told a replacement set, not just the one cup the was damaged was being sent out. no over explaining, no hassle,  no fuss customer service with people who genuinely wish to resolve what ever problem you might encounter.i look foreward to trying all the glass cups that sw glass makes,great products, great customer service, great people to do business with.\n"}
{"text": "Prior to ordering these cups, I thought that the product was a bit too expensive. However, after receiving and trying these, I do believe these are worth the price and a very competitive product. The delivery was very fast (about 1-2days). The product is nicely packed and presentable; therefore, would be a great gift. While the cups are pretty big, they are very light (see pictures) & comfortable to hold. I recently started drinking coffee with the butter instead of the milk so I like the idea of keeping it hot longer (cooled butter on top of coffee doesnt taste that great). I also tested the cups in the microwave (for 3 minutes, usually I do 2 for this size). The outside walls were slightly warm while the tea inside was extremely hot. The outside walls were actually completely cool when I pored a hot coffee in. The cups came out nice and shiny from the top rack of the dishwasher. I cant comment on the durability just yet since Ive had these for a couple weeks. But Im pleasantly surprised by this product. This is not the first product from Sweese and the customer service is a top priority for them. But please note, they are located in Europe so the time difference needs to be accounted. This product was received for free but my opinions are my own and are not affected by the offer.\n"}
{"text": "I got this for my family. Usually we need a big cup which this is perfect for my family. Its light weight so it doesnt hurt the wrist. The double layer prevent the temperature damage from the liquid. The package also good which can give as a gift as well. Price is good and quality is good too for a glass.\n"}
{"text": "Great packaging and quality, it's a great Christmas present!\n"}
{"text": "Perfect to drink my tea out of! Would buy more in the future\n"}
{"text": "Great addition to your morning routine: see your coffee creations, without feeling the warmth/coldness in your handles.\n"}
{"text": "Love these cups! They arent the strongest, so be gentle but super cute!\n"}
{"text": "I love it. It is easy to clean, to hold and you are not gut warm. It is also beautiful and elegant!\n"}
{"text": "Super cute and light. Unfortunately, even with care, one of mine developed a crack along the rim\n"}
{"text": "Love the cups! Its lightweight and looks really nice!\n"}
{"text": "Makes a great gift! They are also very lightweight. The design allows for the mug to not overheat.\n"}
{"text": "These look really nice but water got in between the outer and inner layer and I can't get it out.\n"}
{"text": "Amazing cup! Minimal and chic\n"}
{"text": "I waited for a few weeks of using these mugs before posting my review. I use the mugs everyday and both hand wash and put them on the top shelf of the dishwasher. It depends on my level of laziness. I have yet to have water permeate the double layer. I find that they dry very quickly and without spots. You can hold the mug immediately after pouring a hot cup of tea without using the handle and not burn your hands. I really need to buy more to have a full set and get rid of my ceramic mugs.\n"}
{"text": "Adorable, dainty.  I make cappuccini by pouring frothed milk with one hand and french press expresso with the other.  Mixing it into a glass cup eliminates the problem of pouring it too dark or too light.  These cups come well packed,  Because they are insulated, you dont need a coaster to protect furniture from heat (or presumably from sweating cold drinks).  As delicate as they feel, they survive the microwave and the dishwasher.  Lovely.\n"}
{"text": "I bought this and 3 of the other top competitors: Bodum, Epare, Stone & Mill. I opted to go with this one because the handle was slightly more comfortable in my hand and it seemed high quality. The Epare and the Stone & Mill were almost identical in overall design, and weight of glass. This was just most balanced for me. The Bodum was the lowest on my list. Although their glass was just as heavy, they sealed their vacuum underneath using Silicone. Which over time and cleaning with hot water I feel like it will break the vacuum and eventually let water in. Also the silicone doesn't look very nice when looking through the cup. This Sweese (and the other two) seal the vacuum with glass. So unless it cracks I can't imagine the vacuum breaking or water getting in. Very nice cup. Sweese had the most durable packaging. A+ product. Recommendation to seller: The only mark on this cup that it is branded by Sweese is a clear plastic sticker on the underside. It easily came off with the first wash. I'd recommend using ink to brand your cup so customers remember your name for the future. Both stickers came off of mine, so they are now both unbranded with no sign of Sweese.\n"}
{"text": "I was looking for several things: size, thermal retention, and aesthetics. So far, I got what I was looking for! I usually drink my cold beverages with my 12 oz Mason Jar but I wanted to drink warm/hot beverages while enjoying the colors and aesthetics of the beverage, like latte, tiger milk boba, butterfly tea, etc. I am definitely pleased with the heat retention of these cups. The outside of the cup feels normal to the touch, which is great when you want to carry it from one place to another. The inside keeps the beverage very warm for about 30 mins (probably more) Then it slowly cools down. I gotta say though, be careful with these. They feel like they can break with a slight clink or stacking because they are very light. They're also a little bit slippery, so grab the cups by the handle or use both your hands to handle them. Other than that, thank you Sweese for the great customer service! I love that you guys include a 30 day warranty along with a registration of a 1 year warranty.\n"}
{"text": "i bought 4 cups 2 weeks ago. one got cracked i don't know how, safety issue , i  threw out all. so thin glass not recommending.\n"}
{"text": "I was so pleased with these coffee mugs that I ordered a second set for a gift. I prefer double walled coffee mugs because they keep my coffee and tea hot much longer and I am a bit of a slow drinker. This size is perfect for my husband and I  in the morning.  I drink a cappuccino and he has a  pour over and other mugs were either too large or too small for our needs. I also enjoy my afternoon tea in this mug. The glass seems a bit sturdier than some of the other double walled mugs I have had and the lines more pleasing. I also thought it was a good price compared with some other similar mugs. Nicely packaged and quick shipping.\n"}
{"text": "That is the inside bottom of a broken cup. It just had ice water in it. I reached over for a drink and when I took a sip it bubbled. I then noticed a small piece of glass had popped out in the bottom. I am lucky I did not drink it. These are really expensive for two glasses but I can not find any way to get ahold of the sellers for a replacement. I wont buy again. For this much money for a stupid mug, they should last. I have never washed in any way but by hand and I always put them away right after use. Sucks. I think I would pass if I were you.\n"}
{"text": "The cup is light and pretty, HOWEVER, its unrealistic to say these are usable. Sure, you could but how will you clean it with no water?! Just wiping it down?! Used it once, havent been able to get the water out of the layers of the cup. I tried a blow dryer, leaving it outside in the sun, microwave, everything & 2 weeks later water is still there all foggy and ugly looking. I would NOT recommend these and would love to return but I got rid of the box.\n"}
{"text": "I absolutely love these mugs and would've given 5 stars. But one of mine cracked today from being washed in the dishwasher (top rack)...when I tried to exchange it, I was told it's too late since I purchased the mugs 5 months ago. This is outrageous to me...these are presented as the highest of quality and therefore should not crack after just 5 months of use. The price point is too high for this to be acceptable. Super disappointed that they won't send me a replacement for my cracked mug.\n"}
{"text": "These coffee mugs come safely packaged in a nice box so would make a great gift. They are easy to hold and are the perfect size for a nice cup of coffee. These are definitely some of the prettiest insulated mugs I have seen. I have had no trouble with leakage since I received them. For someone who prefers a lighter mug, these are a good choice. They are pretty and functional and allows you to handle a mug of hot coffee without burning your hand. I am enjoying using these!\n"}
{"text": "Beautiful mugs! Great quality and packaging. Even received a free promo item and warranty statement.  Definitely purchasing more products from this company.\n"}
{"text": "Beautiful mug and keeps coffee warm. UNFORTUNATELY, both mugs broke during routine hand dishwashing. Not at all durable. Not worth the price.\n"}
{"text": "Love the light weight of these coffee mugs along with keeping things warm.\n"}
{"text": "I loved these! Used for a week and they both broke. Its like with time and use they start getting fragile. So disappointed I spent $24 for these to last me a week. \n"}
{"text": "These mugs are fabulous. Love the smooth feel of the glass. Have already gifted 2 sets to friends!!\n"}
{"text": "I love how the handle is wide enough to get a good grasp on the mug. Also love the look to these mugs. Perfect for the coffee videos I make!\n"}
{"text": "I loooove these! Theyre so aesthetically pleasing. I gifted them to my mom, and she was so excited to use them. Definitely buying more to complete a set.\n"}
{"text": "I'm hoping these cute cups will keep me from Starbucks. They seem like they are real glass. High quality. My iced coffee doesn't make the cup sweat. Highly recommend.\n"}
{"text": "Not good\n"}
{"text": "Larger than I thought...handle is a little too square and large for my fingers...but 'love' drinking out of the insulated cups.  Coffee stays hot inside and cup doesn't get hot outside.\n"}
{"text": "The product delivers what it says. It is double insulated. As I said it keeps my tea hot. But one thing I notice you can not register the products.\n"}
{"text": "Gave this as a gift to tea lovers and theyre awesome! They keep the tea super warm, theyre big, you can put them in the dishwasher. So cool!\n"}
{"text": "These mugs are great.  They serve the purpose of keeping your drinks warm or cold.  But since they are glass and lightweight, they can be a little slippery.  Also be careful, don't slam them down or they will break.  But they are still recommended.\n"}
{"text": "I found this product online how I feel most did, Amazon Tik Tok finds and had my dad order a set for a apartment warming gift and then bought my own to make a set of four. Im so happy I did! I havent experienced any issues with water getting into the walls of the cups or any other issue, although I wash my by hand. They are cute, feel durable and hold a decent amount of coffee in them. Love these guys \n"}
{"text": "Love the Sweese double walled mug set.  Easy to hold, keeps coffee hot but mug remains cool enough to hold comfortably.  Cleans in seconds\n"}
{"text": "Got a new pour over and wanted something to compliment it. I came across these clear mugs. I really like the look of the double wall and doesn't scald my hands if I want to hold it by the cup versus the handle. Highly recommend!\n"}
{"text": "Glasses are great! Keeps warmth longer than other glasses I ever owned.  You cant burn yourself if you grab the glass either which is a plus! Also light and easy to hold. See the attached picture, coffee looks amazing! I had one of the glasses come defected, wrote email to Sweese, within 3 hours wrote back, got brand new glasses shipped!! Really great customer service! Keep up the great work!\n"}
{"text": "These mugs definitely hold the heat yet your hand stays cool. Like the clear glass as certain teas have their own beautiful colors to enjoy.\n"}
{"text": "I bought these mugs after seeing a similar (more expensive) set at an Airbnb I stayed at. They're amazing. Super light and easy to hold, and I love the double wall. No more burnt hands!\n"}
{"text": "I loved the insulation in this cup, no matter how hot the liquid in the cup is youll not feel it when you pick up the cup. The cup is however very thing.\n"}
{"text": "I love these. So simple and easy to handle. Great clean mugs!\n"}
{"text": "Very elegant. Lighter than they look.\n"}
{"text": "Excellent product, I love it!\n"}
{"text": "So far, so good! such a nice mug!\n"}
{"text": "Love these. Very classy.\n"}
{"text": "Love my new coffee mugs! Feel chic in my pj's and enjoying my coffee in them! Thanks Sweese!\n"}
{"text": "Arrived in perfect condition and excited to use it!\n"}
{"text": "Nice pair of mugs.\n"}
{"text": "This was a gift to my wife who yearned for it the moment she saw it! It's so comfortable to hold and is truly insulated, as we didn't feel ANY heat radiating from the hot drinks we had in it. However, one day while washing the dishes, she accidentally bumped one and it shattered upon falling on the floor - my wife was devastated :/. So, we need to get more! With that said, this is a MUST BUY!\n"}
{"text": "We've had these glass mugs for 4 months and love them. So great for enjoying the creme and foam toppings with the Nespresso coffee capsules. Helps keep coffee warmer than a regular cup/mug, but, of course, it's not like a thermos environment. We hand wash ours after each use and they look as good a new.\n"}
{"text": "These cups were the perfect size for my iced coffee.  The double-wall is well-made preventing my drinks from sweating and the cup is seemingly durable.  Handled cooling down my hot espresso with ice fairly well.\n"}
{"text": "I use this set quite often for our morning tea. I love that it looks classic, is easy to use and a perfect house warming gift! I have already gifted two sets to our friends and they absolutely love it.\n"}
{"text": "These mugs are light and sturdy! They make everything you drink so aesthetically pleasing!\n"}
{"text": "A bit pricey for coffee cups but they hold heat well and have a true vacuum insulation. a bit on the fragile side though.\n"}
{"text": "The mugs worked well and kept my coffee hot.  However, after only 1.5 months of ownership, both mugs have water in the space between the inside and outside of the mug, which has essentially ruined them.\n"}
{"text": "My cup broke inside by itself a month after I bought it. Very weird it broke with holes inside between the walls. Very bad quality, do yourself a favor and dont buy it.\n"}
{"text": "Very light and almost like plastic glass.  I thought I would hate them when I first received  them, but I really like them.\n"}
{"text": "Very light and classic. Cant wait to put it to use. Not only that it very well package.\n"}
{"text": "These cups are elegant and lightweight. A genuine pleasure to drink the morning coffee or an afternoon tea.\n"}
{"text": "So cute. Love these\n"}
{"text": "I wasnt sure about these cups when I ordered them. They were kind of expensive for coffee cups. They are now my favorite all time cups. Light and easy to hold. Insulated. And you can see what youre drinking. I absolutely love and recommend them.\n"}
{"text": "Just received the mugs and they look similar to the picture. Thought the glass would be thicker but we'll see how well they hold up. I'll have to use them for a period of time to verify their quality and efficacy. So far so good!\n"}
{"text": "I've had these mugs for about a year now. I've seen the reviews about the dishwasher so I handwashed them for a long time, but we got lazy and started putting them in the dishwasher for the past 4 months or so with no problem. Other reviews said water gets inside but we have not experienced that yet. The double wall is incredibly insulated, if you were blindfolded you would have to guess if there was boiling water inside of it. The handle is large to hold comfortably and the mug as a whole feels very sturdy. We love them!\n"}
{"text": "So I have been using these for the past few days now to drink my morning dose of coffee daily and I prefer mine piping hot. the cups are great the outer surface doesn't heat up as mentioned and have had no troubles holding it which I had with my regular cups. Overall design-wise also I find it pretty ergonomic and easy to hold either from the handle or wrapped up in my palms. So would I recommend this as a gift ?? maybe depends on the person whom I'm thinking of gifting, but as a user of these products I will for sure recommend them for personal use.\n"}
{"text": "I really like these mugs. You can hold them without worrying about burning your hands. They are clear enough to see exactly what's inside your mug (I use them for hot chocolate bombs so you can watch the chocolate melt). They're great.\n"}
{"text": "Like that it keeps my coffee somewhat warmer longer. Still feels like plastic, not real fond of that. Other than that, good investment. Edited: really not a great value! Keep your money. Too large of a coffee cup, that doesnt keep your coffee any warmer!\n"}
{"text": "They break easy when washing. Also the free teaspoons and coasters are a scam. Never received either or a response.  Most expensive cheep glass I have ever bought and had break in hot water. (I am past 30 days and cant return.)\n"}
{"text": "These are very lightweight compared to ceramic coffee cups. I am afraid I will break them but they have been through the dishwasher a few times now. I enjoy my coffee in these. the sides stay cool to the touch not hot like m other cups.\n"}
{"text": "Just okay. It doesn't keep my coffee hot as long as expected. I'm dumbed out,  but it's still a nice cup to compared to other cups. Wish it kept my coffee hot longer!\n"}
{"text": "These double walled mugs are as functionable as they are pretty! My coffee stays hotter as I cup my hands around the perfect sized mug.  I own several Sweese  products and each one is crafted with workmanship as well as style!\n"}
{"text": "I received these mugs as a gift and was so pleased! Unfortunately, one of them got some moisture in between the double-walled glass somehow (no visible cracks or flaws). I contacted the company and they have a replacement on the way to me after a brief email exchange. The mugs keep the beverage hot longer than regular mugs. I haven't used for cold drinks yet, but I'm sure they will work similarly for that.\n"}
{"text": "I recently bought a Breville Touch and was having trouble finding a 12 oz mug that wasn't too tall for this espresso machine. I needed a mug that was 4 1/4\" or less and these mugs fit perfect. The bottom of the handle is right at the 2oz mark so it is perfect for timing and checking a double espresso shot  and 1/4\" below the top of the handle is the 8oz mark which is very helpful for making a consistent latte.\n"}
{"text": "I am very pleased with these glass mugs. They are light weight and very comfortable to hold. They keep hot things hot and cold things cold. Besides that they just look really cool with the double walled sides. Anyone who likes nice glassware would enjoy these. Really pleased with this company too. They sent an email after I order to make sure everything was good along with a hand written thank you note in the box with the mugs! Now I ask, who does that!\n"}
{"text": "I absolutely love these mugs! I just received them as a gift and they are so gorgeous. Double insulated so you dont get burned, very sleek design and love the handle shape! HIGHLY recommended. Also I cannot say enough about this companies customer service. Very timely replies and you get a free gift with purchase when you email them!\n"}
{"text": "Love the size of the cup, it holds a perfect size cup of coffee.  It's great for ourdoor pools, nice looking not cheap looking\n"}
{"text": "I gave this as a gift.  They loved them! They said they are their favorite cups/mugs!\n"}
{"text": "Just received mugs in perfect condition--size and appearance are exactly as I hoped. Can't wait to try them for morning coffee!\n"}
{"text": "Its great! No leaking between walls although I will only wash this by hand as I am scared that may happen after reading other reviews. Look so pleasing, I love that I can see my drink. Very light weight and does not get very hot on the outer layer\n"}
{"text": "We love our glass coffee mugs, especially being able to see the coffee change colors as you make it. We got it as a gift and they are amazing. The double insulation keeps the coffee warmer.\n"}
{"text": "Very nice sleek looking coffee mug! Love that it is double wall and I can toss in the dishwasher when Im done.. super lightweight too!!\n"}
{"text": "These glasses are stunning  theyre a whole vibe. Theyre well made, sturdy and add so much to your kitchen aesthetic. I loved them so much I ordered 3 more sets; one for myself and two as gifts.\n"}
{"text": "Very nice looking insulated glass cups.  Not like plastic insulated cups - more delicate but not too delicate - sturdy.  Usable for hot or cold drinks.  Knowing they are made by Sweese gives me confidence that that are of good quality and will last a long time.\n"}
{"text": "The mugs are awesome! Keep coffee hot for a while and look so cool when I make speciality drinks mike macchiatos. Would highly recommend!\n"}
{"text": "I really love these. They are pretty and not too expensive. I bought the 12.5 oz size. I actually bought them for my house but my boyfriend loves them so much I gave them to him. Will need to buy another pair for my place.\n"}
{"text": "I like for hot drinks to stay hot for a long time and I like seeing what I'm drinking. These cups score 5 stars for each of these too.\n"}
{"text": "I just use for cappaccino so they are great for that.  Wouldn't want to use for every day because they are hard to hold on to.\n"}
{"text": "These are not dishwasher safe 2 out of 4 filled with water and then broke expensive mistake. Other brands like mubod brand never an issue \n"}
{"text": "I LOVE these glasses so I bought 2 sets. I have now had one cup leak water between the double wall and the other have a crack after just being cleaned. Love them so hoping they would keep better. Hoping I can get a replacement.\n"}
{"text": "We love the clear mugs since we use them for our Nespresso machines and we can view all the levels of coffee, milk, foam, etc. When washing by hand, though I do tend to have to run out the tiny water spots, but then again, we do have hard water. All in all, we love the mugs though!\n"}
{"text": "I love these mugs. Nice and elegant design, light weight, they are perfect for me to drink coffee and cappuccino. It increases the pleasure of drinking cappuccino when you can see trough the these glass mugs. I will definitely buy more.\n"}
{"text": "Theyre really cute and much lighter than I thought theyd be!\n"}
{"text": "I absolutely love the mugs! Its a great size for a nice cup of coffee or tea, I highly recommend them!\n"}
{"text": "I was pleasantly surprised by the quality of these glasses. Good quality and exactly what I was looking for.\n"}
{"text": "They are great love the clear mugg my only wished is that it would had a wider handle will be so much better\n"}
{"text": "Good quality. But doesn't hold heat as long as other expensive brand.\n"}
{"text": "Beautiful mugs, BUT, Ive only had these mugs a week and, while hand washing them, one has already cracked!\n"}
{"text": "This is my go to coffee mug!  Keeps the coffee hot for greater lengths of time for your drinking enjoyment!\n"}
{"text": "I use the product for my coffee and tea.\n"}
{"text": "Good quality and keep your coffee as warm as can be expected while looking cool. Can't ask for more than that!\n"}
{"text": "I am very happy with these glass mugs\n"}
{"text": "I love these mugs.  I got them to drink my blossoming tea. The rim is thin and easy to drink from unlike others I've tried. Sadly, my husband already broke one (he dropped it on the granite counter) so I'm buying another.\n"}
{"text": "Great for morning coffee. Only qualm is sometimes I see liquid between the glass layers - I dont see this with my other comparable glasses. Easy to clean. Handle is thin and harder to hold if you have large hands.\n"}
{"text": "Just received today so may update after some use. Arrived very well packaged and protected. Everything looks as pictured. Had durability issues with a different brand previous, so, hopefully these hold up better. Fingers crossed\n"}
{"text": "these were returned, light weight but too much so for me and very uncomfortable to hold.\n"}
{"text": "Beautiful mugs with clean lines and a comfortable handle. I washed the mugs and saw some condensation inside one, which indicates a defect in double glass walls. I wrote to customer service and they sent me a replacement right away so not only are the mugs beautiful, the customer service is also top notch.\n"}
{"text": "I love these cups, they've been great. Ordered 2, loved them so much, ordered 2 more.  I've had them for about 4 months. Now one of them has water in the double glass wall when it came out of the dishwasher, so it's going in the trash. I even double checked the product description: \"Plus they are dishwasher and microwave safe.\"  Without this issue, this is a 5 star product.\n"}
{"text": "I bought these as a gift and they love using these mugs. Coffe stays warm until your finished. Although, it says they are dish washer safe, it better to hand wash them. The recipient told me one broke in their dishwasher.\n"}
{"text": "I was looking to purchase the Nespresso coffee and espresso cups, but the cost was $80 for four cups. I found these on Amazon and got four (two coffee and two espresso) cups for half the price. I like the quality, design, and price. I did a lot of research before this purchase and found these to be the best for the price. Would definitely recommend this product to others looking for a clear, lightweight, and durable coffee mug.\n"}
{"text": "These are a little thicker than other mugs and therefore, not as fragile.\n"}
{"text": "Beautiful double insulated glass mugs.  Very happy with the design and the mug is not hot on the outside.  Love the elegance of clear glass design. They are light weight.\n"}
{"text": "I got these for my husband for Christmas. We both really like them. If you are into seeing the fancy coffee you made, get some!\n"}
{"text": "Your browser does not support HTML5 video. The product is exactly what I expected.\n"}
{"text": "Product is well made and I have received plenty of compliments about them already. Must buy if you want your coffee to be aesthetically pleasing.\n"}
{"text": "These are aesthetically pleasing and super durable. Definitely worth the price. I love that the glass doesnt get hot when drinking my morning coffee because of the double insulation. I bought two sets as gifts and they are wonderful!\n"}
{"text": "Really like these cups. Have a great look to them and not hot to handle even with a steaming cup of coffee.\n"}
{"text": "I ordered 2 of these mugs, and we love them. My husband has neuropathy in his hand's and has trouble holding anything heavy. He said these are perfect. They also keep the coffee warm longer. I just ordered 2 more. As far as duribility, I can't say because we've only had them about a week\n"}
{"text": "Glass stays cool on outside with hot beverage. Attractive glass mugs. A little large so takes up more cabinet space.\n"}
{"text": "I absolutely love this Sweese glass coffee mug!! Keeps my iced coffee cold which is GREAT as Im a slow drinker and dont like the ice to melt making watery! I hate condensation so its great that this produces NONE!! Perfect size for my grip and doesnt look like the cheap plastic ones that get cloudy after time! Absolutely love!!\n"}
{"text": "I really like the modern yet classic design of these mugs. Theyre a great addition to the kitchen, especially if you like to take pictures of your drinks :)\n"}
{"text": "I ordered these for my girlfriend to gift to her mother she loves them\n"}
{"text": "These are awesome! They are a little smaller than i expected but Im very happy with this purchase!\n"}
{"text": "I loved this product. It is perfect to make a great coffee.\n"}
{"text": "Great quality and high-end look\n"}
{"text": "They are so cute.\n"}
{"text": "Lovely mugs! Great size for coffee lovers.\n"}
{"text": "I wish they could be a little thicker glass. They seem very fragile if dropped even on the counter.\n"}
{"text": "Keeps drinks cool or hot\n"}
{"text": "Awesome Mugs\n"}
{"text": "nice glass double walled coffee cup!\n"}
{"text": "Liquid stays warm for quite a bit . Nice to drink from\n"}
{"text": "I ordered these double-walled glass mugs to use with my Nespresso machine. I love to be able to see how the coffee/cream are layered in the glass.  They are beautifully made, and so light-weight my husband instantly thought they were acrylic. But they clearly are high-quality glass.  Absolutely beautiful and packed so nicely. Would make a lovely gift for anyone, especially those that make layered espresso drinks. **Edit** We really love how pretty these glass mugs are... but they truly are glass and they are fragile. We have had one month, always hand-wash.  One developed a crack somehow close to the edge, and then today when I hand washed it it completely broke. You just have to be super careful with them. They don't seem to handle even slight bumps in the sink.\n"}
{"text": "This mug is very classy! Great for showing off a beautiful latte or cappuccino! The cup is insulated so the outside of the mug is cool to the touch while your coffee is nice and hot!! The glass used is not too thin but not as thick and heavy as a ceramic mug. I felt it was elegant yet totally practical! A lovely gift for someone ie birthday, Graduation, wedding etc! And its packaged perfectly in a nice white rectangular box. The mugs are completely enclosed in thick Styrofoam pillows! Ready to wrap and give as a gift!!! Nice product!\n"}
{"text": "I really wated to love these glasses. They are attractive. However, I noticed no difference in longevity of heat betwen this and my ceramic mug. These are cool to touch, which is a nice advantage over ceramic. I washed these gently by hand, never using the dishwasher  They have never been left to soak in water. Never the less, fluid and condensation is present between the glass layers. This shouldn't be possible, esp. considering that I treat them with such care. Very disappointing.\n"}
{"text": "These Mugs are my absolute favorite drinking glasses. Im an avid tea drinker so I love the ability to easily see which herbal blend is in my cup and to make sure my tea bag has been seeping long enough. It nice to hold without feeling the heat of the beverage. On warmer days Ill add ice to my coffee or tea to have it chilled. Not only are the glasses functional but theyre very clean and classy to fit any home decor. What a delightful container and holds the perfect amount of coffee when I use my Keurig as well. I plan on buying more for my family.\n"}
{"text": "I would have given 5 stars if one out of my two cups didn't break (while hand washing) within the first week.  Otherwise, I love my remaining cup.  It keeps my coffee piping hot 15-20 minutes...pretty amazing.  I probably will buy a few more if they come back into stock.  They fit perfectly under my Mr. Coffee One-Touch CoffeeHouse Espresso and Cappuccino Machine.  And, they actually hold 13 oz. to the rim.  Plus, your first order from Sweese gets you a free set of coasters (must write a review).\n"}
{"text": "Bought these mugs a couple months ago and they have been well used since. They are perfect for a variety of hot drinks, including all types of coffee concoctions such as lattes. I had never used double walled glass mugs prior and admittedly was afraid they'd be fragile but they have held up much better than expected. Used by all our family members who enjoy their styling, size, and temperature control. Love the visual appeal of layered espressso- milk froth drinks!\n"}
{"text": "This is second set of 2. We broke the other 2 but replaced them with 2 more. We broke them when I removed the plate from cupboard and accidentally pushed the cup out. Funny, my husband did exactly the same thing. Mug keeps the tea and coffee hot or warm nicely. You can hand it over from one person to other without burning your hand because the mug has double wall.  I do wish the price was lower. Still love it.\n"}
{"text": "***UPDATE - Today is December 31st and the second mug has started cracking inside the double wall. These things are junk and a waste of my hard earned money! Dont waste yours!! I bought these on September 16....today is December 4th and I have to throw one of them away as it randomly cracked. See picture. I brewed my coffee in it as usual. When I went to pick up my cup I noticed it cracked all the way around it. I assume the heat from the coffee made it crack. Not worth the money!\n"}
{"text": "These are beautiful mugs which definitely keep my coffee warmer longer than any other mugs I have (and I have a lot)! I have arthritis which makes it difficult to lift/hold a traditional heavier mug. These are very lightweight and easy to hold. It's also great that I can now use both hands to pick up a mug of hot coffee and not burn my fingers. Looking forward to using them in hot weather for iced drinks without the mugs sweating. I contacted the seller about a question I had and they responded very quickly. Very happy with the products as well as the seller.\n"}
{"text": "I love all of the Sweese dishes and mugs Ive purchased and these glass mugs are no exception! Comfortable to hold and double walled kept my iced tea cold. Happy with these and theyd make a nice gift. I found Sweese when I was looking to replace my dishes and learned that many (most) brands contain lead in the glaze or product. Sweese was was of the few exceptions! I purchased from them because of the pretty colors they offer.\n"}
{"text": "Just what I was looking for. Light, easy to hold and clean and is microwaveable. 10/10 would recommend.\n"}
{"text": "They were a gift and she loved them.\n"}
{"text": "I absolutely love these mugs!! They are beautiful and my lattes are so pretty in these see-through works of art!\n"}
{"text": "So far no problems. The material is great and its beautiful.\n"}
{"text": "Very nice mugs. I just love them \n"}
{"text": "Cups protect my hands and look great in my kitchen. Theyre also the right size for coffee or tea. Would buy again!\n"}
{"text": "Love these glass mug !!! I was so excited to get them ... perfect for coffee and tea !!! Would recommend them \n"}
{"text": "Keeps liquid hot/cold.\n"}
{"text": "I love the simple minimal look, sleek and sophisticated. The handle is super comfortable too.\n"}
{"text": "I love these cups!!!\n"}
{"text": "Great insulated glass mug. Zero condensation with cold drinks. Mug remain cool to touch even after heating up water with it in the micro. Highly recommended.\n"}
{"text": "The cups are glass and high quality, and super cute! Also holds a good amount\n"}
{"text": "Absolutely in love with my glass mugs. Ive been using for a week and these mugs have kept my coffee warm for hours. 100% recommend!\n"}
{"text": "Great stylish and size cups for a coffee\n"}
{"text": "There isn't anything about Sweese I do not like!!! I love the look of each of my Sweese products, their durability, and all around quality...\n"}
{"text": "These look great and are sturdy.\n"}
{"text": "Had it for three days before it developed a minuscule crack that leaked water between the insulated layers. FYI, I was handling it gently in the sink.\n"}
{"text": "I bought two series of these mugs. They are nice and durable.\n"}
{"text": "Bought these as a replacement. They are very light and certainly keep the coffee hot. No worries about the glaze. . . There isn't one.\n"}
{"text": "These mugs are attractive, but not durable and definitely too expensive.  I dont think theyre worth $12 per mug.\n"}
{"text": "These mugs got completely destroyed after just about 1.5 months of use. After putting in the washing machine (the packaging states these are dishwasher safe), somehow water leaked in between the two layers of glass in the mug and became impossible to get out. Not only is this unsightly and looks gross, the issue with this is that the inside of the glass started to have a really musty smell and I had to throw them out.\n"}
{"text": "I absolutely love these cups! I bought a set last year and now I have bought another Pair. I plan to purchase two more so I can have a complete set of six get rid of the old coffee cups that I have . I have not had any problems with leaking,  breaking, cracking, anything! Theyre simply just beautiful cups.\n"}
{"text": "This cup is elegant, light to pick up and a delight to drink various coffee drinks - especially a latte. I have had them now for four months and I found them to be sturdy enough to withstand even my clumsiness. I would definitely buy them again  in fact I bought the larger ones from the same manufacturer.\n"}
{"text": "Nice mugs that gets me compliments from guests! Love the fully transparent glasses for fun at home lattes and other drinks. Double wall seems to be holding up completely fine for me! I hand wash so I cant speak to how the seal would hold with frequent cycles in the dishwasher. I think it keeps my drinks as hot as any other mug, no complaints but nothing mind blowing either. Im the only person in my house, so Im also glad this is only a set of 2. Overall very happy and hope to get many many more uses out of these!\n"}
{"text": "I'm obsessed with the look of these mugs. So chic. I'm sure they would break if I hit it hard on the counter or something so I handle with care. But oh my gosh they feel so good in my hand. They aren't hot like a regular mug! I had no idea.\n"}
{"text": "The cups are great at keeping liquid hot! My reservations are that they are fragile, dont expect these cups to last for years, esp. in the dishwasher. One of mine has a leak which allows water to seep in while washing, minor issue, since the second glas later does not leak.\n"}
{"text": "Gave these to my sister for her birthday. She had ones from William Sonoma but broke both of them and had wanted another pair so I got her these and she likes these even better! They are beautiful and they hold a good cup of coffee!\n"}
{"text": "Looks pretty but it will break very soon. Mine broke so I repurchased again. But the second one also broke. It means its not my fault. The item is poorly made. I wont recommend this item if you are looking for a glass cup that last at least a year. This will break in 1 month. Go for other option. Its pretty to look at it. Not a cup. Just a decor item.\n"}
{"text": "As beautiful as these mugs are they are extremely delicate. First broke the day i used it for the first time. Second broke a week later. $24 for such delicate pair is a sheer waste. Disappointed!\n"}
{"text": "These mugs kinda suck. They are nice while they last but they dont last long for the money. The first mug we had broke while hand washing. The replacement mug they sent cracked at the top and now air gets in to the inner core. And now our last mug I went to go drink from it and it randomly cracked at the bottom inside the glass and coffee started flooding into the outer core. Quality is just bad on these. Weve had them all less than 3 months.\n"}
{"text": "Easy to hold and clean!\n"}
{"text": "These mugs are beautiful and very light to handle. I love the clear look without burning your hands.\n"}
{"text": "I use this for hot coffee.  The cup is never hot. Feels delicate but hasn't chipped or broken.\n"}
{"text": "Love them!\n"}
{"text": "Great quality!!!\n"}
{"text": "Love the design and quality\n"}
{"text": "Love them! Beautiful design.\n"}
{"text": "Great product\n"}
{"text": "Lovely double wall glass mugs, we love the double glass its perfect for hot and cold coffee.\n"}
{"text": "They look great!\n"}
{"text": "Arrived promptly and they are very sturdy.\n"}
{"text": "Definitely giving this product five stars. These have become my new favorite coffee cup to drink out of. They keep my coffee warmer longer. Super comfortable to hold and I absolutely love the double wall. I can hold my coffee cup without burning my hands yet my coffee stay warm. Definitely buying more.\n"}
{"text": "I drink hot tea and hot water most of the time and having a glass that I dont have to worry about scorching my fingers that is wonderful.\n"}
{"text": "Pretty much need to work hard to make it look clean...\n"}
{"text": "I love these cups for hot tea and cold drinks. It keeps coffee hot but not like a thermal cup but I am still very happy with this purchase. I cant wait to get my free spoons. Thanks Sweese!\n"}
{"text": "Really great for product photography and good for drinking your cold and hot drinks. The bottom of mine cracked, but because its so well layered, the crack actually doesnt interfere with the cup. LOL so I still use it\n"}
{"text": "Beautifully crafted double wall mug. I placed a standard size tree decoration inside to give you an idea of the size. I can't wait to brew a latte and see the separation of foam and coffee!\n"}
{"text": "Just received my order, so far I really like it. I have had it recommended to me by many people. It seems sturdy, but light weight and has a really sleek, modern design. Perfect additin to any coffee/matcha station :)\n"}
{"text": "Love these. Have small espresso size and larger coffee size and they are my go-to mugs.  Keeps warmth without being too hot to hold. Sleek and cool looking also.\n"}
{"text": "Classy cup and also durable\n"}
